{"Ticker":"MSFT","Date":1641854710,"Headline":"Microsoft (MSFT) Gains As Market Dips: What You Should Know","Source":"Yahoo","Summary":"In the latest trading session, Microsoft (MSFT) closed at $314.27, marking a +0.07% move from the previous day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=62c5b41610188a0657523cbfce161f9d2bd03efad3ca9788bc35e50151701c94"}
{"Ticker":"MSFT","Date":1641854295,"Headline":"Dixon Hubard Feinour & Brown Inc Buys Vanguard Short-Term Government Bond ETF, Intuit Inc, ...","Source":"Yahoo","Summary":"Investment company Dixon Hubard Feinour & Brown Inc (Current Portfolio) buys Vanguard Short-Term Government Bond ETF, Intuit Inc, Vanguard Total Stock Market ETF, CME Group Inc, Schwab U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d72f14a560e812bdaaab6c9d606ea74f34b7470314d1e18bbf074e90b6ee5b90"}
{"Ticker":"MSFT","Date":1641852275,"Headline":"Apple is still bigger than all these companies combined","Source":"Yahoo","Summary":"King Apple still towers over its megacap peers despite the tech selloff"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a30df40725bdd7d32dbb07fcaa296c8e4bcda25a70d115ac9473e270b22b05f"}
{"Ticker":"MSFT","Date":1641850991,"Headline":"The top 50 stocks by market cap in the S&P 500","Source":"Yahoo","Summary":"Jared Blikre dives in the most valuable S&P stocks by market cap."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d3cf4f3bdb88e90c8e28f8953db1e260be088191334c12b0922cdee75efabbea"}
{"Ticker":"MSFT","Date":1641848400,"Headline":"What Investors Need to Know About Okta's Acquisition of Auth0","Source":"Nasdaq","Summary":"If you're an existing or potential investor in Okta (NASDAQ: OKTA), you're likely aware of its $6.5 billion acquisition of Auth0 last spring. As the Software-as-a-Service space becomes increasingly overcrowded, what should investors think of this recent business expansion and how"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a2921e4e0a6f00da67773372ab1bc561b9a0a2ccd447b0fd756f3e56179d7e8f"}
{"Ticker":"MSFT","Date":1641843680,"Headline":"Market outlook for 2022: 'Focus on things that have real earnings value right now'","Source":"Yahoo","Summary":"Brent Schutte, Chief Investment Strategist at Northwestern Mutual Wealth Management, joins Yahoo Finance Live to compare the worth of growth and value stocks, where to find value as stocks in sectors like technology begin to slide, and large and small-cap growth."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=342c5b8c88877841b3715daa1fd9c75cb57aaf2d6131e73ba366106df62c4357"}
{"Ticker":"MSFT","Date":1641841282,"Headline":"Will Microsoft (MSFT) Stock Deliver Growth in 2022?","Source":"Yahoo","Summary":"Microsoft stock has had a spectacular run in the past couple of years. Will 2022 be a repeat, or will it capitulate to shifting investor preferences?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5825cef687a714be1490cef4e3053e5a0e1b56bddfcb728066fde107e00cb7f"}
{"Ticker":"MSFT","Date":1641840713,"Headline":"Big tech is selling off, with households more exposed than ever","Source":"Yahoo","Summary":"Big tech and Internet stocks were under pressure on Monday amid a market sell-off in high-growth stocks. The declines came amid a rising 10-year treasury yield."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=16c13189d4b0309c1412d89b3ccaa498da640e6bc96121795d7b82bd6a694f40"}
{"Ticker":"MSFT","Date":1641839692,"Headline":"Is This Inflationary Period Really Transitory?","Source":"Yahoo","Summary":"In this segment of Backstage Pass, recorded on Dec. 13, Fool contributors Jason Hall and Toby Bordelon discuss what \"transitory\" even means in this context.  Jason Hall: The latest we saw, CPI-chained inflation -- consumer inflation -- rose 6.8% in November from the year-ago period."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9d007ffc3d59250edd3d2d04bafef2a990c630ee51e786a4921488135646ede"}
{"Ticker":"MSFT","Date":1641838562,"Headline":"How Do Investors Know When It's Time to Rebalance Their Portfolio?","Source":"Yahoo","Summary":"In this segment of Backstage Pass, recorded on Dec. 13, 2021, Fool contributors Jason Hall, Rachel Warren, and Toby Bordelon discuss.  Jason Hall: I look at this as an example, and I want to be clear here, I'm not calling out Microsoft as a company that I necessarily think is overvalued, but today Microsoft trades for almost 15 times sales.  Its operating margin has also largely gone up over the same period."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1aab67bf80bff966f14b11b935fb6a77878cccc1c71a0cd87a4fe49aac15b71b"}
{"Ticker":"MSFT","Date":1641836948,"Headline":"US STOCKS-Wall Street tumbles as tech stocks extend slide","Source":"Yahoo","Summary":"Wall Street's main indexes tumbled on Monday, as heavyweight technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs.  The Nasdaq fell as much as 10.37% below its intraday record level reached on Nov. 22.  \"Big tech companies should do fine because rising rates don't really affect them too much,\" said Randy Frederick, managing director of trading and derivatives at Charles Schwab in Austin, Texas."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4579c24deeca58a202aa7df49c23c8b277564766d5dc1098e655510575101b0"}
{"Ticker":"MSFT","Date":1641833661,"Headline":"Market check: Dow plunges 500+ points, 10-year yield climbs, crypto stocks sell off","Source":"Yahoo","Summary":"Yahoo Finance Live’s Jared Blikre breaks down how markets are moving in midday trading as  Amazon, Meta, Nvidia, Apple, Microsoft, and Tesla stocks underperform."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23051c7727a8de664ff7f6e53e77af35e8cb19a49006d092d0224be3b990ab44"}
{"Ticker":"MSFT","Date":1641831374,"Headline":"My Nifty 50 Stock Portfolio","Source":"SeekingAlpha","Summary":"I'm sharing my 50-stock portfolio update with the world. The portfolio consists of 83.13% equity, 12.68% cash, 4.19% fixed income. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a84acf6f73cfeaf57a1bb37f355d9f6c7c7a2e2cbcb448bc6b8a609469a8ce13"}
{"Ticker":"MSFT","Date":1641830841,"Headline":"Joe Manchin's former aides gain influential lobbying clients as their ex-boss battles Biden's agenda","Source":"CNBC","Summary":"Former aides to Sen. Joe Manchin who are now lobbyists are scoring big clients as their ex-boss battles President Biden's agenda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=13c03f30005f651331f2a34931690b9b040475aa5d00ff462ba2e15d7e764365"}
{"Ticker":"MSFT","Date":1641830479,"Headline":"Wall Street closes lower with Nasdaq staging late session comeback","Source":"Finnhub","Summary":"U.S. stocks ended down but well off theirlows of the day, with the Nasdaq staging a furious comeback latein the session as some investors appeared to be hunting forbargains even as they worried... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f6cab3eec71abf516c211f23b616460c0b0854d79ee09806570f1ee5875b3a29"}
{"Ticker":"MSFT","Date":1641829500,"Headline":"The Top Stocks These Investors Plan on Buying Soon","Source":"Nasdaq","Summary":"Looking for stocks to add to your list of potential buys? In this segment of Backstage Pass, recorded on Dec. 13, Fool.com contributors Jason Hall, Rachel Warren, and Toby Bordelon discuss the top stocks on their watchlist as they enter 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c4022205779524fdc8dd1a4377022d9ebe7fdc2b7846594682816801b941e9af"}
{"Ticker":"MSFT","Date":1641829323,"Headline":"Alphabet (GOOGL) Adds Trending Section, Game Updates to Stadia","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google is expected to gain strong momentum among gamers with the latest features and updates on Stadia."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3a38dd0e9c4f6d82e866cf4723b5560f683c7d780e9160ceaa38adb2a5ba8625"}
{"Ticker":"MSFT","Date":1641829263,"Headline":"The Zacks Analyst Blog Highlights: Microsoft Corp., UnitedHealth Group Inc., and The Charles Schwab Corp.","Source":"Yahoo","Summary":"Microsoft Corp., UnitedHealth Group Inc., and The Charles Schwab Corp. are included in this analyst blog."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b096614b85a630e53dfa2629074289b04015a8dedd39a75b5aacbb930e52f2aa"}
{"Ticker":"MSFT","Date":1641829039,"Headline":"Market check: Stocks fall in early trading, tech renews declines, Tilray shares soar","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre joins Yahoo Finance Live to discuss the stock market as Amazon drops to its lowest level since May 2021, Tesla faces its fifth day of losses this week, and Tilray shares soar 18% even with the overall market being down."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c0fc286ad580875817a22d7c7d29c0de7ffb5515259d2ee13be63c756984784"}
{"Ticker":"MSFT","Date":1641826923,"Headline":"Itron's (ITRI) Industrial IoT Solutions Witness Strong Traction","Source":"Yahoo","Summary":"Itron's (ITRI) Industrial Internet of Things (IIoT) solutions is being leveraged by Malaysia-based company, Sarawak Energy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d207bed06c4260b85cc6a15bac9946876585167d807d57d66597a4ae37b26b80"}
{"Ticker":"MSFT","Date":1641826380,"Headline":"Market Outlook 2022 - Stock Market Review 2021, Outlook On U.S. Stocks And Bonds Next Year","Source":"SeekingAlpha","Summary":"While the S&P 500 performed well in 2021, only 25 of the stocks on the SPX accounted for more than 40% of its weight."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9493b14bcd5b2b50303fd0e83abb592e829d81972dfe62ad25ea78e4fcd066eb"}
{"Ticker":"MSFT","Date":1641826022,"Headline":"BlackBerry (BB) Boosts Water Sustainability With Research Challenge","Source":"Yahoo","Summary":"BlackBerry (BB) extends its partnership with the University of Waterloo's Water Institute to tackle water-related challenges that hamper ecosystem and climate conditions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f50a0794c5e371fcadd7c746117fc1ebe50cb6d99530fccdcb9bfdb3428ebb09"}
{"Ticker":"MSFT","Date":1641825120,"Headline":"Wall Street tumbles with Nasdaq leading declines","Source":"Nasdaq","Summary":"Wall Street's main indexes tumbled on Monday with Nasdaq leading the declines as technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d2d365624a95a1f82096be1e5c107ce19ab0bddd8740182e3a18a6b764998f0"}
{"Ticker":"MSFT","Date":1641822935,"Headline":"US STOCKS-Nasdaq set to open lower as tech stocks extend declines","Source":"Yahoo","Summary":"Nasdaq futures fell 1% on Monday as heavyweight technology stocks dropped on expectations of a high interest rate environment, while big banks extended gains after U.S. Treasury yields climbed to new two-year highs.  Megacap growth companies including Apple Inc, Amazon.com Inc, Microsoft Corp, Meta Platforms Inc and Tesla Inc fell between 1.2% and 2.8% in premarket trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6e6b514a9b12c20f54b2f9e22d01ecdaada0e3ea1a2e29e2d3d5dfc8bca8597"}
{"Ticker":"MSFT","Date":1641820876,"Headline":"10 Small-Cap Stocks to Buy According to Billionaire Steve Cohen","Source":"Yahoo","Summary":"In this article, we discuss the 10 small-cap stocks to buy according to billionaire Steve Cohen. You can skip our detailed analysis of Steve Cohen’s hedge fund, and go directly to read 5 Small-Cap Stocks to Buy According to Billionaire Steve Cohen. Billionaire investor Steve Cohen is the brain behind Point72 Asset Management, a hedge fund […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=05c185387cca4e8170bf37430b86c6f8928cd0635677859e00e42c6a9c98db5e"}
{"Ticker":"MSFT","Date":1641818948,"Headline":"Wall Street tumbles as tech stocks extend slide","Source":"Finnhub","Summary":"Wall Street's main indexes tumbled onMonday, as heavyweight technology stocks dropped on expectationsof a sooner-than-expected rate hike that pushed U.S. Treasuryyields to fresh two-year highs. ... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=abf2751435def7cc00e8013879a0192d6bd7821672fb11ffcdbe2af6aaadae49"}
{"Ticker":"MSFT","Date":1641814020,"Headline":"Notable ETF Inflow Detected - SPY, MSFT, GOOGL, FB","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the SPDR— S&P 500— ETF Trust (Symbol: SPY) where we have detected an approximate $6.8 billion dollar inflow -- that's a 1.5% increase we"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3baf4b54d6c4b0e435b76adfd0a5bd6d95fac5c40f27b0fe0975024f13c80ae2"}
{"Ticker":"MSFT","Date":1641813670,"Headline":"Microsoft: Neither All In Nor Selling","Source":"SeekingAlpha","Summary":"Microsoft stock is off 10% off its all-time highs. Read why we continue holding our shares while evaluating the options chain to sell puts at opportune moments."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b650c506732f2698f58dbd348fddbcdfc9b0b5d87bc88769be76e9c0e725d956"}
{"Ticker":"MSFT","Date":1641812039,"Headline":"It's A Bear Market, No Wait, It's A Bull Market","Source":"SeekingAlpha","Summary":"A lot of digital ink is spilled debating whether we are in a continued bull market or when the next market crash will arrive. Read what to know here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54d260ad37c17a04b1230d6e64f11427bd6c231d46f8231b4a49166dd0016730"}
{"Ticker":"MSFT","Date":1641809157,"Headline":"Ferrari unveils new organisation and top team to face electrification challenge","Source":"Finnhub","Summary":"Ferrari on Monday unveiled a new organisation and leadership changes to help it streamline processes, in the first major move by the sportscar maker's new chief executive as the company embraces... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=399821ef7457d0ba555005517aab525c131509eca3f8f8c1474621eec56cbba9"}
{"Ticker":"MSFT","Date":1641807180,"Headline":"Benzinga Asks: Which Company Could Join The $1-Trillion Market Cap Club Next? Did NVDA, TSM, BRKA Or TCEHY Win?","Source":"Benzinga","Summary":"Several of the largest technology companies made headlines in 2021 for hitting significant market capitalization milestones.\nMicrosoft Corp (NASDAQ: MSFT) hit a $2-trillion market..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36cdad239316c49c6bfaa7654643f204a7a793f32f002d0246509d9c824c7132"}
{"Ticker":"MSFT","Date":1641805092,"Headline":"Johnson & Johnson Medical Devices Companies: reimagining the patient journey in a digital era","Source":"Finnhub","Summary":"When a patient arrives at an emergency room, a doctor will typically ask about medical history and symptoms, possibly order blood work and tests, and then, using all that information,... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b8720ebe227ec31606d0a5d378e16fbf37ce3210f6b932a7ca53128cbe75995"}
{"Ticker":"MSFT","Date":1641804000,"Headline":"How to Beat the S&P 500 in 2022","Source":"Nasdaq","Summary":"Famous investor Warren Buffett is famous for (among other things) winning a bet that money parked in an S&P 500 (SNPINDEX: ^GSPC) index fund would outperform professional money managers over 10 years. It's not easy to consistently beat a collection of the world's largest and most"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afadb65b82cea7ebda29107f534ec77be0814d7da41c125b1196569864ae78a3"}
{"Ticker":"MSFT","Date":1641801600,"Headline":"Microsoft Is Hitting Home Runs, With The Metaverse On Deck","Source":"Nasdaq","Summary":"The metaverse could be an $800 billion addressable market by 2024, according to Bloomberg. This is a massive opportunity for any tech company able to gain significant market share, and there's one company with the history and inside track to gobble up a gigantic portion of it."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db221ce7ecf4d80212e63970fe380af311f51752249666b2d29897dd075902ff"}
{"Ticker":"MSFT","Date":1641799800,"Headline":"Want $1 Million? 2 Monster Stocks to Buy and Hold for the Next Decade","Source":"Nasdaq","Summary":"In Warren Buffett's 1993 shareholder letter, the legendary value investor cited this quote: \"In the short run, the market is a voting machine [...] but in the long run, the market is a weighing machine.\" In other words, volatility is unavoidable. At times, great companies may los"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04686d8cf97f03481e94b74c5660db6ee1b6e45270246ea1cf345e7948e839aa"}
{"Ticker":"MSFT","Date":1641799020,"Headline":"US STOCKS-Futures muted, banks extend gains on high yields","Source":"Nasdaq","Summary":"U.S. stock index futures were subdued on Monday after posting losses for their first week of the new year, while big banks extended gains as U.S. Treasury yields climbed a new two-year high."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fbaf705ddec99045c91229fe29ee515c25961b116b4da8da29b168da0528d771"}
{"Ticker":"MSFT","Date":1641794760,"Headline":"Investing in This ETF Right Now Could Make You a Millionaire Retiree","Source":"Nasdaq","Summary":"So you want to amass a million dollars by retirement, and you'd like to get there by investing in an exchange-traded fund (ETF) -- a fund that trades like a stock. That's a fine plan (though some people might want to aim for more than a million dollars).There are more than 2,500"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=020f5e840ab6a7914f0fb69aba36c67c9a03fb7568c333c55ae5828580564a89"}
{"Ticker":"MSFT","Date":1641794100,"Headline":"Big Tech Stocks: What’s in Store for 2022?","Source":"Nasdaq","Summary":"Big tech stocks have witnessed a fair amount of selling over the past month. Valuation concerns and uncertainty regarding the COVID-19 pandemic led to a selloff in tech stocks. The chart below shows that big tech companies are trading in the red, while Apple (NASDAQ:AAPL) and Meta Platform (NASDAQ:FB) barely managed to stay in the green over the past month. \n\n\n\n\n\n\n\nWith tech stocks currently under pressure, let’s look at each of these tech giants to ascertain what the future holds for them in 2022.\n\n\n\nApple \n\n\n\nDespite supply-chain concerns, Apple delivered a solid financial performance in FY21. Strong sales across all product categories and strength across all of its geographies drove Apple’s financials, and in turn, its stock, which outperformed the benchmark index in 2021. \n\n\n\nLooking ahead, demand for Apple products is likely to outpace supply, as noted by Wedbush analyst Daniel Ives. The analyst is bullish on Apple stock. He sees higher demand and the easing of supply-chain issues in the first half of 2022 as a tailwind for Apple stock. Moreover, Ives noted that higher average selling prices provide a multi-year growth opportunity. \n\n\n\nBesides robust demand and higher selling prices, Ives expects Apple to gain from its growing market share in China. \n\n\n\nOverall, the majority of analysts are bullish on Apple stock. Its Strong Buy consensus rating is based on 21 Buys, 3 Holds, and 1 Sell. However, hedge funds have been selling Apple stock. TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 4 million Apple shares over the past three months. \n\n\n\nAmazon \n\n\n\nTough comparisons, cost inflation, and supply-chain disruptions weighed on Amazon’s (NASDAQ:AMZN) financial performance in 2021, and in turn, its stock price. Amazon stock underperformed the Nasdaq 100 Index by a wide margin in 2021. \n\n\n\nGiven the near-term challenges, investors and hedge funds have a negative outlook on Amazon stock. TipRanks’ Stock Investors tool shows that about 1.3% of investors holding portfolios on TipRanks have sold AMZN stock in the last 30 days. Meanwhile, hedge funds have lowered their holdings by 576.2K shares in three months. \n\n\n\nNevertheless, Monness analyst Brian White is bullish on Amazon for 2022. He expects Amazon’s growth to accelerate in the 2H22. Further, White noted that AWS’ (Amazon Web Services) revenue growth has accelerated over the past three quarters, while Amazon is well-positioned to benefit from an “accelerated digital transformation.” \n\n\n\nAlong with White, most Wall Street analysts maintain a bullish outlook on Amazon stock. AMZN has received 30 positive analyst reviews for a unanimous Strong Buy consensus rating. \n\n\n\nAlphabet\n\n\n\nAlphabet (NASDAQ:GOOGL) stock delivered strong returns in 2021 and outperformed its peers, thanks to the stellar recovery in ad sales and the strength of its cloud business. \n\n\n\nLooking ahead, Alphabet could benefit from higher advertising revenues and growth in the cloud segment. Further, its balance sheet and cash flows remain strong. \n\n\n\nTaking note of its strong cash flows, Ivan Feinseth of Tigress Financial stated that Alphabet would continue to boost shareholders’ returns through share buybacks and fund its growth initiatives on the back of its robust cash flows. \n\n\n\nFeinseth sees Alphabet benefiting from secular tech trends, including video sharing, cloud computing, growing mobile engagement, and the ongoing shift to digital advertising, among others. \n\n\n\nOn TipRanks, Alphabet stock sports a Strong Buy consensus rating based on 26 Buy and 2 Hold recommendations. Furthermore, 1.9% of the investors holding portfolios on TipRanks have increased their exposure to GOOGL stock over the last 30 days. \n\n\n\nMicrosoft \n\n\n\nThanks to the strength in its cloud business, Microsoft (NASDAQ:MSFT) stock increased over 49% in one year and outperformed the benchmark index. Despite the appreciation in its share price, Jefferies analyst Brent Thill is upbeat about Microsoft’s prospects and maintains a bullish outlook on the stock. Thill increased his price target on Microsoft to $400 from $375. \n\n\n\nThill sees Microsoft as the “safest largecap investment option” with multiple growth vectors. The analyst expects Microsoft to continue to enhance shareholder value on the back of its strong profitability and free cash flows. However, he expects Microsoft’s top-line growth to moderate a bit in the coming quarters. \n\n\n\nOverall, on TipRanks, Microsoft stock has received 24 Buys and 1 Hold for a Strong Buy consensus rating. Furthermore, it scores a 9 out of 10 on TipRanks’ Smart Score system, indicating that MSFT stock could outperform the market averages.\n\n\n\nMeta Platforms \n\n\n\nFacebook changed its name to Meta Platforms to better reflect a metaverse company. However, investors and hedge funds continue to dump their stock. \n\n\n\nTipRanks’ Stock Investors tool shows that about 0.7% of investors holding portfolios on TipRanks have sold FB stock in the last 30 days. Meanwhile, TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 1.7 million Meta Platforms shares over the past three months. \n\n\n\nMonness analyst Brian White noted, “The longer-term journey for Facebook became more intriguing in the later part of 2021 with the company introducing its vision for the metaverse, followed by a name change to Meta Platforms.” \n\n\n\nHowever, he expects Apple’s app tracking transparency to continue to hurt Meta Platforms in the future. \n\n\n\nNevertheless, he maintains a Buy rating on Meta Platforms and expects it to benefit from favorable digital ad trends and digital transformation opportunities. Meanwhile, on TipRanks, FB stock has a Strong Buy consensus rating based on 28 Buys and 5 Holds. \n\n\n\nDownload the TipRanks mobile app now\n\n\n\nDisclosure: On the date of publication, Amit Singh had no position in any of the companies discussed in this article.\n\n\n\nDisclaimer: The information contained in this article represents the views and opinion of the writer only, and not the views or opinion of TipRanks or its affiliates  Read full disclaimer >"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ad7ecad6f79af73a490aeb5d07b2c44237170a1621ad933f89c841e7c8d7063"}
{"Ticker":"MSFT","Date":1641791880,"Headline":"Microsoft & Google Shares Witness Worst Drop since Pandemic","Source":"Nasdaq","Summary":"Shares of American technology giants Microsoft Corporation (MSFT) and Alphabet Inc. Class A (GOOGL) has fallen the most in the past week, since the start of the pandemic.\n\n\n\nOne of the top metaverse stocks, MSFT declined 6.4% and GOOGL lost more than 5% in the first week of trading for the new year 2022. This has been the largest weekly slump for both companies since March 2020.\n\n\n\nRising Treasury Bond Yields\n\n\n\nThe yield on the U.S. 10-year Treasury bonds increased to 1.77% on Friday, its highest level since January 2020. The upward spike caused high growth stocks, especially technology stocks, to fall.\n\n\n\nAn increasing yield indicates an inflationary environment, which means companies will face higher borrowing costs to fund development. From the investor's perspective, a rising yield means they expect more returns on their investments. Both factors add pressure to the performance of high-growth companies.\n\n\n\nAnother factor that led to the overall downfall was the latest jobs report, which showed a slump in the unemployment rate as well as an increase in wages.\n\n\n\nOn Friday, MSFT sank by as much as 1.2% and GOOGL fell 1.4%. The iShares Expanded Tech-Software Sector ETF also slipped as much as 1.7% on Friday, and for the past week it was down 8.7%.\n\n\n\n2021 was a favorable year for the tech sectors as the pandemic-driven shifts led to major spending on tech services. Microsoft gained 45.6% over the past year and Alphabet gained 56%. Meanwhile, the tech-laden NASDAQ 100 gained about 25% last year.\n\n\n\nAnalysts’ Weigh In\n\n\n\nRecently, Wedbush analyst Daniel Ives issued a report about the upcoming earnings season for the disruptive technology stocks. The analyst says the Street is laser-focused on the stocks’ 2022 guidance.\n\n\n\nIves said, “In this vacuum of Fed news and watching every tick of the 10-year yield move on an hourly basis, tech investors wish 4Q earnings season was already here today. The absence of fundamental news for the tech space in this risk-off environment has catalyzed a brutal surge of selling tech names to kick the year off in 2022 as valuation scrutiny remains front and center for investors.”\n\n\n\nMicrosoft remains his favorite large-cap stock. Ives has a Buy rating on the stock and a price target of $375, which implies 19.4% upside potential to current levels.\n\n\n\nOverall, the MSFT stock commands a Strong Buy consensus rating based on 24 Buys and 1 Hold. The average Microsoft price target of $371.36 implies 18.3% upside potential to current levels.\n\n\n\n\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRelated News:Bed Bath & Beyond Misses Q3 Expectations; Meme Frenzy Drives the Shares UpNikola Signs LOI with Saia; Shares Soar Above 9%Uber to Stop Uber Eats Restaurant Delivery in Brazil"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=760c85ce392996aac0ba344d1675419c886e99e77ffbeeb27f25666a496eedc6"}
{"Ticker":"MSFT","Date":1641786992,"Headline":"Pranksters hijack Djokovic's virtual court hearing to stream music and porn","Source":"Finnhub","Summary":"Australia's efforts to let the media and public watch tennis superstar Novak Djokovic's court appeal against his visa cancellation descended into farce on Monday as pranksters hijacked the... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3991cbe2ad609938c25de42bf4e7561bf97a062a7d3e507c73d2cb9e0d6fb1ed"}
{"Ticker":"MSFT","Date":1641785760,"Headline":"Sector Themes In Play In The Markets For 2022","Source":"SeekingAlpha","Summary":"Dips will continue to be bought unless something significant changes. Click here for more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6d62d8f286b6960b7a4db16d3b514067ec4d996e1556715b87302038aa4bdd9"}
{"Ticker":"MSFT","Date":1641785578,"Headline":"Ferrari unveils new management team to face electrification challenge","Source":"Finnhub","Summary":"Ferrari unveiled on Monday details of leadership changes aimed at boosting technology and product exclusivity as the luxury sports car maker embraces electrification under new chief executive... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5553aafeed28ed6427da9f023ab6ddc9c57e8e225a33fe612412bf8954f7b8c"}
{"Ticker":"MSFT","Date":1641942840,"Headline":"Bill Gates Says Misinformation Related To Fauci, Himself Doesn't 'Make Sense,' Talks COVID-19 After Omicron","Source":"Benzinga","Summary":"Microsoft Corporation (NASDAQ: MSFT) co-founder Bill Gates answered questions related to COVID-19 on Twitter Tuesday.\nWhat Happened: The questions to Gates were routed through..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d97e4f79a59b87e131fc57bfa84e16b6bb9a85b3a951a599414d1bb74a60b302"}
{"Ticker":"MSFT","Date":1641936537,"Headline":"Market check: Nasdaq stocks stage comeback, Dow and S&P 500 close near all-time highs","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down a market chart comparing Nasdaq stock returns."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc781f9dc0d816a54852aa527687fb106d56cc0af2eba684a6ae26075650023f"}
{"Ticker":"MSFT","Date":1641932288,"Headline":"Amazon (AMZN) Boosts AWS Portfolio with New EC2 Instances","Source":"Yahoo","Summary":"Amazon's (AMZN) AWS announces the general availability of purpose-built Amazon EC2 instances, Hpc6a, which are designed for HPC workloads."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02ca621e7981391ef637e5661418b066caa2ea1544dc2fa607053d36fd71647b"}
{"Ticker":"MSFT","Date":1641929399,"Headline":"Market strategist: The issue with tech stocks is ‘simply one of valuation’","Source":"Yahoo","Summary":"Simeon Hyman, ProShares Global Investment Strategist, joins Yahoo Finance Live to discuss how the market and investors may be expected to react to Fed Chair Powell's confirmation hearing, inflation pressures, interest rates, the tech sector, and the market growth outlook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=157d122d4facee31f8fcf81e926af8bbac0341b48817889348ec80ae4e5a33e1"}
{"Ticker":"MSFT","Date":1641926287,"Headline":"Stolper Co Buys Apple Inc, Berkshire Hathaway Inc, JPMorgan Chase, Sells Ardagh Metal Packaging ...","Source":"Yahoo","Summary":"Investment company Stolper Co (Current Portfolio) buys Apple Inc, Berkshire Hathaway Inc, JPMorgan Chase, UnitedHealth Group Inc, Microsoft Corp, sells Ardagh Metal Packaging SA, Ardagh Metal Packaging SA, Blackrock Debt Strategies Fund Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Stolper Co."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bc0f4b09213e8e4fe4bbc22488fbee2909e1a2ef162bdf0b0afc261e4e452e5"}
{"Ticker":"MSFT","Date":1641923100,"Headline":"Morgan Stanley has an 'overweight' rating on these 3 stocks yielding up to 9.1% — nail them down in case inflation soars even higher","Source":"Yahoo","Summary":"The Wall Street giant really likes these dividend stocks — for very good reasons."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e2affb5326010e0ebec0657a2f533821420f9f202d0d98a1a091edcd787852ba"}
{"Ticker":"MSFT","Date":1641920121,"Headline":"Apple's Tim Cook made $98M in 2021 — how that compares to other tech CEOs","Source":"Yahoo","Summary":"Apple CEO Tim Cook made $98 million in 2021. Here's how that compares to other major tech CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=83476b2936ed1a93f5564b75ba25716a7699a7dfff77a5269b17b69a7bb2a643"}
{"Ticker":"MSFT","Date":1641918988,"Headline":"Two of Sen. Kyrsten Sinema's former aides have lobbied for corporate giants looking to influence Joe Biden's agenda","Source":"CNBC","Summary":"Two of Sen. Kyrsten Sinema's former aides have become key aides for corporate giants looking to impact President Joe Biden's agenda. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=111d6e9729960e1e46abdebcd8343a198181d97fb8199a6e39514c548ccced61"}
{"Ticker":"MSFT","Date":1641917165,"Headline":"Microsoft announces quarterly earnings release date","Source":"Finnhub","Summary":"REDMOND, Wash., Jan. 11, 2022 \/PRNewswire\/ -- Microsoft Corp. will publish fiscal year 2022 second-quarter financial results after the close of the market on Tuesday, Jan. 25, 2022, on the Microsoft... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7605c4c1c3ae8ad396cd3ead8625f22d77df1ad6ec7c85626da3e7ce4c99e484"}
{"Ticker":"MSFT","Date":1641913254,"Headline":"19 Giant Stock Winners Now Cost You $1 Trillion On The Way Down","Source":"Yahoo","Summary":"There's a quick way to summarize the S&P 500 this year so far: Easy come, easy go. And it's not just \"meme stocks\" getting hammered."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=81cf494e4c07cffcb3da1ca21af67eddf8bde36615b17734fcb9d22555d1ec90"}
{"Ticker":"MSFT","Date":1641912116,"Headline":"Dow Jones Slides Ahead Of Powell Testimony; Tesla China Sales Strong; Rivian Misses Production Target","Source":"Yahoo","Summary":"The Dow Jones Industrial Average fell 100 points Tuesday ahead of Fed chief Powell's hearing. Tesla stock dropped despite strong China sales."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2a51a41c2f6f29797b1e4bd33801b42d3d76f7ec90f105037a0276c5c2d69ebf"}
{"Ticker":"MSFT","Date":1641911883,"Headline":"Junson Asset Management (Hong Kong) Ltd Buys Smartsheet Inc, Meta Platforms Inc, Microsoft ...","Source":"Yahoo","Summary":"Investment company Junson Asset Management (Hong Kong) Ltd (Current Portfolio) buys Smartsheet Inc, Meta Platforms Inc, Microsoft Corp, Netflix Inc, Snowflake Inc, sells Airbnb Inc, Coupa Software Inc, RingCentral Inc, CrowdStrike Holdings Inc, Adobe Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Junson Asset Management (Hong Kong) Ltd."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17d2a8f01c0d143daed6e720a0e1bbbd9f86cad4ec56a4a3f7f095419656e5c2"}
{"Ticker":"MSFT","Date":1641911880,"Headline":"Apple’s Loss in Cloud Gaming Could Benefit Nvidia, Amazon, and Microsoft","Source":"Yahoo","Summary":"Microsoft and others expanding into cloud gaming may try to target iPhone users via the web, and not the App Store, according to GlobalData."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=086183b7c3e6d1bb5d8c7842e3f29bca77bd9dc140c75a3e3b3c968f505a1094"}
{"Ticker":"MSFT","Date":1641911569,"Headline":"Recalibrated Fed expectations have ‘shaken the confidence of markets’: Strategist","Source":"Yahoo","Summary":"Kate Moore, BlackRock head of thematic strategy for the global allocation team, joins Yahoo Finance Live’s Julie Hyman and Brian Sozzi to discuss the outlook for the 2022 stock market, prospects for growth, changes in the consumer, major investment themes, and digital transformation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=95439b536b182acf3e831de343bd0350e931e80500e5b7d5e2e49df12b329d93"}
{"Ticker":"MSFT","Date":1641911490,"Headline":"Prediction: These Will Be 3 of the Biggest Stocks by 2032","Source":"Yahoo","Summary":"The new year is a great time for a fresh start, but don't lose sight of the long-term potential of these technology stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1c61858a5eb7fa913abd288eafe0cb926f96be6fe72dd6ba9cfc9805c15b6a21"}
{"Ticker":"MSFT","Date":1641910382,"Headline":"Cadence (CDNS) Solution Boosts Efficiency of Rodelta Pumps","Source":"Yahoo","Summary":"Cadence (CDNS) maximizes the efficiency of Rodelta Pumps International on the back of its Omnis CFD solution."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=33936852dc6a55f6a569f2041cd4023e0dfeac11c1e0a0cfe76d957550e4e772"}
{"Ticker":"MSFT","Date":1641910022,"Headline":"Sonos (SONO) Gets a Favorable Ruling in the Patent Case","Source":"Yahoo","Summary":"Sonos (SONO) received a favorable ruling from a U.S. Trade Court against Google in a patent litigation, per a Reuters report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8cb94283c465022f9bdd1de6e64d088f77e6817b1ba801480da224110db4ea8c"}
{"Ticker":"MSFT","Date":1641908887,"Headline":"Microsoft : How a community in Southern Virginia is helping locals develop digital skills","Source":"Finnhub","Summary":"\"Most people don't think of 'South Boston, Virginia,' when it comes to technology, but it's there,\" says Darryl Kent. Kent is a native of South Boston,... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9df3e20d9dd69bd11aadeb0319889402bf63a80c25d0fc786a4aeaadc7f3f6eb"}
{"Ticker":"MSFT","Date":1641907560,"Headline":"4 Top Tech Stocks To Watch In January 2022","Source":"Nasdaq","Summary":"Are These Tech Stocks On Your Watchlist Right Now?Tech stocks have had a rough start to the year as treasury yields have spiked. The technology-heavy Nasdaq Composite has fallen around 4.5% since the start of the year. With many of the hyper-growth tech stocks plummeting, many ar"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=603287a67a6a2d50b70b903126db7f66839f483579917794f059436dedefaede"}
{"Ticker":"MSFT","Date":1641905820,"Headline":"Here's Why Dropbox Stock Rose 10% in 2021","Source":"Nasdaq","Summary":"What happened\nDropbox (NASDAQ: DBX) climbed by 10% in 2021 due to shifting valuation ratios and steady growth. After building some momentum on positive fundamental results early in the year, the stock became one of the victims of the fourth quarter's stay-at-home sell-off."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e782340f71d0a54c526bb6fba95a1325abce7651eef0bf95b7e96cb22ed114b"}
{"Ticker":"MSFT","Date":1641905778,"Headline":"Wall St bounces as tech stocks rise after Powell's testimony","Source":"Finnhub","Summary":"U.S. stock indexes reversed course onTuesday as technology stocks recovered, with investors takingcomfort in Federal Reserve Chair Jerome Powell's testimony toCongress not delivering any major... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fb5fbc23c45f3f6aebf8ea90b53413a834e50503492e9506d55f47c97352924d"}
{"Ticker":"MSFT","Date":1641905760,"Headline":"US STOCKS-Wall St bounces as tech stocks rise after Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock indexes reversed course on Tuesday as technology stocks recovered, with investors taking comfort in Federal Reserve Chair Jerome Powell's testimony to Congress not delivering any major surprises."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c8b3a5decaf5683ba65a677c1d00fb7722c1ff94e35f4b3537de2a4c2efddcc8"}
{"Ticker":"MSFT","Date":1641901800,"Headline":"Digital ad hogs leave room at the trough","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     Alphabet’s Google and Meta Platforms’ Facebook are the big hogs at the digital advertising trough. But smaller online players needn’t to starve as the pie is expanding rapidly. That’s an"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=720c2402413d2585c05a5b498e55abaec805d10366b693c194a26d8497372eef"}
{"Ticker":"MSFT","Date":1641900978,"Headline":"Triple Threat","Source":"SeekingAlpha","Summary":"Stocks, bonds, and gold have all stumbled out of the gates in 2022. Read more about three sectors that show signs of strength amid stock market weakness."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0e9030025eba0d9ee73fba827c22a7cba6f2d65e48ab01c4eaefbbe895d4016"}
{"Ticker":"MSFT","Date":1641900019,"Headline":"Is Asana Stock Overvalued Or Undervalued? Its Entry Point's Not Attractive Enough","Source":"SeekingAlpha","Summary":"Asana has been growing spectacularly fast over the last 2 years. But growth is expected to slow, moving forward. See if ASAN stock is overvalued or undervalued."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8d819854ce56962b89a77fec4033b192ad16b684c97237d1bb3c82dc5ff7e482"}
{"Ticker":"MSFT","Date":1641896740,"Headline":"How DigitalOcean Stock Could Grow 10x In 10 Years","Source":"SeekingAlpha","Summary":"DigitalOcean is a relatively small company with a huge opportunity in the fast growing SMB IaaS\/PaaS space. Learn more about DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c8a649792836873cf4452789b960902aeadbcb2c468ff9010d215a6c4542420"}
{"Ticker":"MSFT","Date":1641895691,"Headline":"Microsoft : Medical education goes holographic with mixed reality from Microsoft","Source":"Finnhub","Summary":"NUS Yong Loo Lin School of Medicine partners with Microsoft to use holographic technology to teach medical and nursing undergraduates Singapore, 11 January 2022 ... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1b3d12f353868d6b6185e15ef3b2f0bda6231e1c81f50e9933275fde4f641d87"}
{"Ticker":"MSFT","Date":1641894773,"Headline":"Wall Street down ahead of Powell testimony","Source":"Finnhub","Summary":"U.S. stock indexes fell on Tuesday aheadof Federal Reserve Chair Jerome Powell's testimony that mayoffer fresh insight on policy tightening and the central bank'splans to tackle inflation. ... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=86dfe237dcfbcf6de30fc0303835b93e6f5f423584129f10084c5b2cb1697baf"}
{"Ticker":"MSFT","Date":1641894720,"Headline":"US STOCKS-Wall Street down ahead of Powell testimony","Source":"Nasdaq","Summary":"U.S. stock indexes fell on Tuesday ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3852dafdf7e4fc27ce1f94b948ff9679cd09df66ac9618d12cd238b554dd03f0"}
{"Ticker":"MSFT","Date":1641893880,"Headline":"Paying Up Precedes Spectacular Repricing Cycles","Source":"SeekingAlpha","Summary":"The negative start to 2022 is a step in the mean reversion needed - but much more is yet to come. Click here to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=530b56a3b30a850794ddf95cfa01567bd80920bbc98150dd469db15c7063ccf3"}
{"Ticker":"MSFT","Date":1641892500,"Headline":"Dividend Growth 50: Seven Years, And Income Just Keeps Coming In","Source":"SeekingAlpha","Summary":"2021 was another great year for the DG50, with the income stream growing more than 7%. Big income gainers included Aflac, Deere and Target. Read more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c9438e07b6734ef38c641855d4b9eb934264dd66d769b9e384ccd104444c8f88"}
{"Ticker":"MSFT","Date":1641891540,"Headline":"US STOCKS-Wall Street set to open higher ahead of Powell testimony","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Tuesday as investors picked up beaten-down stocks ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=661b5672aaec12bc7439b855c925a0ca07786aca2d4395a40e6f61014b337c38"}
{"Ticker":"MSFT","Date":1641889800,"Headline":"Why Microsoft Surged by 51.2% in 2021","Source":"Nasdaq","Summary":"What happened\nShares of Microsoft (NASDAQ: MSFT) surged by 51.2% in 2021, according to data provided by S&P Global Market Intelligence."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d97940a2dd05e24943fb47e140229dc05f9a741b2a3b89ac9e2d3fb41776d139"}
{"Ticker":"MSFT","Date":1641885540,"Headline":"US STOCKS-Futures rise ahead of Fed Chair Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Tuesday as investors picked up beaten-down stocks ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d920ab73002864d9e1a50d729fa83281ea23cee41cfd2079072477bc2a7eaf5d"}
{"Ticker":"MSFT","Date":1641884401,"Headline":"Twitter buys minority stake in digital advertising startup Aleph","Source":"Finnhub","Summary":"Twitter Inc has picked up aminority stake in Aleph Group Inc, the digital advertisingstartup said on Tuesday as it seeks to go public in the UnitedStates. Aleph did not reveal any... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e435c53d40eaefca25683bc4a0b86acec82c50cc82abd205cb77e73fa595404"}
{"Ticker":"MSFT","Date":1641884400,"Headline":"3 Unstoppable Stocks With More Potential Than Any Cryptocurrency","Source":"Nasdaq","Summary":"Many technology stocks have been hammered at the beginning of 2022, but the business is performing stronger than ever. Cryptocurrencies have also had a rough past few months, with Bitcoin (CRYPTO: BTC) falling more than 35% from its all-time high. With bargains popping up left an"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dd8ad298a587ff0bf75964eeb4fe55418e81ec466cc8bcf49960f0ce7b5f249"}
{"Ticker":"MSFT","Date":1641883843,"Headline":"DGRW: First-Class Dividend Quality","Source":"SeekingAlpha","Summary":"WisdomTree U.S. Dividend Growth ETF (DGRW) follows a strategy based on dividends, earnings growth and profitability. Read more about DGRW ETF here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4b3069a20118e4856c8d6cc8f5ed28f7dc46272902596c6c37c9b62e2274911"}
{"Ticker":"MSFT","Date":1641882366,"Headline":"Ombori Grid available on Microsoft Azure Marketplace","Source":"Finnhub","Summary":"OmboriGrid AB has released the Ombori Grid in the Microsoft Azure Marketplace, an online store providing applications and services for use on Azure, according to a company press release.The Microsoft... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4dec64c3e3466e19d34330b4f5fb14c7ca1b5955bfdb5f98ff43afb5af398634"}
{"Ticker":"MSFT","Date":1641881700,"Headline":"Will Investors See a Tech Sector Market Top in 2022?","Source":"Nasdaq","Summary":"The tech sector is extremely broad. It is filled with trillion-dollar behemoths like Microsoft (NASDAQ: MSFT), legacy providers like IBM (NYSE: IBM), and fast-growing upstarts like Crowdstrike (NASDAQ: CRWD). It spans hardware, software, cybersecurity, financial technology, and m"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aadf7928707d36b2da8a985b1e48a1022a2a724fa7844604ab2b066147c246a2"}
{"Ticker":"MSFT","Date":1641881460,"Headline":"Cathie Wood Goes Bargain-Hunting: 3 Beaten-Down Growth Stocks She Just Bought","Source":"Nasdaq","Summary":"There's no nice way to dress it up: 2021 was a lousy year for Ark Invest. Disruptive tech stocks held by its exchange-traded funds (ETFs) soared at the beginning of the pandemic only to fall out of the sky last year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9a8fd909544701e9ba9428987b29ffbf851b5fd4b9aabdfc58a7fcced1e67b41"}
{"Ticker":"MSFT","Date":1641867817,"Headline":"Dow Jones Futures Rise: Stock Market Rally Finds Support Ahead Of Powell Hearing; Tesla Reverses Higher","Source":"Yahoo","Summary":"Dow Jones futures were in focus Monday. The stock market rally found support ahead of Fed chief Jerome Powell's confirmation hearing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f0af0f6e12010f7bc0baf8f5c2f663102b56d26f333ee2ebbc9363c27f9351e5"}
{"Ticker":"MSFT","Date":1642027800,"Headline":"Apple Continues To Bleed Talent As Microsoft Snags Up Key Chip Architect","Source":"Benzinga","Summary":"Apple Inc (NASDAQ: AAPL) continues to bleed semiconductor talent to its rivals, with Mike Filippo, a key chip architect, jumping ship to Microsoft Corporation (NASDAQ: MSFT..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5c826b3f57cf289cb0f21a593b82e44da3e5ee70f828395685bc545eb1fd005"}
{"Ticker":"MSFT","Date":1642019850,"Headline":"Microsoft hires key Apple engineer to design server chips - Bloomberg News","Source":"Reuters","Summary":"Microsoft Corp hired a key Apple Inc engineer to design its own chips for its servers, Bloomberg News reported on Wednesday, citing people with knowledge of the matter."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=021a1be69f7e5b840d92d9021474201a2e616ac721a5fad80510c10c0e8e0d23"}
{"Ticker":"MSFT","Date":1642014840,"Headline":"These Stocks Would Make Great Gifts","Source":"Nasdaq","Summary":"Whether for the holidays, a birthday, or another special occasion, stocks are increasingly being seen by investors of all ages as great and thoughtful gifts. In this segment of Backstage Pass, recorded on Dec. 17, Fool contributors Rachel Warren, Jason Hall, and Toby Bordelon dis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=198840ae0c5aac66f574a6cdd05dd6b931456962defdb5e10cb83498c4d28493"}
{"Ticker":"MSFT","Date":1642010280,"Headline":"Walkie Talkie Feature Made Available On Microsoft Teams","Source":"Nasdaq","Summary":"(RTTNews) - Microsoft Inc. (MSFT) is making the Walkie Talkie feature of Microsoft Teams available to all users of its communications app on Wednesday. Walkie Talkie lets Microsoft Teams users turn smartphones or tablets into a walkie-talkie that works over cellular data or Wi-FI"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9ef92505eb39ab0a07ba42629046bec6edd00fb561cbdfd5cb0e97f610a322a0"}
{"Ticker":"MSFT","Date":1642008840,"Headline":"2 Growth Stocks I'm Buying Instead of Bitcoin in 2022","Source":"Nasdaq","Summary":"Digital currencies have great potential in a world that is increasingly going digital. This part of the economy is booming, so it's no surprise to see demand for these currencies continue to grow."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ed8d109de3087b9bd3efe292c69bfd21fc4ebcb488a97c4108aece4eaf14f36"}
{"Ticker":"MSFT","Date":1642006800,"Headline":"2 “B-Rated” Cryptos to Sell… and 2 Rising Stars to Buy","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=59eadd8a490682d00121752c606d96d62bab4573e5fe228238f930c98a329a51"}
{"Ticker":"MSFT","Date":1642006440,"Headline":"US STOCKS-Wall Street closes higher as inflation data supports Fed bets","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after data showed that while U.S. inflation was at its highest in decades, it largely met economists' expectations, cooling some fears that the Federal Reserve would have to pull back support even more forcibly than already expected."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=33cb30cb6f6514ce6628dbdc37019e3126f7954e55451d67f33db97b06da9579"}
{"Ticker":"MSFT","Date":1642002720,"Headline":"Alphabet (GOOGL) Boosts Workspace Efforts with New Updates","Source":"Nasdaq","Summary":"Alphabet’s GOOGL division Google has introduced three updates related to Gmail, Google Meet and Google Sheets to its iPhone and iPad productivity apps.The company has rolled out an email update widget on iOS for homecreen. Notably, it will be available in the next few wee"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be7578a9aeeffd6f8d1eedac8e105a2048d4872b7d0b57c72d1098cb6b9972ba"}
{"Ticker":"MSFT","Date":1642000560,"Headline":"The 10 Best Closed-End Funds (CEFs) for 2022","Source":"Nasdaq","Summary":"If someone offered to sell you a dollar for 90 cents … well, you'd probably think it was too good to be true. Yet these are exactly the kinds of opportunities that arise in the market's best closed-end funds (CEFs)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be0058210f2b869827bfc940ac739e6712e9a89c183bd688dfbb26f96a6a010a"}
{"Ticker":"MSFT","Date":1641994140,"Headline":"SentinelOne (S) Unveils New Integration for ServiceNow","Source":"Nasdaq","Summary":"SentinelOne S announced the integration of the SentinelOne App directly into the ServiceNow’s NOW Security Incident Response (SIR) offering.The integration of the app into ServiceNow unites security and IT teams to provide a more efficient, coordinated and comprehensive i"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e7733452f39810623893fa00969867fccfe0071a30a4263a118a706ea1ee4896"}
{"Ticker":"MSFT","Date":1641991200,"Headline":"Will Zoom Stock Keep Falling in 2022?","Source":"Yahoo","Summary":"Zoom Video Communications has gone from COVID-19 darling to a zero that investors are selling, perhaps unfairly."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b06d63de4cdf73b6b9dc658b94817ee161878f03ad78b89d7d614f88ca4eafb2"}
{"Ticker":"MSFT","Date":1641991020,"Headline":"US STOCKS-Wall St inches up after in-line inflation data eases investor fears","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with megacap technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=744ab1c4ba5e3f04d8360a8f26260ee86c1e11ab5ec99f328d2c421502b59cb5"}
{"Ticker":"MSFT","Date":1641990000,"Headline":"Apple's (AAPL) Interests Lies in AR Than in the Metaverse","Source":"Nasdaq","Summary":"Apple’s AAPL augmented-reality (“AR”) ambitions are well-known. In fact, CEO Tim Cook is known to be a fan of AR technology. The iPhone-maker’s rumored headset is the most anticipated product in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3850c084579560562cd09b01f37670d705925bb96508bcfc4b7607b957a2ddd4"}
{"Ticker":"MSFT","Date":1641986177,"Headline":"Microsoft : For the last two years, the world's two billion frontline workers have been critical to keeping our society and economy functioning in the face of historic constraints.","Source":"Finnhub","Summary":"The Windows 11 devices being introduced by our partners at #CES2022 this week are delivering new innovations in security, sustainability, and more. ... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e4ac269c4be66567ffd30b6a3237bd7dbd9df5c6a7cdee5cfd73cca10987c5b6"}
{"Ticker":"MSFT","Date":1641985260,"Headline":"SONY to Reportedly Continue the Production of PS4 in 2022","Source":"Nasdaq","Summary":"Sony Group Corporation SONY is planning to continue the production of its last-generation console, PlayStation 4 (PS4), throughout 2022, according to a report from Bloomberg. Previously, Sony had plans to shelve PS4 production by 2021 but the company never had disclosed t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5d8989c99cabad4b3f271c87725f73a79b9e2e0068f3bc5e64b60ccfd3a8120c"}
{"Ticker":"MSFT","Date":1641984600,"Headline":"U.K. Begins Review of Microsoft’s Planned Purchase of Nuance","Source":"Yahoo","Summary":"The U.K.’s Competition and Markets Authority has formally begun a review of  Microsoft  ‘s planned acquisition of  Nuance Communications  the voice technology company.  The European Commission unconditionally approved the deal in late December.  Microsoft (ticker: MSFT) offered to buy Nuance (NUAN), the transcription-technology company, for $56 a share about nine months ago."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c5af1e4713ec7f125f7230bc099c2a8d203ef97ea741c1367a2700f7c32ef919"}
{"Ticker":"MSFT","Date":1641984420,"Headline":"EXCLUSIVE: Unusual Whales Creates 'Nancy Pelosi ETF' So You Can Track Her Trades","Source":"Benzinga","Summary":"Members of U.S. Congress are permitted to buy and sell stocks and options in public companies as long as they publicly disclose their trades. The rule has come under scrutiny..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0d4b2e7c9be28b7c1039ff064f903e7f51ebf796fc3314f73bcc06048ded81e"}
{"Ticker":"MSFT","Date":1641984360,"Headline":"Cognizant (CTSH) & Uptake Collaborate to Create Uptake Fusion","Source":"Nasdaq","Summary":"Cognizant Technology Solutions CTSH recently announced that it has collaborated with Uptake to enable unified data management in a cost-effective manner for the energy and utilities industries.Cognizant and Uptake, together created Uptake Fusion, which helps to transfer o"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e663fa8fe07b8ad2fcc689310fd6d93586c36dadff638831c871b8f094013b73"}
{"Ticker":"MSFT","Date":1641983640,"Headline":"Dow Movers: JNJ, NKE","Source":"Nasdaq","Summary":"In early trading on Wednesday, shares of Nike topped the list of the day's best performing Dow Jones Industrial Average components, trading up 1.6%.  Year to date, Nike has lost about 8.4% of its value."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=860135b83de2b433ddb4489af2106427ae60118149b227bfd53449307f19b176"}
{"Ticker":"MSFT","Date":1641983400,"Headline":"How Meta Platforms Is Targeting These 2 Tech Giants","Source":"Nasdaq","Summary":"Today's video focuses on three tech giants, Meta Platforms (NASDAQ: FB), formerly known as Facebook, Microsoft (NASDAQ: MSFT), and Apple (NASDAQ: AAPL). I discuss a recent report about engineering talent switching companies as well as fundamentals and recent price action for each"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=19296531554a39f0ab543ab76935d553fc21d6834ca6299dc7f8bc1c56b7e738"}
{"Ticker":"MSFT","Date":1641983060,"Headline":"7 Best Metaverse Stocks For 2022 - Our Top Pick, Microsoft, Is Much More","Source":"SeekingAlpha","Summary":"The metaverse is a hot topic on Wall Street. The performance of stocks with metaverse exposure varied widely in 2021. See the top 7 best metaverse stocks here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2cb798de4aa0c93cf15e20eab1f69a5b34809544a5052b3583e78c5783f4524a"}
{"Ticker":"MSFT","Date":1641982440,"Headline":"Wall St rises as in-line inflation data calms nerves","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with big technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d84f0cad02ab8738f6ff4f8c26ddd8c1eb2d45dde9bf40ff37a82dd380bf4cf"}
{"Ticker":"MSFT","Date":1641980820,"Headline":"Who Led the Patent Race in 2021?","Source":"Nasdaq","Summary":"Here’s an overview of the patent landscape in 2021 with rankings based on the data by IFI Claims Patent Service."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e66d6ad3ca7d3bfda9e80f7d533e656639b1c78101ca5b0acf9207f69a24bc6c"}
{"Ticker":"MSFT","Date":1641979140,"Headline":"US STOCKS-Futures extend gains as inflation data meets estimates","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Wednesday after largely in-line consumer prices data eased some concerns about faster-than-expected interest rate hikes, with big technology stocks leading the gains after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c30b87e09669cb0c94b6fa55bb069e6e4159584e83ebf5401af6b0c855047d37"}
{"Ticker":"MSFT","Date":1641978840,"Headline":"Sensata (ST) Boosts System Performance With Smart Contactors","Source":"Nasdaq","Summary":"Sensata Technologies Holding plc ST recently unveiled avant-garde solutions for enhanced system performance and diagnostics. Dubbed GXC and MXC series of Smart-Tactor contactors, the offerings are equipped with CAN bus communication and have been specifically designed to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f245ecbe6942395486b43e653b68aa883f25e73a1583937b54ef3d1a2617161a"}
{"Ticker":"MSFT","Date":1641978130,"Headline":"Microsoft announces new research and technology to empower millions of frontline workers","Source":"Finnhub","Summary":"REDMOND, Wash., Jan. 12, 2022 \/PRNewswire\/ -- On Wednesday, Microsoft Corp. released a Work Trend Index Special Report, Technology Can Help Unlock a New Future for Frontline Workers, and announced... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e17d5c76f3d16b319423cb8098a4efac21858d57714afb9e2d0014813ad6b612"}
{"Ticker":"MSFT","Date":1641978000,"Headline":"CDW is a Solid Bet for Investors: Here are the Reasons Why","Source":"Nasdaq","Summary":"Shares of CDW Corporation CDW have soared 48.6% compared with the industry’s growth of 0.9% in the past year. The company is gaining from an improved operating margin, lower interest expenses and a reduction in the effective tax rate. It is witnessing strong demand for pr"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5c7515932815f456fb8f05ac867adfdf1f5b4f2cf4f6c06944e2528d1484f5be"}
{"Ticker":"MSFT","Date":1641978000,"Headline":"Robinhood to permanently shift most employees to remote working","Source":"Nasdaq","Summary":"Online trading platform Robinhood Markets Inc said on Wednesday it plans to move a majority of its 3,400 employees to remote work permanently, joining a slew of top tech firms embracing a hybrid culture."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d26c48f35182859dd19c7e42d13126e72e124272cc1a1639bfeab005e7d4c61"}
{"Ticker":"MSFT","Date":1641971880,"Headline":"US STOCKS-Futures edge higher ahead of key U.S. inflation data","Source":"Nasdaq","Summary":"U.S. stock index futures edged higher on Wednesday, with investors bracing for consumer prices data that is expected to show an almost four-decade high in December, while big technology stocks bounced after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88f02d641a81ffe2d34d9c63948bbb5966398d19b9244ad7c28fc0ed7235288e"}
{"Ticker":"MSFT","Date":1641968700,"Headline":"Was $3 Trillion the Top on Apple Stock?","Source":"Nasdaq","Summary":"Big numbers can be hard to wrap your mind around, especially when they appear as digits on a screen. Consumer electronics titan Apple (NASDAQ: AAPL) recently hit $3 trillion in market cap, an astonishing feat for the iPhone maker."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ac0afd8874d54e3f42f22e43c9db11b06bacc6dbb48a639e8c29ca3ea2b5b1f0"}
{"Ticker":"MSFT","Date":1641966720,"Headline":"2 Cryptocurrencies That Have Trounced Bitcoin and Shiba Inu During the Crypto Crash","Source":"Nasdaq","Summary":"Bitcoin (CRYPTO: BTC), the biggest cryptocurrency on the market, has bitten the dust so far in the new year. So has the best-performing digital token in 2021, Shiba Inu (CRYPTO: SHIB)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9d210cb8f9f2a0eb91ea65d6b4aff394149a6929b3f0fc7bcf6f5bf27f67f228"}
{"Ticker":"MSFT","Date":1641958920,"Headline":"Probe Into Microsoft Acquisition of Nuance Communications Launched by UK Antitrust Watchdog","Source":"Finnhub","Summary":"By Ian Walker The U.K. Competition and Markets Authority said Wednesday that it has started a formal investigation into Microsoft Corp.'s planned acquisition of Nuance Communications Inc.... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=acc25d488f33c7847f2296c000cc25198f316d52341c110f307181f01a5ec8cf"}
{"Ticker":"MSFT","Date":1641955082,"Headline":"RVW Wealth, LLC Buys iShares ESG Screened S&P Mid-Cap ETF, iShares iBonds Dec 2026 Term ...","Source":"Yahoo","Summary":"Investment company RVW Wealth, LLC (Current Portfolio) buys iShares ESG Screened S&P Mid-Cap ETF, iShares iBonds Dec 2026 Term Corporate ETF, Dimensional International Core Equity Market ETF, Avantis Emerging Markets Equity ETF, Invesco BulletShares 2026 Corporate Bond ETF, sells iShares iBonds Dec 2021 Term Corporate ETF, Xtrackers Russell US Multifactor ETF, JPMorgan Ultra-Short Income ETF, SPDR Portfolio Emerging Markets ETF, Invesco BulletShares 2021 Corporate Bond ETF during the 3-months en"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=603315ecef148cf79d5bab5e02d472f63d6ef8ec657a3a7bc6b5d8bb85b17dfd"}
{"Ticker":"MSFT","Date":1641951960,"Headline":"France's OVHcloud picks up speed in Q1, on track for 2022 targets","Source":"Nasdaq","Summary":"French cloud computing company OVHcloud reported on Wednesday a rise of 13.9% in its first-quarter revenue, and said it was on track to achieve its full-year objectives."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0b8f9e42cecf5d8c1e05f10fa15c812956cd99774ddde6362813d43557defe2"}
{"Ticker":"MSFT","Date":1641950460,"Headline":"Report: Microsoft is losing members of its augmented reality team to Meta","Source":"Yahoo","Summary":"Former Microsoft employees who worked on the HoloLens team are reportedly leaving in sizable numbers. Many are landing at another tech giant with a big Puget Sound-area presence."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=821c284a6ecad2b2bdf7a128767da47123621b8e3441877a93f203523850a04b"}
{"Ticker":"MSFT","Date":1641949898,"Headline":"Microsoft: Possibly A Bearish Sign - Part 2","Source":"SeekingAlpha","Summary":"In this part 2 to my article published in Nov 2020, I delve into more detail on Microsoft (MSFT) stock in the context of specific indicators. Read more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d426ff0ac23fc8d8695872d9e309eb05fb1f3993a1af5fbdef8ee007885283f8"}
{"Ticker":"MSFT","Date":1641949200,"Headline":"Time to buy: Retail investors swoop in when stocks falter","Source":"Nasdaq","Summary":"U.S. retail investors have been dip-buyers so far in 2022, snapping up equities that funds have shed from their portfolios in light of a more hawkish Federal Reserve, but with a focus on quality stocks as opposed to speculative names."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c93c3b628b981c21d068c8afe14740158311cafa083bc1b894aa449b31155ad3"}
{"Ticker":"MSFT","Date":1642117402,"Headline":"Beverly Hills mansion of Microsoft co-founder Paul Allen sells for $45 million","Source":"Yahoo","Summary":"In Beverly Hills Post Office, a lavish compound owned by late Microsoft Corp. co-founder Paul Allen has sold for $45 million."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2af5723faae69d8ba698bf6888e610e6934a31d0bf1b8ef6b62a4e4059e8023"}
{"Ticker":"MSFT","Date":1642117056,"Headline":"Microsoft board to review sexual harassment, discrimination policies","Source":"Reuters","Summary":"Microsoft Corp will review the effectiveness of its sexual harassment and gender discrimination policies and practices in response to a shareholder proposal that passed at its latest annual meeting, the company's board said on Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c066b5b7ae3fc6183fd142c99e0f4afd48992c0e1a40b071bce3a5c002f6d07a"}
{"Ticker":"MSFT","Date":1642116199,"Headline":"Stocks Slide Following Jobs and Inflation Data","Source":"Yahoo","Summary":"Daily financial news summary: stock market falls after increases in jobless claims and inflation are reported."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8672ac2ba2d79ad8169ce455d39301934d5e45757beaa6920e19b4141debabca"}
{"Ticker":"MSFT","Date":1642115760,"Headline":"Microsoft Board to Review Company’s Sexual Harassment and Gender Discrimination Policies","Source":"Yahoo","Summary":"A report will summarize the results of investigations, including those into allegations against Bill Gates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b7f65b931c390e67cd5fbc11e7be25d5010ce6a77870cb496e1410827d05fbc"}
{"Ticker":"MSFT","Date":1642115669,"Headline":"Microsoft to Review Board's Gates Inquiry, Harassment Policies","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp., responding to a push from shareholders, has hired a law firm to review its sexual harassment and gender discrimination policies and scrutinize a 2019 board investigation of co-founder Bill Gates.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingShould I Be Wearing a"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a75bdbff69abb6ca38ccb1d43968694761d312a93ad8d4ad94237d398e1ef129"}
{"Ticker":"MSFT","Date":1642114836,"Headline":"UPDATE 1-Microsoft board to review sexual harassment, discrimination policies","Source":"Yahoo","Summary":"Microsoft Corp will review the effectiveness of its sexual harassment and gender discrimination policies and practices in response to a shareholder proposal that passed at its latest annual meeting, the company's board said on Thursday.  The review will produce a transparency report with results of any sexual harassment investigations in recent years against the company's directors and senior executives, including allegations that a board committee probe beginning in 2019 involved Bill Gates, the board said.  Data on the number of cases investigated and their resolution is also expected to be part of the review along with steps that have been taken to hold employees, including executives, accountable for sexual harassment or gender discrimination."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ca0464f31b8dd33c9ab6f973bf257e47294a83da5dfdc722a1dfa0bae3792c76"}
{"Ticker":"MSFT","Date":1642113501,"Headline":"Family Capital Trust Co Buys Microsoft Corp, iShares 1-3 Year Credit Bond ETF, iShares 1-3 Year ...","Source":"Yahoo","Summary":"Peabody, MA, based Investment company Family Capital Trust Co (Current Portfolio) buys Microsoft Corp, iShares 1-3 Year Credit Bond ETF, iShares 1-3 Year Treasury Bond ETF, iShares Core MSCI Emerging Markets ETF, sells Procter & Gamble Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Family Capital Trust Co."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=959420c60d0228a031f95c365c1e9f71d11d0544b82d6186ac369f98e4543a8a"}
{"Ticker":"MSFT","Date":1642110298,"Headline":"Amazon is 'hunting three big whales in its retail business': analyst","Source":"Yahoo","Summary":"Evercore ISI analyst Mark Mahaney says Amazon has three huge opportunities to send revenue growth skyward."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa85d4d2c91051e027f80d2025db832bd455b9d7395df99ccf1a0591f5c6f6fb"}
{"Ticker":"MSFT","Date":1642108841,"Headline":"Dow Jones Falls; Ford Stock Passes Milestone, Tesla Gets Hammered; Nvidia Dives Despite This","Source":"Yahoo","Summary":"The Dow Jones reversed lower. Ford stock passed a milestone while Tesla stock plunged. Nvidia stock took a dive."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e5c1490967a48524431326b00364ef6163c293fb202a38cc37370d75535fd83"}
{"Ticker":"MSFT","Date":1642107987,"Headline":"Gamestop and AMC up to 2022 'greatest win in retail trading history': 40 Finance host","Source":"Yahoo","Summary":"Geoff Beers, host of the 40 Finance YouTube channel, joins Yahoo Finance to discuss the rise of meme stocks like GameStop and AMC over the past year, retail investing trends, energy stocks, earnings season, and the outlook for the stock market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2aae93492dd1568bb2eb77aa68aab3ce021b9be60109299c0db024c175e6e71"}
{"Ticker":"MSFT","Date":1642106040,"Headline":"Why Amazon Stock Traded Lower on Thursday","Source":"Yahoo","Summary":"It wasn't just the down market that dragged the cloud computing giant lower. It may be losing share to a competitor."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9c49c39907612845fbd43989921c84eb2745d9e87040414b547a95bd0705e587"}
{"Ticker":"MSFT","Date":1642106040,"Headline":"Why Microsoft could be ‘extremely well-positioned’ for metaverse success","Source":"Yahoo","Summary":"As companies seek to build out the metaverse, Microsoft Corp. may already have many of the necessary tools in its pocket."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0a3dfaaec0a1bbdcf9d5274b44d937cfbd90cb0f00a6ec75d41ed91eb65aba4"}
{"Ticker":"MSFT","Date":1642105560,"Headline":"Bill Gates Fallout: Microsoft to Review its Sexual Harassment Policies","Source":"Yahoo","Summary":"The review will include allegations that a board committee investigated beginning in 2019 involving Bill Gates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8123dd873da5b11ffc9baf08ac28342e19988be351aa8408984050ba587e326c"}
{"Ticker":"MSFT","Date":1642105133,"Headline":"Market check: Nasdaq poised to end three-day streak, tech and health care lag","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down the stock market latest and the sell-off in tech."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e72a88298405fb9115ac2c5731012499107fb979c5450644eb2a5baeec2658e"}
{"Ticker":"MSFT","Date":1642101300,"Headline":"3 Stocks That Underperformed in 2021","Source":"Nasdaq","Summary":"Despite a robust year for the stock market in 2021, it's fair to say that many top stocks across all sectors have had their fair share of rough days amid the increased volatility of recent months."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d4a5ebd192438ff033281fe8e46c716017a86da722c659e5c99aa98422e6a967"}
{"Ticker":"MSFT","Date":1642100462,"Headline":"Microsoft, Salesforce and Apple cutting about 116 points off the Dow's price","Source":"Yahoo","Summary":"The Dow Jones Industrial Average is rising 47 points, or 0.1%, to buck the selloff in the broader market, but it be up a lot more if it wasn't for the blue-chip barometer's biggest technology components. The biggest drag on the Dow is Microsoft Corp.'s stock , which is down $8.64, or 2.7%, followed by fellow software giant Salesforce.com Inc. shares , which shed $7.22, or 3.0%. Throw in the $1.75, or 1.0%, drop in Apple Inc.'s stock , and those components were shaving a combined 116 points off t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f78bf75fb3df4f5a3fa34b524103cfe5feba09e369792088cae74de81c16fdc8"}
{"Ticker":"MSFT","Date":1642096074,"Headline":"3 mega-cap tech stocks that will gain big as interest rates rise: analyst","Source":"Yahoo","Summary":"Shopping for some tech bargains ahead of the Federal Reserve's rate hikes? Try these on for size, says one veteran tech analyst."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=569765feba01b1a8d5da367ab5155adf45eef5ced093958a61b080de449f33cb"}
{"Ticker":"MSFT","Date":1642095905,"Headline":"3 Reasons Why Growth Investors Shouldn't Overlook Microsoft (MSFT)","Source":"Yahoo","Summary":"Microsoft (MSFT) could produce exceptional returns because of its solid growth attributes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b41aadbef32e4de4ae4ea40ce41755f348512fa5772948b7754f22bd8964900"}
{"Ticker":"MSFT","Date":1642095720,"Headline":"Microsoft, Adobe Will Benefit from Metaverse, Bernstein Says","Source":"Yahoo","Summary":"Microsoft already has 'almost all of the major capabilities required to deliver a metaverse platform,' the firm said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5ca02b5ed20689e7bd024cce0f03ba473b516ebefba544b9493bf21a1f2f8cd0"}
{"Ticker":"MSFT","Date":1642093581,"Headline":"10 Energy Dividend Stocks to Buy According to Billionaire Jim Simons’ Portfolio","Source":"Yahoo","Summary":"In this article, we discuss 10 energy dividend stocks to buy according to billionaire Jim Simons’ portfolio. If you want to skip our detailed analysis of these stocks, go directly to 5 Energy Dividend Stocks to Buy According to Billionaire Jim Simons’ Portfolio. Jim Simons, an American billionaire hedge fund manager, founded Renaissance Technologies in […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1e74183fd43e900c17b33ea51801923be9b4959f528b8af73cfdd6a878d6dfc"}
{"Ticker":"MSFT","Date":1642093579,"Headline":"Microsoft stops making Xbox One consoles","Source":"Reuters","Summary":"Microsoft Corp said on Thursday it has stopped manufacturing all Xbox One consoles to focus on producing its next-generation consoles."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0a2d011bfb7e92b19e5a13041ae2c1218106f8ae39deba2ba85384cfe6465eb5"}
{"Ticker":"MSFT","Date":1642092011,"Headline":"Supreme Court vaccine mandate ruling won't bar companies from demanding Covid shots for workers — Biden vows to advocate for that","Source":"CNBC","Summary":"President Biden urged companies to voluntarily impose Covid vaccination rules on workers after the Supreme Court blocked a government order to do that."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02855b44c057214e24defd3ad2d6a77304657e1178951553d53f39e861729cea"}
{"Ticker":"MSFT","Date":1642092000,"Headline":"Stock Market Today: Stocks Resume Slide on Busy News Day","Source":"Nasdaq","Summary":"Choppy trading continued on Wall Street as investors balanced good news, bad news headlines."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=15112f0aea5aab647bb3956443fc01d8f9e9b4a517358c5605f04745b5c2e289"}
{"Ticker":"MSFT","Date":1642091340,"Headline":"After Hours Most Active for Jan 13, 2022 :  AAPL, GGB, ATVI, PFE, QQQ, AMH, INFY, MSFT, KBWB, F, KO, BZ","Source":"Nasdaq","Summary":"The NASDAQ 100 After Hours Indicator is up 7.8 to 15,503.42.  The total After hours volume is currently 60,282,346 shares traded.The following are the most active stocks for the after hours session: Apple Inc. (AAPL) is -0.03 at $172.16, with 3,107,559 shares traded. As reported"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de6bf71b93e41ec3e4feba8579caf1f55f8305324e21ce7c805f52ace738ae30"}
{"Ticker":"MSFT","Date":1642090291,"Headline":"Microsoft : Board Initiates Review of Sexual Harassment and Gender Discrimination Policies","Source":"Finnhub","Summary":"Microsoft Board Initiates Review of Sexual Harassment and Gender Discrimination Policies The Microsoft Board of Directors announced today that it will review the effectiveness... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d4f601980256f7c1f36433a99f2dc04d1ff17e983d16d8edc020372cc220440"}
{"Ticker":"MSFT","Date":1642089600,"Headline":"Leaders across healthcare, academia and technology form new coalition to transform healthcare journey through responsible AI adoption","Source":"Yahoo","Summary":"On Thursday, leading public, private, educational and research organizations across the U.S. healthcare and life sciences industries announced the formation of the Artificial Intelligence Industry Innovation Coalition (AI3C). The coalition brings together the Brookings Institution, Cleveland Clinic, Duke Health, Intermountain Healthcare, Microsoft, Novant Health, Plug and Play, Providence, UC San Diego, and University of Virginia with the goal of maximizing technology to provide recommendations,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e91efc96402ede729030fd85c32f8fc4f3f0b146003c06b49800b901529a0390"}
{"Ticker":"MSFT","Date":1642088932,"Headline":"Microsoft hires Apple chip veteran, cannabis compounds may prevent COVID infection, TPG prices IPO","Source":"Yahoo","Summary":"Yahoo Finance's Julie Hyman breaks down the leading headlines on Microsoft chip development, a new cannabis study tied to COVID-19, and private equity firm TPG."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b34c285a80deb019a355d6a6ceadc890099642fd883a5903ddbb623d5f90bfa"}
{"Ticker":"MSFT","Date":1642088280,"Headline":"Investment Opportunity Breakdown: Video Game Stocks","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b65b634dc5eedc8f15bd9afe24e3855c07abc0411658fa5be4d2b776581414a6"}
{"Ticker":"MSFT","Date":1642087026,"Headline":"Apple loses another chip talent this month — this time to Microsoft","Source":"Yahoo","Summary":"Microsoft's latest hire — taken directly from Apple — is seen as part of a push to build its own chips for its Azure servers amid a global processor shortage."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2bd0e415f591feaa571b439b6ab300c67f291421e690e87cc7d1a43661bf802"}
{"Ticker":"MSFT","Date":1642085612,"Headline":"Dow Jones Rallies On Inflation Data; Apple Chipmaker Breaks Out On Earnings","Source":"Yahoo","Summary":"The Dow Jones Industrial Average rallied 125 points Thursday on inflation data. Apple chipmaker Taiwan Semi is breaking out today."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b55f9cc369a943c56fc845587c8dfb5c183201ad736d5d26265e3e29a2f27477"}
{"Ticker":"MSFT","Date":1642085476,"Headline":"Dell, HPE Lead Rally in Cheap Stocks as Rates Surge","Source":"Yahoo","Summary":"(Bloomberg) -- The rout in high-valuation stocks is adding renewed fuel to the rally in older technology companies that boast higher profits and often trade at a discount to the broader market.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Starts to Consider Treating Covid Like the FluJ&J Vaccine Gets Additional Warning on Bleeding Side"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=875d8463ce6bc1d39a308478fa8a153648b36d55a990d123abc6b2aeb4383ad9"}
{"Ticker":"MSFT","Date":1642084922,"Headline":"Itron's (ITRI) Temetra to be Used by Ireland's ESB Networks","Source":"Yahoo","Summary":"Itron's (ITRI) Temetra is set to aid ESB Networks to boost meter data management and streamline operations"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=47e461903a2f27a39d1d48793acf238d8b9410cb506811b0b6604c53e3421982"}
{"Ticker":"MSFT","Date":1642084382,"Headline":"Stock Market News for Jan 13, 2022","Source":"Yahoo","Summary":"U.S. stocks closed slightly higher on Wednesday after data showed that inflation hit a four-decade high but came in largely in line with economists' expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1d9601e54c7121c1d82c4c0a1269abf8281a23f77416a1ab4af13fbb2e70a704"}
{"Ticker":"MSFT","Date":1642084278,"Headline":"Microsoft : 4 approaches to comprehensive security that help leaders be fearless","Source":"Finnhub","Summary":"The last 18 months have put unprecedented pressure on organizations to speed up their digital transformation as remote and hybrid work continue to become the new normal. Yet even with... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dd2635b3eb4efed642e4bc70b440ef9c5064f4912dbaeb974aee06b7c720923e"}
{"Ticker":"MSFT","Date":1642084240,"Headline":"4 Green Flags for Nintendo's Future","Source":"Yahoo","Summary":"Nintendo's (OTC: NTDOY) stock has lost a quarter of its value over the past 12 months as investors fretted over the Japanese gaming giant's decelerating growth, competitive challenges, and supply chain headwinds.  Nintendo's growth accelerated throughout the pandemic in fiscal 2020 as people bought more Switch gaming consoles and played more games, but it faces much tougher year-over-year comparisons in fiscal 2021, which ends this March.  Nintendo expects all those challenges to reduce its revenue and net profit per share by 9% and 26%, respectively, for the full year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c56f9325f68ab319ca70deaf3f2381e1436bb4189098edc2559c26a20db1da3d"}
{"Ticker":"MSFT","Date":1642084082,"Headline":"Onto Innovation (ONTO) to Benefit From Strong Order Backlog","Source":"Yahoo","Summary":"Onto Innovation (ONTO) announces that the company has a total order backlog of $500 million."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50f4ccc6d77687735f1955918a52bf603a6469e897bb5af29f18c180698e0cd6"}
{"Ticker":"MSFT","Date":1642083782,"Headline":"Ciena (CIEN) Deploys Solutions to Boost GBI's Submarine Network","Source":"Yahoo","Summary":"Ciena (CIEN) partners Gulf Bridge International to boost the latter's submarine network infrastructure with GeoMesh Extreme solution."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=95efb3615750ead3e892dff2214a995155e635ab0462e471e1b11e7361620c76"}
{"Ticker":"MSFT","Date":1641819947,"Headline":"Is Snowflake Stock A Buy Amid Software Sector Volatility?","Source":"Yahoo","Summary":"Snowflake stock, the biggest software IPO ever, has rebounded. Here is what technical analysis says about buying SNOW stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0da03c6685fea138088f47445cfeef7f44912aab88be21d61cf08c5ca44e7562"}
{"Ticker":"MSFT","Date":1642082400,"Headline":"4 Reasons to Invest in Nvidia's AI in 2022","Source":"Yahoo","Summary":"Nvidia (NASDAQ: NVDA) has a long history of creating innovative and in-demand technology, and it's doing it again with artificial intelligence.  In this Backstage Pass clip from \"The AI\/ML Show\" recorded on Jan. 5, Motley Fool contributor Danny Vena explains why Nvidia is a top pick for investors interested in this space.  Danny Vena: When you talk about a company that's been around for a while, Nvidia actually is one of the pioneers in graphics processing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9fd66a1f88b5d13ed9c9c85da77244f38d52a3ab84670e2dc8e0800d15b08d7"}
{"Ticker":"MSFT","Date":1642081500,"Headline":"Microsoft Is Heading for the Elusive $3 Trillion Market Capitalization","Source":"Yahoo","Summary":"Analysts see risks in the cloud software sector, which may be heading for a shock from more moderate spending. Not so for Microsoft."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d9cd9a364e0bf918d941a958506712bb56fafabeb4d1f2d012344ccd34d067c4"}
{"Ticker":"MSFT","Date":1642080721,"Headline":"Broadcom and Cardinal Health have been highlighted as Zacks Bull and Bear of the Day","Source":"Yahoo","Summary":"Broadcom and Cardinal Health have been highlighted as Zacks Bull and Bear of the Day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c196fb0d7afd4461c9faead31c8cd8f69fbb880b5d70581ac2f5509abea3981a"}
{"Ticker":"MSFT","Date":1642078873,"Headline":"Microsoft : How AI is being used to improve disability employment","Source":"Finnhub","Summary":"A pivotal step in every employment journey involves a jobseeker learning about the requirements of a potential job to assess their own interest and qualifications. Interfaces for job... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f84f7e26a066542b0efc9b09a7a757e29f3049da8dbd5abe045dba266d4432b"}
{"Ticker":"MSFT","Date":1642078871,"Headline":"EzPC: Increased data security in the AI model validation process","Source":"Finnhub","Summary":"From manufacturing and logistics to agriculture and transportation, the expansion of artificial intelligence in the last decade has revolutionized a multitude of industries-examples... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90aead0922fc5aa1eb4c88f31e3a6333df36f33f154c94b7805541b8783ab2e5"}
{"Ticker":"MSFT","Date":1642078477,"Headline":"DigitalOcean: The Decentralized Future Of Technological Innovation","Source":"SeekingAlpha","Summary":"DigitalOcean is a smart way to invest in the future of tech. The company's platform has seen solid growth due to consistent demand. See more on DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6e4e4fd7bada8d65259a19cc5a634c39f8fe1dc04ad4f4e27cfab126ce9da915"}
{"Ticker":"MSFT","Date":1642078270,"Headline":"Microsoft priorities for Washington State Legislature in 2022: sustainability, housing, transportation and education","Source":"Finnhub","Summary":"This month marks two years since the first case of Covid-19 was identified in Washington state. That anniversary serves as a sobering reminder that we continue to face persistent... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eaf8ea95ab1f02fc76ca3919f8c3f760fa05df49a233946a53800540e48f1a7a"}
{"Ticker":"MSFT","Date":1642078260,"Headline":"US STOCKS-Wall St pressured by Big Tech declines; PPI data offers relief","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Thursday, dragged down by declines in megacap growth stocks, while a slower rise in producer prices in December spurred hopes that inflation has potentially reached its peak."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4086d6c2c7ed61893c598820c2c193edd12a95f09f1764e93776733ab3a1eea3"}
{"Ticker":"MSFT","Date":1642076046,"Headline":"Microsoft has stopped making Xbox One consoles - The Verge","Source":"Reuters","Summary":"Microsoft Corp has stopped manufacturing all Xbox One consoles to focus on producing its next-generation consoles, the Verge reported https:\/\/www.theverge.com\/2022\/1\/13\/22881211\/microsoft-discontinues-xbox-one-consoles-2020 on Thursday, citing a senior executive of the gaming..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=63c997797be7e7021f51b8945fe5389cb7b71722c7cc9de84c07a584a13068a5"}
{"Ticker":"MSFT","Date":1642075500,"Headline":"Better Buy: Microsoft vs. Alphabet","Source":"Yahoo","Summary":"Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) were two of the best-performing tech stocks of 2021.  Over the past 12 months, Microsoft's stock price rallied 45% as Alphabet's stock advanced 59%.  Microsoft splits its sprawling business into three main segments: Productivity and Business Processes (Office, Dynamics, and LinkedIn), Intelligent Cloud (Azure and its other cloud services), and More Personal Computing (Windows, Xbox, Surface, Bing, and online advertising)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=867b4d9364ab5647d34c81ec19b5d11e5af26b5adc42f54b41472d265a90c973"}
{"Ticker":"MSFT","Date":1642074360,"Headline":"Microsoft (MSFT) Accelerates Manufacturing Homegrown Chips","Source":"Nasdaq","Summary":"Microsoft MSFT recently hired key Apple AAPL engineer Mike Filippo to accelerate the process of creating homegrown chips and reduce the dependency on third-party providers. Filippo has worked with Apple for two years.Microsoft has been working on developing in-house proce"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a44f17edb63bc8996ae0b1832c472ece717a0ebf9a233b85dd371f7b398cb075"}
{"Ticker":"MSFT","Date":1642073514,"Headline":"Microsoft invests $50 million in alcohol-to-jet fuel biorefinery","Source":"Reuters","Summary":"Microsoft is investing $50 million in a LanzaJet facility in Georgia that will produce jet fuel from ethanol next year, LanzaJet said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75649492346414ed67a36b43e7403875512d5da3d7ad529d874ed2bd07e4b7b7"}
{"Ticker":"MSFT","Date":1642073400,"Headline":"3 Dividend-Paying Tech Stocks to Buy Right Now","Source":"Yahoo","Summary":"Most investors don't buy tech stocks for the dividend, but these payers offer more than meets the eye."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c62307f28acd3053edf8a67365047f06830d0d1fc9ba4b83d59d022c9b65fbae"}
{"Ticker":"MSFT","Date":1642072920,"Headline":"Best Stocks To Invest In 2022? 3 Consumer Discretionary Stocks To Watch","Source":"Nasdaq","Summary":"Are These The Best Consumer Discretionary Stocks To Invest In Right Now?When it comes to answering the question of what stocks to buy today, consumer discretionary stocks could be standing out in the stock market now. For the most part, this section of the market is in an interes"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db7ba87fe008cef16a92732a18a0df3e7700ac9a4800a4cf45133d7e0dd8a138"}
{"Ticker":"MSFT","Date":1642070700,"Headline":"4 Beaten-Down Tech Stocks You Should Keep an Eye On","Source":"Nasdaq","Summary":"The major indexes are moving up one day and down the next although of late, they’re moving down more often. The writing is on the wall: tapering is almost done and rate hikes are coming."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4aba19175fc11213727ef934db374ed4ca8fac38f73686e82fe004e4acdd724f"}
{"Ticker":"MSFT","Date":1642070520,"Headline":"US STOCKS-Dow higher after producer prices data; Nasdaq, S&P 500 fall","Source":"Nasdaq","Summary":"The Dow rose on Thursday after a slower rise in producer prices in December fueled hopes that inflation has potentially reached its peak, while declines in healthcare stocks and megacap companies pressured the S&P 500 and the Nasdaq."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1810a09e24dd2e12d9a7121eae9dc0388c84ac9bd14dcfaff9cd4155274ae6ae"}
{"Ticker":"MSFT","Date":1642067337,"Headline":"Top Stocks Not To Miss From Glassdoor's 2022 Rankings","Source":"SeekingAlpha","Summary":"Since 2009, Glassdoor has released a yearly ranking of the Best Places To Work. Glassdoor just revealed its 2022 ranking. See the top stocks from the rankings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75fc4555b24e4e1610d94a57bfe12fa6cacaacb09798029f1650d6eaea39d66c"}
{"Ticker":"MSFT","Date":1642062600,"Headline":"Down 55% From Its High, Is UiPath Stock a Smart Buy?","Source":"Nasdaq","Summary":"UiPath (NYSE: PATH) is on a mission to fully automate the enterprise. To that end, its software platform helps clients build AI-powered bots capable of augmenting a human workforce by automating a variety of business processes. Since going public in April 2021, UiPath's share pri"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4b33bed1c70243e3440d0714ca04e4f0a80640633ac308491a5451a335f973b"}
{"Ticker":"MSFT","Date":1642061221,"Headline":"My Dividend Portfolio: December 2021 Update - 100 Holdings, 27 Buys, 1 Sell","Source":"SeekingAlpha","Summary":"I am continuing my monthly investment plans while still awaiting a market correction. Check out my dividend portfolio composition at the end of December 2021."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=615290a4dc5a4e5aa1b9950be94fa6608cc6bee51c1ad07eb7008f47f22281e3"}
{"Ticker":"MSFT","Date":1642054800,"Headline":"Should iShares Core S&P 500 ETF (IVV) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Launched on 05\/15\/2000, the iShares Core S&P 500 ETF (IVV) is a passively managed exchange traded fund designed to provide a broad exposure to the Large Cap Blend segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a67408a80af951132ba5367663faced8bd1a891119f007a63d4c7128f0c0dbfa"}
{"Ticker":"MSFT","Date":1642054800,"Headline":"Should iShares Russell 1000 Growth ETF (IWF) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"The iShares Russell 1000 Growth ETF (IWF) was launched on 05\/22\/2000, and is a passively managed exchange traded fund designed to offer broad exposure to the Large Cap Growth segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00ed019768ac0b589123953b6f6a18ea2847f25c6fd4ca7a017eb17218c75f74"}
{"Ticker":"MSFT","Date":1642054800,"Headline":"Should Vanguard Mega Cap ETF (MGC) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Launched on 12\/17\/2007, the Vanguard Mega Cap ETF (MGC) is a passively managed exchange traded fund designed to provide a broad exposure to the Large Cap Blend segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=01ac4afe9c29f13f6f23cfe98ac99fa8daab33d9beeadc1211bcbc9ea636ec72"}
{"Ticker":"MSFT","Date":1642054200,"Headline":"Where Will Zoom Video Communications Be in 3 Years?","Source":"Nasdaq","Summary":"Zoom Video Communications (NASDAQ: ZM) has gone on a wild ride since its IPO in April 2019. The video conferencing company went public at $36 per share, and its shares started trading at $65 on the first day.Zoom's stock subsequently skyrocketed in 2020 as its brand became synony"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=81ab2d1c02c30bb0c7063f1ece923953dd4379117c380be1db59f552196b9544"}
{"Ticker":"MSFT","Date":1642051800,"Headline":"3 Investments You'll Thank Yourself for by the End of 2022","Source":"Nasdaq","Summary":"As we continue into the new year, it's the perfect opportunity to reevaluate your portfolio and consider adding some new investments."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b935d36ce66a019ef414cf67aad62b267c5e22b7a9df92aca3432471b4a8b30"}
{"Ticker":"MSFT","Date":1642050000,"Headline":"White House will meet execs from Apple, Amazon, IBM to discuss software security","Source":"Nasdaq","Summary":"The White House will meet executives from leading tech firms, including Alphabet-owned Google, Apple Inc and Amazon.com Inc, on Thursday to discuss software security after the United States suffered several major cyberattacks last year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6ab3c8d81d9ea231e65c5d82a97d5c00c5b1c8f27ed67c6be83517031bd39501"}
{"Ticker":"MSFT","Date":1642044775,"Headline":"Finally, I Found Alpha In 2021","Source":"SeekingAlpha","Summary":"Finding alpha regularly is not easy. Read this article to know how my portfolio performed in 2021 and check out my plans for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=450786c52f5f27ee9f1f8943fe754036a0667f53adadc9e4d26ed317c9d198c9"}
{"Ticker":"MSFT","Date":1642035180,"Headline":"Does VMware's Stock Have An Upside Potential?","Source":"Nasdaq","Summary":"[Update 01\/11\/2022] VMware’s Stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=48e741ab6b469f6f4e5d9113aaa384ab3c39fe0e3ef124e56c156e7b5a818cc7"}
{"Ticker":"MSFT","Date":1642200395,"Headline":"Genesys Taps Investment Banks for IPO This Year","Source":"Yahoo","Summary":"(Bloomberg) -- The private equity owners of Genesys have selected underwriters for an initial public offering that could value the call-center technology provider at more than $30 billion, according to people with knowledge of the matter.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingDjokovic’s"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=257a41579ca4cbec6f17aeabb426714d647eb6b248ee0a50e312e26cfacab2bf"}
{"Ticker":"MSFT","Date":1642199905,"Headline":"Sara-Bay Financial Buys Cerence Inc, Public Service Enterprise Group Inc, Welltower Inc, Sells ...","Source":"Yahoo","Summary":"Investment company Sara-Bay Financial (Current Portfolio) buys Cerence Inc, Public Service Enterprise Group Inc, Welltower Inc, Oragenics Inc, Veeva Systems Inc, sells Alibaba Group Holding, Unilever PLC, International Paper Co, Paycom Software Inc, Titan Medical Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Sara-Bay Financial."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f42b5195b74763097894eb0def6176e0bdb85b2773544df5fd8f2d04d5fa643"}
{"Ticker":"MSFT","Date":1642190760,"Headline":"Genesys picks investment banks for U.S. IPO - source","Source":"Nasdaq","Summary":"The private equity owners of enterprise-software maker Genesys have chosen underwriters for a U.S. initial public offering (IPO), a person familiar with the matter told Reuters on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2bd16b281730fa3ec60b11d2cb9da64c56a0fc67560b074a88c755561a7360d8"}
{"Ticker":"MSFT","Date":1642190400,"Headline":"China's Attempt To Kill The Oil Rally Is Bound To Fail","Source":"Yahoo","Summary":"A combination of bullish factors means that oil markets largely shrugged off the recent announcement by China that it will release oil from its SPR"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c96792f3ba0e25c72d745fa011383ee33c1b75583c6372e604d429f99d3ec26"}
{"Ticker":"MSFT","Date":1642185916,"Headline":"Dow Jones Dives 450 Points As Stock Sell-Off Accelerates; Banks Fall But Chip Stocks Rally","Source":"Yahoo","Summary":"The stock market sell-off accelerated Friday afternoon as the Dow Jones Industrial Average shed 450 points to test its 50-day moving average."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d679e9ea39806d126402fc7a09b5985e31ca12f70606f3f5db21fdac05bc4db"}
{"Ticker":"MSFT","Date":1642185722,"Headline":"Former employee sues Nuance Communications, alleging fraud","Source":"Yahoo","Summary":"A new lawsuit has been filed against Burlington-based Nuance Communications Inc. by a former employee who accuses the company of fraud, malicious prosecution and defamation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e2787750d2530757a9102d4bb31763a3862d3294cfd165983ee6121ea6b5b11"}
{"Ticker":"MSFT","Date":1642182840,"Headline":"Why DigitalOcean Stock Tanked 9% Today","Source":"Nasdaq","Summary":"What happened\nShares of cloud computing company DigitalOcean Holdings (NYSE: DOCN) were down 9% today. It capped a horrific stretch for the small company. The stock was down over 13% on the week and has now been nearly halved from its all-time high reached just two months ago."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be5b33d13e98b6ac7d18fb6a5bf0365209fcbf3179e68616cf1b7286e8f32891"}
{"Ticker":"MSFT","Date":1642181525,"Headline":"The Zacks Analyst Blog Highlights: The Trade Desk, QuickLogic Corp., Microsoft and Monolithic Power Systems, Inc.","Source":"Yahoo","Summary":"The Trade Desk, QuickLogic Corp., Microsoft and Monolithic Power Systems, Inc. are included in this analyst blog"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3287c4c22ce04a3cb80b66839aec6119d3031309b2be7b1cd5bf7358501c235"}
{"Ticker":"MSFT","Date":1642181254,"Headline":"Market check: Stocks choppy in intraday trading, tech stocks turn green","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down how stocks are trading on Friday afternoon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5f9a6e9eccfd68ac739a7dad7698de79c8c371b89443061916996c91400bb4f"}
{"Ticker":"MSFT","Date":1642180032,"Headline":"Microsoft Stock Soared ~50% in 2021; How Much Higher Can It Go?","Source":"Yahoo","Summary":"Microsoft (MSFT) had an excellent 2021 and signs are 2022 will be no letdown either. At least, that is the opinion of Wedbush's Daniel Ives. “We believe large transformational cloud deals at MSFT are up north of 50% with clear momentum heading into 2022 and also some incremental share gains from AWS could be in the cards,” the 5-star analyst said. Ives’ comments follow December quarter checks in which the tech giant has shown “incremental strength again” with the Azure cloud growth story “hittin"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e5a607696719c20ebd091248f2fe877975fc2a4c637ede72fc214d9bdd89a54"}
{"Ticker":"MSFT","Date":1642179932,"Headline":"Data-driven digital business is ‘in its first chapter,’ NetApp CEO says","Source":"Yahoo","Summary":"NetApp CEO George Kurian joins Yahoo Finance’s Akiko Fujita and Brian Sozzi to discuss the outlook on cloud computing, chip supply disruptions, and digital transformations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a11c3f3dcbcee0acc579dbd8a62936cf531203bc51efee8579a0cd17f225c720"}
{"Ticker":"MSFT","Date":1642179038,"Headline":"Fact Check-Bill Gates video clip is about global elimination of COVID-19, not people","Source":"Reuters","Summary":"Social media users are sharing a cropped clip of Microsoft co-founder and philanthropist Bill Gates talking about “global elimination” and claiming that he is referring to population control via the elimination of people. A longer video shows that Gates is talking about..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a7f20b81361d7196a3cc567fe5acd6856cf1b17ec74d34c057208e65b180f37e"}
{"Ticker":"MSFT","Date":1642178275,"Headline":"Buckle Up: December Retail Sales Miss Is Worse Than It Appears","Source":"SeekingAlpha","Summary":"December's disappointing retail sales follows a string of weaker than expected macro data. Fed may need to adjust its message at January FOMC meeting. Read more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eafbc7ed2ef72dcd1a1ed8ecead50a2a4e2a07e0a1a43513e6c41efb7de9e634"}
{"Ticker":"MSFT","Date":1642177504,"Headline":"Acuity Brands (AYI) Partners Microsoft to Boost Technology","Source":"Yahoo","Summary":"Acuity Brands (AYI) collaborates with Microsoft to advance its smart lighting, lighting controls, and building automation solutions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8a63f516f835ddf239929dae0ba4dd00f65f2181b30ae26c0d3dcf3d8943ac6a"}
{"Ticker":"MSFT","Date":1642172643,"Headline":"SAP Reports Upbeat Preliminary Q4 Results Driven by Cloud","Source":"Yahoo","Summary":"SAP's Q4 performance benefits from strength in its cloud business, especially the strong adoption of the company's \"Rise with SAP\" solution."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1b0c1f02997d96d18425ea34fb6e40e47115f0d8830d93f0a15cc33a31083fc"}
{"Ticker":"MSFT","Date":1642171925,"Headline":"Microsoft : Empowering 2 billion global frontline workers","Source":"Finnhub","Summary":"The past two years have been challenging for everyone, especially frontline workers tasked with keeping the proverbial lights on throughout the pandemic. From healthcare to... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=332afa36f42de49d0dfaafe3ec2d2a40bcdfd25529e8c81c584c28680516c806"}
{"Ticker":"MSFT","Date":1642170929,"Headline":"Dow Jones Sells Off As Citigroup, JPMorgan Tumble On Earnings","Source":"Yahoo","Summary":"The Dow Jones Industrial Average sold off Friday after Thursday's stock market losses. Citigroup, JPMorgan and Wells Fargo report earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b16941b838802287a850c699d9981e4a03d9626fc823b37f9cfd0795272c5c82"}
{"Ticker":"MSFT","Date":1642170600,"Headline":"Is the Market Undervaluing This Gaming Stock?","Source":"Yahoo","Summary":"In this segment of \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Fool contributors Toby Bordelon and Brian Feroldi chat about Nintendo's (OTC: NTDOY) successful 2021 and its healthy outlook for this year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=43fc657ee0301b18d695c0e3ed351ac34e307fa9c73050857240e36b2184199a"}
{"Ticker":"MSFT","Date":1642169582,"Headline":"Pure Storage (PSTG) Unit Boosts TeleMessage's Compliant Solutions","Source":"Yahoo","Summary":"Pure Storage's (PSTG) arm collaborates with TeleMessage to improve the latter's secure and compliant data storage for global enterprise customers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=48443669e7ce42c117ab092fc5e498852f1e379b82bfe0ab8dc185056ada92ab"}
{"Ticker":"MSFT","Date":1642168914,"Headline":"Senator John Hickenlooper Latest Portfolio: 8 Stocks to Watch","Source":"Yahoo","Summary":"In this article, we discuss the 8 stocks to consider in the latest portfolio of John Hickenlooper. If you want to skip our detailed analysis of these stocks, go directly to John Hickenlooper Latest Portfolio: 3 Stocks to Watch. The equity trading activities of United States lawmakers are once again in the spotlight. Disclosures made […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=121f9e2977a1d06148a7575de181d37d08a470c4a67829070a32d27f79177b68"}
{"Ticker":"MSFT","Date":1642165244,"Headline":"How To Buy Stocks: This Research Tool Helps Investors Evaluate Winning Stocks","Source":"Yahoo","Summary":"Research is one of the key contributing factors to future investing success when learning how to buy stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=57ab4418e65bb3ba1265ef1213102485b72f21a5fda76d2137ed6d8d4ac2d4a2"}
{"Ticker":"MSFT","Date":1642163760,"Headline":"Prediction: Amazon Stock Will Be Worth More Than Apple in 10 Years","Source":"Yahoo","Summary":"Most people think of Amazon (NASDAQ: AMZN) as an e-commerce company, and for good reason.  It has become the online marketplace of choice for millions of consumers around the world.  In this Backstage Pass video, recorded on Jan. 4, Motley Fool contributor Trevor Jennewine explains why Amazon could surpass Apple (NASDAQ: AAPL) as the world's most valuable company in 10 years' time."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53b3e1bbdf71afeb71b37d58603007f52d6bc256bf92be00eed2e005801cab74"}
{"Ticker":"MSFT","Date":1642163498,"Headline":"Facebook, Google CEOs aware of formal advertising market deal -- court filing","Source":"Finnhub","Summary":"Chief executives of AlphabetInc's Google and Facebook were aware of a dealto carve up part of the online advertising market, according toan amended complaint filed by Texas and other states that... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b492b4e9b78782ec154f002f0f43940b57a761746d182d1220fa12f6b9e984ce"}
{"Ticker":"MSFT","Date":1642163460,"Headline":"US STOCKS-Wall St dragged down by financials after mixed results from big banks","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4223986daabcf67d0adef3c218460e3c5c4cfac8dfd3b63e451cc3bb8296e7d6"}
{"Ticker":"MSFT","Date":1642163231,"Headline":"Types of Stocks","Source":"Yahoo","Summary":"Understanding different stock categories can help you make better informed investment decisions. Here are some stock types investors need to know."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5358016514d43a1fd4737856e6f2127dc59e8cda90f355e2f51cd3c7025994d"}
{"Ticker":"MSFT","Date":1642163186,"Headline":"Closed-End Funds: A Look At 2021, And Looking Forward To 2022","Source":"SeekingAlpha","Summary":"The market can continue to run higher, though I would temper expectations for the year. Read more to find out why I'm cautiously optimistic heading into 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d43263fc71c940f326b02eddeb9f475822cfe34ea6c6e86f6b835f211a641f24"}
{"Ticker":"MSFT","Date":1642161900,"Headline":"2 Monster Metaverse Stocks to Buy for the Long Haul","Source":"Yahoo","Summary":"The compelling growth potential of the metaverse continues to catch the attention of investors.  BrandEssence Market Research estimates a compound annual growth rate of 45% over the next five years, and Morgan Stanley's Brian Nowak believes it represents an eventual addressable market of $8 trillion, according to an interview with Forbes.  Through applying metaverse functionality, Matterport (NASDAQ: MTTR) and Zoom Video Communications (NASDAQ: ZM) have positioned themselves to become key companies in this emerging industry."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90b5b1c1412740b1bca592ced05433e9c1eb72f4a9c25319cd08291f28ca144b"}
{"Ticker":"MSFT","Date":1642161600,"Headline":"Wall St Week Ahead-Earnings to test growth stocks after rocky start to year","Source":"Nasdaq","Summary":"A rough start to 2022 for U.S. tech and growth stocks is raising stakes for upcoming earnings reports, as investors seek reasons to keep faith in the shares while bracing for U.S. interest rate hikes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=59b9843793f50e5cedda5f5968726a388df840e283b8d64dc8b3b3adc5766fb0"}
{"Ticker":"MSFT","Date":1642161600,"Headline":"4 Reasons Meta Platforms Is Poised to Grow in 2022","Source":"Yahoo","Summary":"Meta Platforms (NASDAQ: FB) is hiring lots of new engineers to work on machine learning, virtual reality, and augmented reality as it expands its focus to the metaverse.  In this Backstage Pass segment from \"The AI\/ML Show\" recorded on Jan. 5, Motley Fool contributors Jose Najarro, Toby Bordelon, and Danny Vena discuss how Meta is setting itself up to succeed in a new field."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3720753a7406ae958ede2216c296bd65056f811d34b7f599720908ad89a6b74c"}
{"Ticker":"MSFT","Date":1642161600,"Headline":"Bull vs. Bear: Could Tesla Be the Best-Performing S&P 500 Stock of 2022?","Source":"Yahoo","Summary":"Tesla (NASDAQ: TSLA) and the electric vehicle (EV) industry continue to capture the spotlight as growth investors look toward industries with paradigm-shifting technology and long-term prospects.  Tesla has developed a reputation for beating and even leading the market to new heights.  Daniel Foelber: In May 2019, share prices of Tesla fell to a multiyear intraday (split-adjusted) low of $37.01 per share."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8313fbffb3eceb6c1af8ae21618df698319a83e5c33d68866d3de55ebc721f33"}
{"Ticker":"MSFT","Date":1642160040,"Headline":"3 Popular ESG Indexes and How to Invest in Them","Source":"Nasdaq","Summary":"Here’s a look at three ESG indexes (based on the prominent parent indexes) and the ways to invest in them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cec46e63c16bf5065a8b188d6144ec2f913ce6362f996502530a91a2783dca34"}
{"Ticker":"MSFT","Date":1642157194,"Headline":"TINA Was Wrong, Cash Is Not Trash, And There Is An Alternative","Source":"SeekingAlpha","Summary":"Despite high rates of inflation, recent CPI readings register a 7.0% inflation rate, many stock prices have deteriorated faster than cash prices. See more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=275cbeb7c370c77bb3a0b3caa6e4e2f66d626e6ad8d9d3de4124805d99c278af"}
{"Ticker":"MSFT","Date":1642156740,"Headline":"Ciena (CIEN) Optical Solutions Leveraged by India-Based Vi","Source":"Nasdaq","Summary":"Ciena Corporation’s CIEN coherent optical solutions are being used by India-based —Vodafone Idea Limited (VIL or Vi) as the telecom operator overhauls its network backbone scalability in the country."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a232f3ad0b5dda16ea55df473ed042a72c0a6dd767f97e6c4c60dc609d906f5d"}
{"Ticker":"MSFT","Date":1642156440,"Headline":"US STOCKS-Dow, S&P 500 dragged down by financials after mixed big bank results","Source":"Nasdaq","Summary":"The Dow and the S&P 500 fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season, while the Nasdaq edged higher as some big technology stocks regained lost ground."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e23ce4228749fa9074148da7f0e488027a65a4003a84f74adbe35051f2275a31"}
{"Ticker":"MSFT","Date":1642152600,"Headline":"Stock Market News for Jan 14, 2022","Source":"Nasdaq","Summary":"U.S. stocks closed sharply lower, led by a huge selloff in tech stocks as the Nasdaq snapped its three-day winning streak after rising interest rate worries once again dented investors’ spirits. All the three major indexes ended in negative territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcfdb59abe8c7eed5ab00b7aad645dd7ef4a57ef29a8f678e14318cdd0be6f84"}
{"Ticker":"MSFT","Date":1642150500,"Headline":"US STOCKS-Wall St set to open lower after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index were set to open lower on Friday as JPMorgan, Wells Fargo and Citigroup kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5e41ac8202a323992448e8880807bc49831cafb5c88840486f39ab24d6684c7"}
{"Ticker":"MSFT","Date":1642148220,"Headline":"This Monster Growth Stock Could Make You Richer in 2022 (and Beyond)","Source":"Nasdaq","Summary":"Doximity (NYSE: DOCS) is the most popular digital platform among U.S. healthcare professionals. Serving as a sort of social network for clinicians, the platform allows clients to connect with colleagues, coordinate patient care, and conduct telehealth visits. In this Backstage Pa"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3be5c367b475abdae30902929d0f1a07f8bcb79110b14c394729a24ad1809c5e"}
{"Ticker":"MSFT","Date":1642146060,"Headline":"US STOCKS-Futures slip after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index futures edged lower on Friday as big lenders including JPMorgan and Wells Fargo kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=91515945fb98c6925752ebd7554642870c8daccfd5146a79dcbf26654cda1df4"}
{"Ticker":"MSFT","Date":1642144860,"Headline":"Microsoft To Review Harassment, Gender Discrimination Policies","Source":"Nasdaq","Summary":"(RTTNews) - Microsoft Corp. said its Board of Directors has initiated a review of the effectiveness of its workplace sexual harassment and gender discrimination policies and practices."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3504f420775db34216769679e8f3f6892c15818645ee3f44d094ebecf259fde3"}
{"Ticker":"MSFT","Date":1642143600,"Headline":"Target, SAS, others cut back visits to New York retail trade show as Omicron spikes","Source":"Nasdaq","Summary":"Target Corp and computer software firm SAS are among major companies bowing out of what is billed as the retail industry's biggest annual trade show, slated to start Sunday in New York City's Javits Center."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04d3823fe25dc25bcee98c4bf7fed1cfd0babaf5867972e8f24830c918e66e32"}
{"Ticker":"MSFT","Date":1642141200,"Headline":"Should Invesco QQQ (QQQ) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Looking for broad exposure to the Large Cap Growth segment of the US equity market? You should consider the Invesco QQQ (QQQ), a passively managed exchange traded fund launched on 03\/10\/1999."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6daa391b851ccfed640c101a71e93541f7370c3dc56828e953ecc37df6d5d11d"}
{"Ticker":"MSFT","Date":1642139100,"Headline":"3 Reasons to Dip Into Crypto in 2022 -- and 2 Reasons Not To","Source":"Nasdaq","Summary":"From the sidelines, you've watched cryptocurrencies rise and fall dramatically over the past year. But now that Bitcoin (CRYPTO: BTC), the most popular cryptocurrency, is down 35% from its November 2021 high, you might wonder if there's opportunity behind that volatility."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b73fe40298d8e48d9160290af87652bc01d65d91f1bc1c6954d14a8b3841bde1"}
{"Ticker":"MSFT","Date":1642121979,"Headline":"Microsoft commits to outside review of sexual harassment policies","Source":"Yahoo","Summary":"Microsoft's board has hired a law firm to review its sexual harassment and gender discrimination policies. It will also summarize its 2019 investigation into allegations against Bill Gates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cf7b69140b36e9cf58ec7266b981d79f133a2c5466558f20d1b7436d02057e70"}
{"Ticker":"MSFT","Date":1642255421,"Headline":"10 ESG Dividend Stocks to Buy","Source":"Yahoo","Summary":"In this article, we will be taking a look at 10 ESG dividend stocks to buy. To skip our detailed analysis of dividend investing, you can go directly to see the 5 ESG Dividend Stocks to Buy. With the rise of Corporate Social Responsibility (CSR) programs and a greater focus on the consequences of companies’ […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8dd6ed1dd42cba9c40c4bdec30438ce2904f0d79783d6069eb28907cf084e10e"}
{"Ticker":"MSFT","Date":1642249800,"Headline":"Is This Tech Stock the Square of Cloud Computing?","Source":"Yahoo","Summary":"In this segment of Motley Fool Live, recorded on Jan. 6, Fool contributor Trevor Jennewine explores how DigitalOcean (NYSE: DOCN) has been able to gain some significant traction in the crowded cloud computing space.  Trevor Jennewine: DigitalOcean is in the cloud computing business.  It provides a range of infrastructure services like compute, storage, networking, and platform services like application development tools."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9967afc71b81c70d8086dacbcf9cb19d01d1165a486c9561a2514a521fcd477b"}
{"Ticker":"MSFT","Date":1642239420,"Headline":"Is Palantir a 2022 Breakout Stock?","Source":"Nasdaq","Summary":"While starting off as a data analytics company that catered to the U.S. government, Palantir (NYSE: PLTR) has pivoted to provide its services to the civilian market. Some people fear the government has access to too much personal data, and Palantir processes a portion of the info"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6787f4f8058c13d5614f03a9d2dc0f695474d4399e918dcea86d75787f7ea0e5"}
{"Ticker":"MSFT","Date":1642229429,"Headline":"Confounded's Complete Aggressive Growth Portfolio After A Brutal Beatdown","Source":"SeekingAlpha","Summary":"I have reduced my number of holdings in portfolio to 25 and have begun to concentrate my holdings among a few. Check out my current aggressive growth portfolio."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d90fb5b50c198f00685ab7386bb327fb17b396c3e36378fe2fcca87be2bd3665"}
{"Ticker":"MSFT","Date":1642227000,"Headline":"Want a 54% to 244% Return? Try These Growth Stocks, Wall Street Says","Source":"Nasdaq","Summary":"The new year is still fresh, but the stock market is off to a bumpy start to 2022. The S&P 500 index, which is followed for its diverse array of sectors, has already fallen by 2.4% since Jan. 1. The technology sector has fared even worse, but that presents some opportunities"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=85a5689da1bed51549875bd954ed948b36d9ce49a420727992c3c3575605c596"}
{"Ticker":"MSFT","Date":1642210615,"Headline":"5 Reasons To Buy Microsoft In 2022","Source":"SeekingAlpha","Summary":"Microsoft’s momentum in cloud, enterprise-facing businesses to achieve robust growth in years ahead. Check out 5 reasons why you must buy MSFT stock In 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=378cf6f99255614914ac635d798025a66f5773470680fe1b261319e5ea160f81"}
{"Ticker":"MSFT","Date":1642368960,"Headline":"Ukraine says Russia behind cyberattack on government sites, as threat of invasion looms","Source":"Yahoo","Summary":"Ukraine said Sunday that Russia was behind a cyberattack that defaced its government websites and alleged that Russia is engaged in an increasing “hybrid war” against its neighbor."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1aaa4221c9947b2b6b362c18db36e93e2e82dba8ea8358789ffc9a551ec10f3c"}
{"Ticker":"MSFT","Date":1642351757,"Headline":"Trouble For Technology","Source":"SeekingAlpha","Summary":"It has been a rough start for the NASDAQ and technology so far in 2022. These challenges can be traced back as far as mid-2021."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11ddbe29f435f922afd47387dc50b8cf9a2266bc61b2967424cf24c5d3165fbd"}
{"Ticker":"MSFT","Date":1642323600,"Headline":"Wall St Week Ahead-Earnings to test growth stocks after rocky start to year","Source":"Nasdaq","Summary":"A rough start to 2022 for U.S. tech and growth stocks is raising stakes for upcoming earnings reports, as investors seek reasons to keep faith in the shares while bracing for U.S. interest rate hikes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b57415f2b18adc07d4971e255695552a94724707f8ff06ea95aaa7c7d777478e"}
{"Ticker":"MSFT","Date":1642313116,"Headline":"Microsoft says it observed destructive malware in systems belonging to several Ukraine govt agencies","Source":"Yahoo","Summary":"The victims of the malware include Ukrainian government agencies that provide critical executive branch or emergency response functions, Microsoft said.  Also affected was an information technology firm that manages websites for public and private sector clients, including government agencies whose websites were recently defaced.  Microsoft did not identify the IT firm involved."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a090e8bc27cb8600a1b928aab15ad9b40776dd81b7a5fa8f41be6149294f42d9"}
{"Ticker":"MSFT","Date":1642460110,"Headline":"Microsoft (MSFT) Outpaces Stock Market Gains: What You Should Know","Source":"Yahoo","Summary":"Microsoft (MSFT) closed at $310.20 in the latest trading session, marking a +1.77% move from the prior day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c9d2f3d77eb4dcd1b4fc24074189d6395e5fcdc99e82552438729e3f92b42460"}
{"Ticker":"MSFT","Date":1642454552,"Headline":"Microsoft: Ultimate Definition Of An Economic Moat","Source":"SeekingAlpha","Summary":"Microsoft is the whole package deal, encompassing past (technology leader since 80s), present (net income of $68 B), and future (metaverse, AI, and etc). Read to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=96818a455ae4f17810972f0e494ab9967c81ef87d84ae7a734de2fda883b6362"}
{"Ticker":"MSFT","Date":1642446075,"Headline":"10 Dividend Stocks to Buy According to Ken Fisher","Source":"Yahoo","Summary":"In this article, we discuss the 10 dividend stocks to buy according to Ken Fisher based on Q3 holdings of his fund. If you want to skip our detailed analysis of Fisher’s history, investment philosophy, and hedge fund performance, go directly to the 5 Dividend Stocks to Buy According to Ken Fisher. Kenneth Lawrence Fisher […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=135976a8bdc2c677ee55a3ef1eeefe4d954a8758da9a4c458ca061768717f15b"}
{"Ticker":"MSFT","Date":1642437262,"Headline":"10 Cryptocurrencies Reddit is Buying for the Next Bull Run","Source":"Yahoo","Summary":"In this article, we discuss the 10 cryptocurrencies Reddit is buying for the next bull run. If you want to skip our detailed analysis of these currencies, go directly to the 5 Cryptocurrencies Reddit is Buying for the Next Bull Run. The past year was in many ways a defining one for the crypto industry. […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e541b314240a32cf35d015e559e908feeb144a3b3247737e35c0bf86ec5318d"}
{"Ticker":"MSFT","Date":1642429442,"Headline":"Cadence (CDNS) Spurs Depth Perception With Tensilica Vision Q7 DSP","Source":"Yahoo","Summary":"Cadence (CDNS) integrates its Tensilica Vision Q7 DSP solution with Light's Clarity Depth Perception Platform to enhance advanced driver-assistance systems with greater performance."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5469cdd93a25dbcfbf1a88d6c5b3160612d63f46f5ddd8cd891447c372400250"}
{"Ticker":"MSFT","Date":1642429407,"Headline":"Narrowing Down High-Quality Dividend Growth: Snap-On Is A Sure Bet","Source":"SeekingAlpha","Summary":"Snap-on is a solid firm with a simple strategy delivering sustained mid-single-digit growth. See why I think SNA is a strong candidate for further investment."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=40dc7e59da0f1f56e9a2245814a4d5927ab33d2bcc9ace85dab3a6003d08cfc3"}
{"Ticker":"MSFT","Date":1642428402,"Headline":"Billionaire Stephen Mandel’s Portfolio: 8 New Stock Picks","Source":"Yahoo","Summary":"In this article, we discuss 8 new stock picks of billionaire Stephen Mandel. If you want to skip our detailed analysis of these stocks, go directly to Billionaire Stephen Mandel’s Portfolio: 3 New Stock Picks. Lone Pine Capital was founded by billionaire Stephen Mandel in 1997, who served as the hedge fund’s president and portfolio […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=761eaaf45b78c022c9fe17064f5d7a58b5d4aa196cd3790c33c9f0b1b2b9c58e"}
{"Ticker":"MSFT","Date":1642427880,"Headline":"Polygon’s Value Grows as Its Apps Grow in Usefulness and Popularity","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cef806cfb07ffa0e57e7e37eb97c77119bcea05a7b163feb61c070819a7e1ca0"}
{"Ticker":"MSFT","Date":1642425900,"Headline":"Tech Stocks Roundup: Well-Known Value Investor Likes Google, Meta, Netflix","Source":"Yahoo","Summary":"Check out the latest news and performance numbers from the top technology and FAANG\/MAMAA stocks like Amazon, Apple, Microsoft, Intel, and more."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5c488737928f627e5e54ddc52f3f306e5261c8dc0c639867b870983e78b4bdb"}
{"Ticker":"MSFT","Date":1642421374,"Headline":"Musk and Bezos among world's 10 richest men who doubled their wealth in pandemic","Source":"Yahoo","Summary":"The 10 richest now have six times more wealth than the poorest 3.1 billion people, according to an Oxfam study."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23d87293fe0c8bc1181a309f067893fd58393d1def4643889bcbb296deaef3ca"}
{"Ticker":"MSFT","Date":1642419900,"Headline":"3 Stocks I'm Buying During a Tech Stock Correction","Source":"Yahoo","Summary":"Tech stocks have gotten off to a rough start this year.  For instance, the tech-heavy Nasdaq Composite index is down 5% so far.  If this continues into full-blown correction territory, widely considered a 10% decline, investors can pick up certain tech stocks at good valuations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75ce72c67f94a3c344521a4049c67b860c66ebf9f3d653b206d4c16f4adf4e46"}
{"Ticker":"MSFT","Date":1642419054,"Headline":"IYW: Technology Dashboard For January","Source":"SeekingAlpha","Summary":"Hardware is the most attractive tech industry regarding valuation, quality, and momentum. See why I think IYW ETF is an alternative to XLK ETF."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d95e23e85cf5f43d8169385bd104a14bb94de0a1c90cb8d6b4f6a684b435037a"}
{"Ticker":"MSFT","Date":1642419000,"Headline":"Can 2021's Best-Performing FAANG Stock Do It Again in 2022?","Source":"Yahoo","Summary":"If you had invested in any one of the FAANG stocks 10 years ago, you'd be pleased. On average, FAANG stocks have returned an astounding 1782% over the last 10 years versus the market's 325%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f97f2daa9881207ab9b44e75c847e37060d94378a77b6e49a639e5b22c1f803"}
{"Ticker":"MSFT","Date":1642403460,"Headline":"3 Reasons to Buy Take-Two Stock in 2022","Source":"Nasdaq","Summary":"Just when it seemed video game stocks were in a lull following the surge in growth during 2020, Take-Two Interactive (NASDAQ: TTWO) made waves with the announced acquisition of top mobile game maker Zynga (NASDAQ: ZNGA) for $12.7 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4095b9946d33e67b7e3cfcc89e4d7602a13cb2954f3ae15b13e62da97a1ad637"}
{"Ticker":"MSFT","Date":1642400760,"Headline":"How are Adtech Companies Preparing for a Cookieless World?","Source":"Nasdaq","Summary":"Cookies have been around for decades. In the mid-1990s, advertising cookies were created to collect data on users so that advertisers could place targeted ads on screens. These cookies did not focus on privacy, and they could track a consumers' data."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1077006abcd9a63e3a746038c72d1719c2e31f4fbd0e30207d871e412fcf720c"}
{"Ticker":"MSFT","Date":1642400446,"Headline":"The Capital Sponge","Source":"SeekingAlpha","Summary":"We discuss the factors that led to strong US stock market performance in recent years. Check out the factors that could cause this trend to run out of steam."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=67f4e69beb076ac6161b837b69721f6d1012cdbaf247a2d25345d772efd79abc"}
{"Ticker":"MSFT","Date":1642400400,"Headline":"Is WisdomTree U.S. LargeCap Dividend ETF (DLN) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"Launched on 06\/16\/2006, the WisdomTree U.S. LargeCap Dividend ETF (DLN) is a smart beta exchange traded fund offering broad exposure to the Style Box - Large Cap Value category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11b5faf30dcb3bc38b0dc2f08c6e813504574dde2f0b6bec7bc142421269e637"}
{"Ticker":"MSFT","Date":1642550327,"Headline":"Microsoft deal to deliver $390 million payday for Activision's embattled CEO","Source":"Yahoo","Summary":"Activision Blizzard Inc's Chief Executive Officer Bobby Kotick has gone from defending his handling of sexual harassment and discrimination claims at the video game maker to preparing to walk away with a windfall of at least $390 million.  The 58-year-old executive stands to receive the payday after clinching a deal on Tuesday to sell Activision to Microsoft Corp for $68.7 billion, but the vast majority will come from the 3.95 million Activision shares he owns, regulatory filings show.  He will miss out on a change of control payment because he doesn't own any unvested equities, which is uncommon for public company CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bf13602f3d227fdb045aea0c177c3f6f682a51f2c638b6d96565eaa612c3f2dc"}
{"Ticker":"MSFT","Date":1642550069,"Headline":"Microsoft deal to deliver $390 mln payday for Activision's embattled CEO","Source":"Yahoo","Summary":"Activision Blizzard Inc's Chief Executive Officer Bobby Kotick has gone from defending his handling of sexual harassment and discrimination claims at the video game maker to preparing to walk away with a windfall of at least $390 million.  The 58-year-old executive stands to receive the payday after clinching a deal on Tuesday to sell Activision to Microsoft Corp for $68.7 billion, but the vast majority will come from the 3.95 million Activision shares he owns, regulatory filings show.  He will miss out on a change of control payment because he doesn't own any unvested equities, which is uncommon for public company CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b629126bb14f00ab6ad1453be111153e613bb945415bdc0d69c4136d2c1ed8e"}
{"Ticker":"MSFT","Date":1642548900,"Headline":"Microsoft’s Activision Buy Highlights Push Toward Mobile, Metaverse","Source":"Yahoo","Summary":"Shares in companies such as Electronic Arts and Ubisoft rose following the disclosure of the planned deal, as investors placed bets on the rapidly consolidating videogame industry."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de930bad438d4bfb0a8b9f06c398187111480dd22a11b9d45a5f3ce7fcefe54b"}
{"Ticker":"MSFT","Date":1642548138,"Headline":"Activision Blizzard Trades At A 13% Discount To Microsoft's Purchase Offer; Expect That Gap To Partially Close Soon","Source":"SeekingAlpha","Summary":"Activision Blizzard (ATVI) received an offer from Microsoft for $95\/share. It closed at $82.31, a 13% discount to this offer. This gap may partially close soon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dea239e8aa94dc83a52256b889fcdcf9e16e58a6fc5a804883c1c53590e54a10"}
{"Ticker":"MSFT","Date":1642546080,"Headline":"Microsoft to Buy Activision Blizzard in All-Cash Deal Valued at $75 Billion","Source":"Yahoo","Summary":"After the all-cash deal valued at about $75 billion closes, Activision CEO Bobby Kotick is expected to leave the videogame heavyweight that has been roiled by claims of workplace misconduct."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=df8edaf120c1b41e9360fac95c077b67537a208e51d2d2642029f9a38e3b24d1"}
{"Ticker":"MSFT","Date":1642545490,"Headline":"Parkside Investments, LLC Buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, ...","Source":"Yahoo","Summary":"Investment company Parkside Investments, LLC (Current Portfolio) buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, Penn National Gaming Inc, Element Solutions Inc, sells Texas Instruments Inc, Citigroup Inc, Advanced Micro Devices Inc, VanEck Gold Miners ETF, JPMorgan Ultra-Short Income ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Parkside Investments, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bedee201d006d77e0a17fb17dd9344d4836516c0c5a00fcf76b5d0e4d00809f7"}
{"Ticker":"MSFT","Date":1642545488,"Headline":"TTP Investments, Inc. Buys ProShares Ultra S&P500, Amplify BlackSwan Growth & Treasury ...","Source":"Yahoo","Summary":"Investment company TTP Investments, Inc. (Current Portfolio) buys ProShares Ultra S&P500, Amplify BlackSwan Growth & Treasury Core ETF, Apple Inc, Amazon.com Inc, Microsoft Corp, sells BTC iShares MSCI USA Min Vol Factor ETF, ISHARES TRUST, ISHARES TRUST, ISHARES TRUST during the 3-months ended 2021Q4, according to the most recent filings of the investment company, TTP Investments, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3bc151e5c49c1ac957cc1b6a12f57ceb8507725ee057723a374c7e45a808ddc"}
{"Ticker":"MSFT","Date":1642544962,"Headline":"Microsoft Gaming makes big move into Los Angeles video game landscape","Source":"Yahoo","Summary":"The blockbuster deal will bring the L.A. video game industry’s largest company and one of its biggest tenants under new ownership."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49a6c5733711c396baebe919654499f233b1d465a71dccc065decd1906c1eb5a"}
{"Ticker":"MSFT","Date":1642543570,"Headline":"3 Large-Cap Stocks to Buy at Discounts Before Earnings","Source":"Yahoo","Summary":"We dive into three large-cap stocks from three totally different sectors poised to grow for years, if not decades to come that might be worth buying at discounts ahead of earnings..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=74e2044371f511b2492300befa93ba4f8f272b37e578464e216e3dc4134e4ed3"}
{"Ticker":"MSFT","Date":1642543147,"Headline":"Microsoft’s purchase of Activision Blizzard gives it the clear lead in the metaverse","Source":"Yahoo","Summary":"Microsoft's purchase of Activision Blizzard is a major step for its metaverse ambitions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1fd3d5483be44566cd3d09b9b29da73b0b68dcd0617c74ca8b99f85c607c562"}
{"Ticker":"MSFT","Date":1642542840,"Headline":"GLOBAL MARKETS-Asia shares drop as Treasury yields hit fresh highs","Source":"Nasdaq","Summary":"Asia's share markets struggled on Wednesday as U.S. Treasury yields hit fresh two-year highs and a global technology stock sell-off unsettled investors worrying about inflation and bracing for tighter U.S. monetary policy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b8119b64182a0e3c0b3c0c5a6fbaa53193c145f8463be692bd300d30b43920df"}
{"Ticker":"MSFT","Date":1642542804,"Headline":"Microsoft’s Activision Deal Set to Test Biden’s Antitrust Regime","Source":"Yahoo","Summary":"(Bloomberg) -- Less than three weeks into 2022, President Joe Biden’s antitrust regime is facing its first big test of the year. Microsoft Corp.’s $69 billion all-cash takeover of Activision Blizzard Inc. brings together two major gaming platforms in a deal that directly affects consumers -- and could also raise grievances among some of the tech giant’s biggest rivals.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward O"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e76dd52da6bc0a8c1f54349d40d0c11f4d04cb45fdc07cbf6bf61bfc8ad1b31"}
{"Ticker":"MSFT","Date":1642540395,"Headline":"Microsoft Buys Activision: 3 Reasons Why The Deal Makes Sense","Source":"SeekingAlpha","Summary":"Microsoft has agreed to acquire gaming company Activision Blizzard for $69 billion. Read why I believe the deal makes sense for Microsoft shareholders."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=725020454ebf175a7f0a540738cd2027d74f10db71133fe2c060e486d81bfb94"}
{"Ticker":"MSFT","Date":1642540320,"Headline":"Japanese shares track Wall Street lower; Toyota, Sony decline","Source":"Nasdaq","Summary":"Japanese shares fell on Wednesday, dragged down by Sony Group, Toyota Motor and other market heavyweights, tracking Wall Street's weak finish overnight."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=972434518586f22861c307cce4f65005e307e6ac97eb53c7f4fab5df3e83e227"}
{"Ticker":"MSFT","Date":1642540260,"Headline":"Activision Blizzard’s Workplace Problems Spurred $75 Billion Microsoft Deal","Source":"DowJones","Summary":"After a California lawsuit and a Wall Street Journal report, the company’s stock was falling, board members were getting anxious—and the tech giant was ready to take a gamble."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=99d05523945e05c319d76f08d07e64fc02552ec0f61d703748abf66ccec35b01"}
{"Ticker":"MSFT","Date":1642538760,"Headline":"Sony shares fall sharply in Japan after news of Microsoft deal for Activision","Source":"MarketWatch","Summary":"Sony Group Corp. shares fell as much as 10% on Wednesday morning following news that Microsoft Corp. agreed to buy videogame heavyweight Activision Blizzard..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e584b7f1baf68227270cc64bed0a1650e5b83d5fe1a22ef893fe6952496f2d3"}
{"Ticker":"MSFT","Date":1642536000,"Headline":"Microsoft’s Activision Deal May Bring ‘Metaverse’ to Enterprise Tech ","Source":"DowJones","Summary":"Videogames have already had an outsize influence on corporate technology in areas like cloud-computing, AI, virtual marketplaces and cryptocurrency. In a union of Microsoft and Activision, much more would be on the way, analysts say. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4513ce6fdecbd58f258cd4a565cc3f44bdfb06004aa2beec57221366f1e5f7d"}
{"Ticker":"MSFT","Date":1642534844,"Headline":"Simpson Thacher, Skadden drafted for Microsoft’s $69 billion Activision buy","Source":"Reuters","Summary":"Microsoft Corp. has turned to Simpson Thacher & Bartlett as lead adviser on its $68.7 billion deal to acquire \"Call of Duty\" maker Activision Blizzard Inc., which is working with Skadden, Arps, Slate, Meagher & Flom on the deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ee973e44a128ca9572d1c51799d6333db3b9fcbb48338062a44e8f85f296d687"}
{"Ticker":"MSFT","Date":1642533840,"Headline":"Sony slides 9% as Microsoft gaming deal casts shadow","Source":"Nasdaq","Summary":"Shares in Japan's Sony Group fell 9% on Wednesday after gaming rival Microsoft said it will buy developer Activision Blizzard in a record $68.7 billion deal for the industry."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a006764ae21fe550f1a29036d22e2cafbd6a898eaa140dea232cdbd4165bb8b4"}
{"Ticker":"MSFT","Date":1642533300,"Headline":"Microsoft faces battle for Activision deal, especially if 'Call of Duty' is destined for Xbox exclusivity","Source":"MarketWatch","Summary":"Microsoft Corp. has in the last few years gotten a bit of an anti-competitive pass from U.S. regulators, after its long legal battle with the Justice..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fbc612c8e86e43d4d4c0a765e83f7da028f895cd95f9bcf761a60620f47d1ea1"}
{"Ticker":"MSFT","Date":1642531080,"Headline":"Why Apple Sank Along With the Stock Market Today","Source":"Nasdaq","Summary":"What happened\nTypically one of the better-performing stocks, Apple (NASDAQ: AAPL) couldn't escape the bear's claws on Thursday. For once, it wasn't the big tech company hitting the headlines that day. This, combined with a disquieting news item on the legal front, pushed the comp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=98828b6fe45c6cf2f4091920755c691378d2c0e8ded2b83d2fa4598d7c42c7bb"}
{"Ticker":"MSFT","Date":1642528623,"Headline":"ALERT: Rowley Law PLLC is Investigating Proposed Acquisition of Activision Blizzard Inc.","Source":"Finnhub","Summary":"NEW YORK, Jan. 18, 2022 \/PRNewswire\/ -- Rowley Law PLLC is investigating potential securities law violations by Activision Blizzard Inc. and its board of directors concerning the proposed... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=023e2714b01953cd9b91736d9518869e040c5467499f80b205f2ec99712349ee"}
{"Ticker":"MSFT","Date":1642528080,"Headline":"WSJ News Exclusive | Microsoft to Buy Activision Blizzard in All-Cash Deal Valued at $75 Billion","Source":"DowJones","Summary":"After the all-cash deal valued at about $75 billion closes, Activision CEO Bobby Kotick is expected to leave the videogame heavyweight that has been roiled by claims of workplace misconduct."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=702b1df4dcfcaada23180e283c8babb2b27d2dd4129d8d392702ad24c2933c04"}
{"Ticker":"MSFT","Date":1642527780,"Headline":"This Storage Unit Stock Has A Better 1-Year Return Than Microsoft, Apple, Starbucks And Moderna","Source":"Benzinga","Summary":"Public Storage (NYSE: PSA) helps organize and store your belongings, and over the past year delivered astonishing returns.\nSince January 2021, Public Storage ..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=807e5f38450421352349dd3b56c246eed8e88d253e228b44e49feafcf12a0dd6"}
{"Ticker":"MSFT","Date":1642526458,"Headline":"Microsoft: Adding Some Activision Blizzard","Source":"SeekingAlpha","Summary":"Microsoft announced a big deal - an acquisition of Activision Blizzard. Read why I think, even with the deal, MSFT stock is not attractive just yet."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=672913fa83fc503344bf7a4681ac00341a27d2ac1a3817ca59cb77f60f41a6a7"}
{"Ticker":"MSFT","Date":1642525620,"Headline":"4 Top Stock Trades for Wednesday: ARKK, ATVI, AMC, BAC","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=037799d9762e5d79872ca2b833fc74350212e5d64c648fdf81e39bc0cb0b9a09"}
{"Ticker":"MSFT","Date":1642524740,"Headline":"Microsoft : What does ‘open' mean to you? Learn more about Microsoft's commitment at Azure Open Source Day Feb. 15","Source":"Finnhub","Summary":"In the world we live in today, almost every announcement has the word \"open\" in it. Unfortunately, it feels like there are as many definitions of what \"open\" means... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d5d2a1626fb16536ed0abeb6c8ad7a0578a012e2cdcc07ae0866c6a5c5d0aeef"}
{"Ticker":"MSFT","Date":1642524480,"Headline":"Will the Microsoft-Activision Deal Get Done? Wall Street Gives It Just a 60% Chance.","Source":"MarketWatch","Summary":"Takeover arbitrageurs are cautious given the antitrust scrutiny the proposed $68.7 billion acquisition will likely receive."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=32f89a117d29ab4cf230be867b9e164cab5979ebcf589cc8d0bcda39633887ac"}
{"Ticker":"MSFT","Date":1642524300,"Headline":"Himax (HIMX) Introduces TV TCON Chip for the Gaming Market","Source":"Nasdaq","Summary":"Himax Technologies HIMX announced the breakthrough launch of an industry first, 288 Hz 8K TV timing controller (TCON) solution for the ultra-high-resolution 8K gaming market.The breakthrough chip has been developed in collaboration with world-class panel leaders. The TCON"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=28760967c33d1cfcd0bd4381533c427d3847b4983f4561c4f55ed9f5989e973c"}
{"Ticker":"MSFT","Date":1642524180,"Headline":"Credo Technology Set to Go Public Next Week","Source":"MarketWatch","Summary":"The networking company plans to offer 25 million shares at $10 to $12 each."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=936fa0012876b681b2275d8cbff95be26521dee35f6c145da789b4b10775a40c"}
{"Ticker":"MSFT","Date":1642523520,"Headline":"Dow Drops More Than 500 Points Ahead of Blue-Chip Earnings","Source":"Nasdaq","Summary":"All three major indexes started off the holiday-shortened week with steep losses, dragged lower by surging bond yields and more disappointing bank earnings. The Dow secured its third-straight triple-digit drop and the tech-laden Nasdaq logged its first close below the 200-day m"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17780f1f11c93f84439b7f9f3e3ebeb4e393c99c7be1d09e2fb0bfa06a637cdc"}
{"Ticker":"MSFT","Date":1642523460,"Headline":"Microsoft Corp. stock underperforms Tuesday when compared to competitors","Source":"MarketWatch","Summary":"Shares of Microsoft Corp. slid 2.43% to $302.65 Tuesday, on what proved to be an all-around rough trading session for the stock market, with the S&P 500..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d9ef15f7b66d6e55eaa82c95f433d1ecf0ceb0c2c7d2709cc3e1bdaaa8cf38b7"}
{"Ticker":"MSFT","Date":1642523312,"Headline":"'Call of Duty' part of Activision sale to Microsoft","Source":"Reuters","Summary":"Microsoft is set to acquire Activision Blizzard -- publisher of Call of Duty -- for $68.7 billion in an all-cash deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=63435a44dc1b57813858ee128c452d30951bdc5355b05affd9f092a7703f02e3"}
{"Ticker":"MSFT","Date":1642523280,"Headline":"Activision’s Embattled CEO Is Already Complicating Microsoft’s Acquisition","Source":"MarketWatch","Summary":"The confusion around Kotick's future role adds one more unknown to a merger that is sure to get significant scrutiny in the months to come."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0924ff6c8b0cf96412cb32969f897e11964267b0868612e6738cbc364ec53e9"}
{"Ticker":"MSFT","Date":1642523160,"Headline":"US STOCKS-Wall St sinks as yields spike, financials fall after Goldman miss","Source":"Nasdaq","Summary":"Wall Street's main indexes fell sharply on Tuesday as weak results from Goldman Sachs weighed on financial stocks and tech shares continued their sell-off to start the year as U.S. Treasury yields rose to milestones."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b00d8d266707dc77de20cfc86e8ba475749e83c29eee69ad1ed0b6a764c846d7"}
{"Ticker":"MSFT","Date":1642522560,"Headline":"Activision CEO stands to reap nearly $400 million in Microsoft deal, and that may be just the start","Source":"MarketWatch","Summary":"Activision Blizzard Inc. Chief Executive Bobby Kotick stands to make nearly $400 million from Microsoft Corp.'s acquisition of the videogame maker, and could..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c6527030a325fedb91e19ca0341b3d32587d3acd3e7e8b9ce50ba21ef4458af"}
{"Ticker":"MSFT","Date":1642521480,"Headline":"Technology Sector Update for 01\/18\/2022: MTTR,PLXS,MSFT,ATVI,CYBR","Source":"Nasdaq","Summary":"Technology stocks added to their midday declines, with the SPDR Technology Select Sector ETF (XLK) Tuesday slipping 2.3% this afternoon while the Philadelphia Semiconductor Index was sinking 4.1% this afternoon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2ea435a3df6114fbd354d632b4ac084dd40532fee0f99bb66053cf5f81588e51"}
{"Ticker":"MSFT","Date":1642520940,"Headline":"Microsoft’s Activision Bid Is a Hit With Wall Street. Here’s What Analysts Are Saying.","Source":"MarketWatch","Summary":"Microsoft's proposed $68.7 billion acquisition of Activision Blizzard has analysts cheering, but there is concern the deal could be blocked."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3dabcf53b18c6a860987f0d928d88d0b302bbe0adc8ea506701d4f00bda3eedf"}
{"Ticker":"MSFT","Date":1642520640,"Headline":"Microsoft-Activision Deal Likely to Face Close Antitrust Scrutiny ","Source":"DowJones","Summary":"The $75 billion acquisition will have to navigate a regulatory environment that has become less friendly to deal making, especially in the tech sector."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d47f71b901ae000e551753bf0d52898ffe4dd73111851959e0e359c1db274f5a"}
{"Ticker":"MSFT","Date":1642520535,"Headline":"11 Good And 4 Bad Reasons To Keep Holding ARK Invest","Source":"SeekingAlpha","Summary":"The few who bought ARKK before its rise should hold. The majority who bought at the 02\/2021 peak risk long-term losses. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23bcddbc25c54143d05baa8072462efc36f978882b3d87ab2cc834af4ac9fa0c"}
{"Ticker":"MSFT","Date":1642519800,"Headline":"Microsoft could have just kicked off a Big Tech gold rush, which helps videogame stocks but maybe not gamers","Source":"MarketWatch","Summary":"Microsoft Corp.'s agreement to buy Activision Blizzard Inc. would be the largest tech acquisition ever, and the chance it could prompt other Big Tech names..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=32098cdb367faf1654425bd99bc3124e8ab013b46e04c424eb92dfff9e91ed73"}
{"Ticker":"MSFT","Date":1642519740,"Headline":"9 Great Growth ETFs for 2022 and Beyond","Source":"Nasdaq","Summary":"There's a bit of uncertainty on Wall Street to start 2022. The market continues to grapple with the lingering impacts of coronavirus and the risk of interest-rate increases disrupting the natural order of things. Thus, growth stocks – and by extension, growth exchange-tra"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=21c47f5919b382797b999c956da2403ab237a8829329f5784e046429e1f63bf1"}
{"Ticker":"MSFT","Date":1642519380,"Headline":"Noteworthy Tuesday Option Activity: MSFT, SI, OPRX","Source":"Nasdaq","Summary":"Among the underlying components of the Russell 3000 index, we saw noteworthy options trading volume today in Microsoft Corporation (Symbol: MSFT), where a total of 329,884 contracts have traded so far, representing approximately 33.0 million underlying shares.  That amounts to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c32fbec0c92c1e224bf5748b22862f9dd78190c7f7ba49c3577a9788494ca954"}
{"Ticker":"MSFT","Date":1642516440,"Headline":"Mergers Are Booming. U.S. Regulators Are Gearing Up to Crack Down on Them.","Source":"MarketWatch","Summary":"The Justice Department and the Federal Trade Commission are worried about competition. How companies are skirting the scrutiny and why."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d72d44d3a7fef6cb1a26da419ebb56377df1c83584e4e2e952898d512cd06188"}
{"Ticker":"MSFT","Date":1642516202,"Headline":"Microsoft Corporation's (MSFT) CEO Satya Nadella on Microsoft and Activision Blizzard Conference Call (Transcript)","Source":"SeekingAlpha","Summary":"Microsoft Corporation (NASDAQ:MSFT) Microsoft and Activision Blizzard Conference Call January 18, 2022 9:00 A.M."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bc322c1030d47b38b0d48407cbf4bb229615c1de97bb43a858b1eaecac4d76e5"}
{"Ticker":"MSFT","Date":1642515900,"Headline":"Gaming Stocks Alert: Why Are ATVI, RBLX, EA, TTWO Stocks Leveling Up Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3ceade25edd23e97a87c4440dbb59fded081deffb763d339e8ee1e1b41f3d6c3"}
{"Ticker":"MSFT","Date":1642515240,"Headline":"Wall Street tumbles as yield spike hits tech, banks slump after Goldman miss","Source":"Nasdaq","Summary":"Wall Street's main indexes fell sharply on Tuesday as weak results from Goldman Sachs weighed on financial stocks and tech shares continued their sell-off to start the year as U.S. Treasury yields rose to milestones."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4685584dfddff3b88622bc3faca5ac5e8d9819408f68a450749f81082f8b2cb4"}
{"Ticker":"MSFT","Date":1642515159,"Headline":"The Greatest Deal Of The Video Game Industry","Source":"SeekingAlpha","Summary":"Microsoft's announcement of $68.7 billion acquisition of Activision generates unique value, as the deal gives rise to a behemoth. Read moire on ATVI stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f69c5fc851d9b020ed834fa6fa0a5f871b85a0291ca17e355a1361a505563b7e"}
{"Ticker":"MSFT","Date":1642513680,"Headline":"Why You Should Invest in Dividend Growth ETFs Now","Source":"Nasdaq","Summary":"Major indexes have been on a roller coaster since the start of 2022 as investors are concerned about higher inflation, rising rates and the fast-spreading Omicron variant."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11a659e985dd1c53cc77322902bcc74525daa50ef141b9f5c67a1a9ccf9b3d4e"}
{"Ticker":"MSFT","Date":1642512840,"Headline":"Activision's Takeover Signals More Big Buys Ahead","Source":"Nasdaq","Summary":"The new week brought fresh declines on Wall Street, as stock investors once again struggled to deal with rising interest rates. The yield on the 10-year Treasury climbed above 1.8%, and while that's still extremely low by historical standards, the move was enough to send another"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5bbb3f3fdbadce25bb0cf77f9e5951e45f7c320810127c8aff7635dd98a57cd9"}
{"Ticker":"MSFT","Date":1642512660,"Headline":"Technology Sector Update for 01\/18\/2022: PLXS, MSFT, ATVI, CYBR","Source":"Nasdaq","Summary":"Technology stocks were falling hard again, with the SPDR Technology Select Sector ETF (XLK) Tuesday slipping 2.1% while the Philadelphia Semiconductor Index was dropping 3.6% this afternoon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3241be05a1802c206f803fb7294b18e215aa4a075b256b1a71b10c7a9c41212"}
{"Ticker":"MSFT","Date":1642512600,"Headline":"EXCLUSIVE-U.S. examining Alibaba's cloud unit for national security risks - sources","Source":"Nasdaq","Summary":"The Biden administration is reviewing e-commerce giant Alibaba's cloud business to determine whether it poses a risk to U.S. national security, according to three people briefed on the matter, as the government ramps up scrutiny of Chinese technology companies' dealings with U.S. firms."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d32f9baef1c4a4ac9b917ec0633080e177102623083898f5d97e8e4362f495dd"}
{"Ticker":"MSFT","Date":1642512405,"Headline":"Microsoft to buy Activision Blizzard in a deal at $68.7 billion","Source":"Reuters","Summary":"Microsoft Corp said on Tuesday it would buy videogame publisher Activision Blizzard in an all-cash transaction valued at $68.7 billion. (Reporting by Subrat Patnaik in Bengaluru; Editing by Anil D'Silva)"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b7c27cef5c7704cafe2583f8b8e5913c7d2d90a3e6b69b7413b5523e0ed3fa1c"}
{"Ticker":"MSFT","Date":1642512060,"Headline":"Market Update: Why Are Stocks Down Tuesday?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49b17bf9bca8a4d52fab428a901ac95f54ad30c74881ad88b6c4c9f999a1d9bc"}
{"Ticker":"MSFT","Date":1642511164,"Headline":"MICROSOFT CORP : Jefferies remains its Buy rating","Source":"Finnhub","Summary":"Brent Thill from Jefferies retains his positive opinion on the stock with a Buy rating. The target price is still set at USD 400. | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1669da9085e1285b331bd4556499d06154417aa4f06e68c6d0de45be536dd4f"}
{"Ticker":"MSFT","Date":1642511040,"Headline":"Microsoft Will Still Need to Do Activision’s Duty ","Source":"DowJones","Summary":"The opportunistic buyout of Activision is a huge bet on the future of videogame distribution—and on Microsoft’s cleanup abilities "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a124b2f42039c1d8d735bab78a477f8087de0ce1c572054a6eae6cf3b197ce95"}
{"Ticker":"MSFT","Date":1642510620,"Headline":"Microsoft Buys Activision With One Eye on the Cloud","Source":"Nasdaq","Summary":"Long-suffering shareholders — not to mention canny value investors — were rewarded for their patience in Activision Blizzard (ATVI, $65.39) Tuesday when Microsoft (MSFT, $310.20) agreed to pay $68.7 billion, or $95 a share in cash, for the troubled video game publis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3b4ba8345d73cab5c70dd57a2d5b50d11fdb28c62a8bb9745d9fb872afc86a2"}
{"Ticker":"MSFT","Date":1642510380,"Headline":"Microsoft’s Activision deal has on virtual goggles","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     Microsoft Chief Executive Satya Nadella’s deal to splash out $69 billion for Activision Blizzard makes a lot of sense, virtually. The software giant is paying a huge premium for its gaming rival, which sh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a004aaa228057fef0f0d124ad7b7237367395dd041d6dbb0d1c264b9ba1a5f74"}
{"Ticker":"MSFT","Date":1642510200,"Headline":"Why Activision Blizzard Stock Jumped Today","Source":"Nasdaq","Summary":"What happened\nMicrosoft (NASDAQ: MSFT) is buying top video game maker Activision Blizzard (NASDAQ: ATVI) in an all-cash deal worth $68.7 billion. This will bring some of the industry's biggest gaming properties together under one corporate roof, marrying Activision Blizzard's pop"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=460151c3c0b5bca1c1c66d4935aca3148b232e7194f1fd2be8129aa0e24760f5"}
{"Ticker":"MSFT","Date":1642509911,"Headline":"Is Microsoft Stock A Buy Or Sell Before Upcoming Earnings?","Source":"SeekingAlpha","Summary":"Microsoft is expected to release Q2 FY22 earnings on January 25, 2022. Investors are expecting another strong showing. See if MSFT stock is a buy or sell."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=09718aa1928f96945e18a63ca1b243523ae5deb1d5bbb4a8024ed11605c81a1e"}
{"Ticker":"MSFT","Date":1642509120,"Headline":"Could Microsoft Make 'Call Of Duty' An Xbox Exclusive? 3 Scenarios To Consider","Source":"Benzinga","Summary":"Microsoft Corporation (NASDAQ: MSFT) announced Tuesday morning plans to buy Activision Blizzard, Inc (NASDAQ: ATVI) for nearly $70 billion in an all-cash deal. Following the..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e9f5a509ebac1ce8e2e230ce0bbebf9607cb1fa49c03e49cf729a02a9ff2d32b"}
{"Ticker":"MSFT","Date":1642508580,"Headline":"Microsoft Is About to Get a Close Look From Regulators. Its Free Pass Is Over.","Source":"MarketWatch","Summary":"Microsoft has avoided regulatory scrutiny in recent years. But its agreement to buy Activision Blizzard for $69 billion casts a new spotlight on the software..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2878b562363dc91cb462de16453d5568622e3170a39e3cacad97b7edf6c55c34"}
{"Ticker":"MSFT","Date":1642508580,"Headline":"US STOCKS-Wall St falls on tech drag; GS profit miss triggers bank selloff","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as Goldman Sachs led declines among banks after posting its quarterly profit below expectations, while big technology stocks were slammed by rising Treasury yields."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89bc5965db689e0b8bca9ab7e9f8e71c8249f8107b4879fa9cd43f1d83d8d006"}
{"Ticker":"MSFT","Date":1642507814,"Headline":"Microsoft : Introducing the new Windows 11 device portfolio for education","Source":"Finnhub","Summary":"As we enter the third year of the pandemic, we continue to see many bright spots of innovation and perseverance in today's education landscape. While we recognize the value technology... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c3e1713ef10ac19094ca7b5122f5b3a0d2abe17ef76c2f123c728e5ddd319ab5"}
{"Ticker":"MSFT","Date":1642506049,"Headline":"Microsoft Takes Out Activision: Everything You Need To Know","Source":"SeekingAlpha","Summary":"Microsoft will acquire Activision Blizzard for $95 per share. Learn more about this acquisition and its impact on both MSFT and ATVI stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5bc1bb269210c63d52232bf54dbc252f12808b569718fb9344e7dadd83a0961f"}
{"Ticker":"MSFT","Date":1642505280,"Headline":"DWAC Stock: What Digital World Acquisition Bulls Are Saying as Share Climb Today","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=297065d67ae33441913ef7b0c7b833342c55d89ab7a0e1c3829282cfac80be9f"}
{"Ticker":"MSFT","Date":1642504620,"Headline":"Activision Blizzard Stock News: 8 Things to Know About Microsoft’s Big Gaming Buy","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bd036e281674b793cadc6768c9017abc54315079e1b03ae24e36d7db94cb04c0"}
{"Ticker":"MSFT","Date":1642504620,"Headline":"Microsoft's Acquisition of Activision Creates a Contrarian Trade Opportunity for Investors","Source":"Nasdaq","Summary":"One of my favorite plays is to look for stocks that have come under pressure and dropped significantly, but where a case can be made that the move was either overdone or that the problem that caused the decline was over or ending."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=384ea03c58fb444975beb0964b0b0b2a503f70d197967c50339e1d0e3abc17fb"}
{"Ticker":"MSFT","Date":1642504500,"Headline":"4 GARP Stocks for a Winning Portfolio","Source":"Nasdaq","Summary":"Investors on the lookout for stocks with the potential for maximum growth and value investing may consider the growth at a reasonable price or GARP strategy.This popular strategy helps investors gain exposure to stocks with impressive growth prospects that are trading at"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5085fde2300aac49e052183f37fe0b2d8f659eded404b5f7f23a41a8a7d92057"}
{"Ticker":"MSFT","Date":1642504260,"Headline":"Microsoft (MSFT) Set to Buy Activision, Expands Gaming Footprint","Source":"Nasdaq","Summary":"Microsoft's MSFT gaming ambitions are well known. The company is now making a major push into the video game space with the just-announced plan of acquiring Call of Duty maker Activision Blizzard ATVI.Microsoft will be paying $95.00 per Activision share, with total transa"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f76c9b031e4a42938d54fc65e3daaa0046180a8e11dfd30828ff68968684ee3"}
{"Ticker":"MSFT","Date":1642502940,"Headline":"VTI, MSFT, TSLA, GOOGL: ETF Inflow Alert","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Vanguard Total Stock Market ETF (Symbol: VTI) where we have detected an approximate $4.9 billion dollar inflow -- that's a 1.7% increase week over w"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e71b33535da36cda57cfcb86ab78458d3090b55d90f0f50938c99e8d4d660019"}
{"Ticker":"MSFT","Date":1642502940,"Headline":"SPYG, CSML: Big ETF Outflows","Source":"Nasdaq","Summary":"Looking at units outstanding versus one week prior within the universe of ETFs covered at ETF Channel, the biggest outflow was seen in the SPDR Portfolio S&P 500 Growth ETF, where 9,500,000 units were destroyed, or a 4.2% decrease week over week.  Among the largest underlyi"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5893e3b9fd825d3b78b2810d68ce2594d7228b839078179d961ba62e4463351"}
{"Ticker":"MSFT","Date":1642502760,"Headline":"Yield on U.S. 10-Year Treasury Note Hits 2-Year High","Source":"Nasdaq","Summary":"Pre-market futures emerge from a dormant three-day weekend (commemorating Martin Luther King’s birthday Monday) with a sharp downturn in index activity: the Dow is -310 points at the hour, the Nasdaq -250 and the S&P 500 is -50 points. This continues the downward slop"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6cf4b487a5610dc1f47d7c72ae7ef12cf0fcda503b511ee3a30748925e2ff88d"}
{"Ticker":"MSFT","Date":1642501800,"Headline":"2 Promising New Growth Stocks to Watch in 2022","Source":"Nasdaq","Summary":"Are you looking for the next big growth stock? If so, then two names you'll want to keep a close eye on this year are Babylon Holdings (NYSE: BBLN) and Matterport (NASDAQ: MTTR). These stocks have been public for less than a year, but both could be intriguing investments to consi"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=84f2f90e6a1f2f32739ae0b68839690092a9c368ccb1833670b43cdb7608d548"}
{"Ticker":"MSFT","Date":1642501620,"Headline":"Markets Down, Activision Up on Microsoft Buyout","Source":"Nasdaq","Summary":"Tuesday, January 18, 2022Pre-market futures emerge from a dormant three-day weekend (commemorating Martin Luther King’s birthday Monday) with a sharp downturn in index activity: the Dow is -310 points at the hour, the Nasdaq -250 and the S&P 500 is -50 points. This co"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e1eb9340438f783bf74e521e1e14fd6d33b2c2ed1da921a4f1349cbc6b7d146"}
{"Ticker":"MSFT","Date":1642501560,"Headline":"Stock Market Today: Dow Jones, S&P 500 Tumbles Today; Activision Soars On Microsoft Acquisition; Goldman Sachs Dips On Profit Miss","Source":"Nasdaq","Summary":"Stock Market Today Mid-Morning UpdatesOn Tuesday, the Dow Jones Industrial Average is down by 500 points after Goldman Sachs (NYSE: GS) reported disappointing earnings and as government bond yields hit coronavirus-era highs. This comes after the markets were closed on Monday for"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=21363b3786763d90e02b904bd01a17fcd994d521c1cd9c0ad53afd9703980021"}
{"Ticker":"MSFT","Date":1642501511,"Headline":"Microsoft's $68.7 billion deal for Activision once again shows big tech's dominance over legacy media","Source":"CNBC","Summary":"Microsoft takes big $68.7 billion swing on video game company Activision Blizzard while legacy media stays on sidelines"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a5205c04e8f94f2b43d56a1755255b55dd0f87260fc875c098ba3919100852df"}
{"Ticker":"MSFT","Date":1642500720,"Headline":"US STOCKS-Wall St falls on tech drag; GS results trigger more bank declines","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as big technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17208323599ef5fd4929cb459d94f9b9378823d1ddc75fbf51c769ad93bf9290"}
{"Ticker":"MSFT","Date":1642500120,"Headline":"Here's How Much $100 Invested In Microsoft 10 Years Ago Would Be Worth Today","Source":"Benzinga","Summary":"Microsoft (NASDAQ:MSFT) has outperformed the market over the past 10 years by 13.17% on an annualized basis. \nBuying $100 In MSFT: 10 years ago, an investor could have purchased 3..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=59a1bebd3ac462cf74d5135ff7714f9db16d9a6f034a542586bc997eb73fc753"}
{"Ticker":"MSFT","Date":1642500013,"Headline":"Microsoft : Together with Activision Blizzard, we will usher in a new era of gaming that puts players and creators first and makes gaming safe, inclusive…","Source":"Finnhub","Summary":"Together with Activision Blizzard, we will usher in a new era of gaming that puts players and creators first and makes gaming safe, inclusive, and accessible to all. ... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9ed9f7a8f9e159ce2e7c92347bdfffe64c99c4d0b5185f71606ada28fa7b182d"}
{"Ticker":"MSFT","Date":1642500011,"Headline":"Microsoft : Today we reflect on Dr. Martin Luther King Jr.'s legacy of service, which endures as demonstration of the power and responsibility…","Source":"Finnhub","Summary":"Today we reflect on Dr. Martin Luther King Jr.'s legacy of service, which endures as demonstration of the power and responsibility each of us has to create a more inclusive world with our... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5717d584b587dee55745edf8f7a59cc597a36e68ed17b40b461d64eedc391dd3"}
{"Ticker":"MSFT","Date":1642499760,"Headline":"In The Spotlight - Big Wall Street Banks As The Main Power In SP500","Source":"Benzinga","Summary":"Stock investors are braced for what could be another volatile week as the Q4 earnings season heats up.\nBanks’ earnings\nBig Wall Street banks are in the spotlight right out..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dc2146decbac05c33e83ddfcbbcbe807714b58821a6cb17b4286c68edd73daeb"}
{"Ticker":"MSFT","Date":1642499424,"Headline":"Phil Spencer email to Xbox employees: RE: Bringing the joy and community of gaming to everyone","Source":"Finnhub","Summary":"From: Phil Spencer Sent: Tuesday, January 18, 2022 5:43 AM To: Gaming FTE Worldwide; Gaming Extended FTE Worldwide Subject: RE: Bringing the joy and community... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d3e14044a44c634371f73da0a34e665349c0c078276a56a9c21d0ee39fc30a44"}
{"Ticker":"MSFT","Date":1642499422,"Headline":"Satya Nadella email to employees: Bringing the joy and community of gaming to everyone","Source":"Finnhub","Summary":"From: Satya Nadella Sent: Tuesday, January 18, 2022 5:33 AM To: Microsoft - All Employees; All MS Store Employees FTE Subject: Bringing the joy and community of... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2c049c07eac93833f98ee9aaf209d8f72821bdf22d166595660d6ff7ee6a439a"}
{"Ticker":"MSFT","Date":1642498680,"Headline":"Activision, Apple, Tesla, Goldman Sachs: What to Watch When the Stock Market Opens Today","Source":"DowJones","Summary":"Activision Blizzard shares soared on a deal with Microsoft; Goldman Sachs reported a profit drop."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b50371d5c8f11c3e6763b5f3a1dcea2391196f90682d10be5f50975ac1d86dd"}
{"Ticker":"MSFT","Date":1642498320,"Headline":"TELUS (TU) Launches Low-Cost Internet Plans for Senior Citizens","Source":"Nasdaq","Summary":"Communications technology company TELUS Corporation TU recently launched affordable Internet plans for low-income senior citizens across British Columbia and Alberta in Canada."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50b5126fdbcbe1642ad9e036af1d5997f648694ff98c7a27c8222e480b609041"}
{"Ticker":"MSFT","Date":1642498140,"Headline":"SAP Announces Share Buyback Authorization: Major Takeaways","Source":"Nasdaq","Summary":"SAP SE SAP floated a new up to €1-billion share repurchase authorization, which it will utilize to fund awards under the “Move SAP” share-based compensation scheme, going ahead."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8b7fc86868473de89d3e5fb5795bdbea42e4e6b759aebf1f2224521963d61c4"}
{"Ticker":"MSFT","Date":1642496880,"Headline":"US STOCKS-Tech tumble, lackluster GS earnings set to weigh on Wall Street","Source":"Nasdaq","Summary":"Wall Street's main indexes were set to open lower on Tuesday as technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among big banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49c6350d931ef7545f89df775f44860156485dea75f22f8526a173ce415d42fc"}
{"Ticker":"MSFT","Date":1642496880,"Headline":"Microsoft To Buy Activision Blizzard In $68.7 Bln Deal; Game Pass To Add Activision Blizzard Games","Source":"Nasdaq","Summary":"(RTTNews) - Microsoft Corp. (MSFT) said it plans to acquire Activision Blizzard Inc. (ATVI) for $95.00 per share, in an all-cash deal valued at $68.7 billion, inclusive of Activision Blizzard's net cash. The planned acquisition includes iconic franchises from the Activision, Bliz"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1e177ca4941582ce119afa5ebd653d50c801679dbf3d0005fdeea0779f78d571"}
{"Ticker":"MSFT","Date":1642496100,"Headline":"Technology Sector Update for 01\/18\/2022: MTTR, GENI, NFLX, MSFT","Source":"Nasdaq","Summary":"Technology stocks were retreating in the lead up to Tuesday's market open. The Technology Select Sector SPDR ETF (XLK) declined 1.4% and the Semiconductor Sector Index Fund (SOXX) fell 1.4%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8702135d8d19a80205c7189afe33f052cf59a6d64b933b7319f76068c3f39c67"}
{"Ticker":"MSFT","Date":1642495924,"Headline":"MICROSOFT CORP : Regulation FD Disclosure, Financial Statements and Exhibits (form 8-K)","Source":"Finnhub","Summary":"Item 7.01 Regulation FD Disclosure.On January 18, 2022, Microsoft Corporation issued a press releaseannouncing that it had entered into a definitive agreement pursuant to whichMicrosoft will... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6ea54d6aae42b6122da9ed80c5023cf05ca3eea111e05b837a66f51921ece6b0"}
{"Ticker":"MSFT","Date":1642495740,"Headline":"Consumer Sector Update for 01\/18\/2022: ATVI, MSFT, UL, KSS, WMT","Source":"Nasdaq","Summary":"Consumer stocks were in the decline ahead of Tuesday's opening bell as the Consumer Staples Select Sector SPDR Fund (XLP) was 0.2% lower while the Consumer Discretionary Select Sector SPDR Fund (XLY) dropped 1.5%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=822e5cfba13fe9037064a18da3d1bc2d5b901269826d79483efcf785265bdcda"}
{"Ticker":"MSFT","Date":1642495020,"Headline":"GLOBAL MARKETS-Nasdaq braced for beating as bond markets drive up costs","Source":"Nasdaq","Summary":"Nasdaq traders were braced for a fresh pounding on Tuesday as a seven-year high for oil prices drove up global borrowing costs to pre-COVID levels, with even sub-zero German Bund yields at the brink of positive territory again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46bfd7e196a853c8f1b00ad3cb5e0670092ce9d7f8b57012e30e7b375d012059"}
{"Ticker":"MSFT","Date":1642494660,"Headline":"Microsoft to buy Activision Blizzard for $68.7 billion","Source":"Nasdaq","Summary":"Microsoft Corp said on Tuesday it would buy videogame publisher Activision Blizzard for $68.7 billion in cash, the largest deal in the sector."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8bbda63d2126ac8d47498367fb33510157ecec15cbfd0bd7cd47fb37f868396a"}
{"Ticker":"MSFT","Date":1642490040,"Headline":"US STOCKS-Nasdaq futures tumble as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the technology-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c47f9d75ebed20fec74420657aa0c4bdde9232f249eaa14830e28966773d82a9"}
{"Ticker":"MSFT","Date":1642486620,"Headline":"Will AMD Be Worth More Than Apple by 2030?","Source":"Nasdaq","Summary":"Apple (NASDAQ: AAPL) is the world's largest company, with a market capitalization of $2.83 trillion, which is not surprising considering the impressive upside the stock has delivered over the past decade."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d38bd544bd53863bcca8fe9b52cdea8200185ed2750e72f4e428916d4a09a2b2"}
{"Ticker":"MSFT","Date":1642485600,"Headline":"Once Top-Ranked IBM’s Been Relegated Among the Second-Tier Outsourcers","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4bd4412129515712e3f499de667197b9af565684c315bf535e175b96db65833f"}
{"Ticker":"MSFT","Date":1642484348,"Headline":"UK self-driving startup Wayve raises $200 million to scale up technology","Source":"Finnhub","Summary":"British self-driving technology startup Wayve said on Tuesday it has raised $200 million from investors to scale up its autonomous driving technology globally and launch more pilot projects with... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9652ff51227bacec0512359422aa023039f8d2f793b113c98835afd80a6e04ff"}
{"Ticker":"MSFT","Date":1642482660,"Headline":"Dow ends more than 500 points lower as stocks sink amid rising Treasury yields and a Goldman earnings miss","Source":"MarketWatch","Summary":"All three major U.S. stock benchmarks end sharply lower Tuesday, with losses led by the technology-laden Nasdaq Composite Index, as the high-growth tech..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c2edcad7ab9f8499e4f9dd40cd0fd62a863a6b28793ddb9d55d92adc377c7f8"}
{"Ticker":"MSFT","Date":1642482120,"Headline":"US STOCKS-Nasdaq futures slump 2% as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the tech-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=87c9114e6bbcf1060c5fc561af38023b8e297269d7e07a4e2e6cbc1c8a27f885"}
{"Ticker":"MSFT","Date":1642464060,"Headline":"UK self-driving startup Wayve raises $200 mln to scale up technology","Source":"Yahoo","Summary":"British self-driving technology startup Wayve said on Tuesday it has raised $200 million from investors to scale up its autonomous driving technology globally and launch more pilot projects with commercial fleet partners.  The Series B funding round brings the startup's total fundraising to $258 million and includes new investments from venture capital firms D1 Capital Partners, Moore Strategic Ventures and Linse Capital, plus fresh capital from existing investors including Microsoft.  Making taxis autonomous has proved more difficult and expensive to develop than expected, but investors have been pumping money into self-driving technology for trucks and other commercial vehicles where automation could be viable sooner."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b4b495c05a684a7274ab7fb861cb2c7616b20924764f846499eef479d5f85b6"}
{"Ticker":"MSFT","Date":1642632273,"Headline":"World Bank chief takes swipe at Microsoft's $69 billion gaming deal as poor countries struggle","Source":"Reuters","Summary":"World Bank President David Malpass on Wednesday criticized Microsoft's $69 billion takeover of gaming developer Activision Blizzard as a questionable allocation of capital at a time when poor countries are struggling to restructure debts and fight COVID-19 and poverty."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b3f0101827ebee41a4a3511040c3ef036cf9d139cda7dd1c0fd13cbc219d93c"}
{"Ticker":"MSFT","Date":1642631910,"Headline":"Belmont Capital, LLC Buys Compass Inc, Amazon. ...","Source":"Yahoo","Summary":"Investment company Belmont Capital, LLC (Current Portfolio) buys Compass Inc, Amazon.com Inc, Microsoft Corp, UnitedHealth Group Inc, VanEck Gold Miners ETF, sells SoFi Technologies Inc, SoFi Technologies Inc, BlackRock MuniHoldings New Jersey Quality Fund Inc, Atlassian Corporation PLC, Adobe Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Belmont Capital, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=409f6a2abe89e890556760747cd997d8ab502c8423c55cd173345de3287d83bd"}
{"Ticker":"MSFT","Date":1642631903,"Headline":"Acas, Llc Buys Vanguard Extended Market Index ETF, Vanguard High Dividend Yield Indx ETF, ...","Source":"Yahoo","Summary":"Investment company Acas, Llc (Current Portfolio) buys Vanguard Extended Market Index ETF, Vanguard High Dividend Yield Indx ETF, iShares Russell 1000 ETF, Schwab International Equity ETF, FlexShares iBoxx 5-Year Target Duration TIPS Index, sells iShares S&P 500 Growth ETF, iShares S&P 500 Value ETF, Amazon.com Inc, First Trust Long\/Short Equity ETF, Schwab U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff241adb91812b331d523b63d2e418fea4d9266aa9eb81c38f377c1d5ab108b9"}
{"Ticker":"MSFT","Date":1642630966,"Headline":"World Bank chief takes swipe at Microsoft's $69 bln gaming deal as poor countries struggle","Source":"Reuters","Summary":"World Bank President David Malpass on Wednesday criticized Microsoft's $69 billion takeover of gaming developer Activision Blizzard as a questionable allocation of capital at a time when poor countries are struggling to restructure debts and fight COVID-19 and poverty."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6cb6e15a352d4c9940c0271746ebe86dd9f632ca102da121837dd5aa83a92f93"}
{"Ticker":"MSFT","Date":1642623149,"Headline":"Dow Jones Reverses Gains, Trades Lower; Oil Prices Continue Higher As Yields Cool","Source":"Yahoo","Summary":"The Dow Jones Industrial Average traded choppily in today's stock market and reversed earlier gains to a loss of around 117 points."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=061159fe80ddb14c34e918aa44a21393adf2d29e366574e31744337f48b407bf"}
{"Ticker":"MSFT","Date":1642625400,"Headline":"Sony Stock Has Tumbled. Why Investors Are Worried About Microsoft’s Activision Deal.","Source":"Yahoo","Summary":"The PlayStation makes up some 30% of Sony's total sales. A Microsoft-Activision merger could put some of that business at risk."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=01a05d209ed1dc9e951697d645d234cb4dc74486ed60d3384e2fdbe92ffd90ff"}
{"Ticker":"MSFT","Date":1642624533,"Headline":"EXCLUSIVE-Google aims to improve spotty enforcement of children's ads policy ","Source":"Reuters","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search engine that should have been blocked under its efforts to comply with UK regulations..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46c942b5cea955428d60f4936324cea4dd54c13213a24c3563de515ba1d1db7e"}
{"Ticker":"MSFT","Date":1642620660,"Headline":"3 Key Questions About Microsoft’s Deal to Buy Activision, Answered","Source":"Yahoo","Summary":"Sony, Apple, and even GameStop may be among the casualties if the $69 billion gaming deal goes through. But the acquisition also faces challenges."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2e863393e70489d7d4cdfde8d69260bdc1df2d52ece551942df1fd963cfa409"}
{"Ticker":"MSFT","Date":1642619814,"Headline":"Metaverse barriers to entry are ‘rather high:’ CoinDesk Global Macro Editor","Source":"Yahoo","Summary":"With recent patent filings by Walmart suggesting that the major retailer may be joining the likes of Meta and Apple in embarking on a foray into metaverse technology, more consumers are now asking how they can access the virtual space themselves. According to CoinDesk Global Macro Editor TV Anchor Emily Parker, many obstacles remain for average consumers to access the metaverse."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1f441110c7beb95971d03faf5e79548ba65a1241f3ad1d6bc4eb29b5a18521a"}
{"Ticker":"MSFT","Date":1642619456,"Headline":"Why Microsoft's Activision Blizzard deal could be bad for gamers","Source":"Yahoo","Summary":"Microsoft is buying Activision Blizzard and that could mean fewer choices for gamers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bbab37b37e8dc6a09588b66e3a22504988e09a7e89232cab233f879b41de5dbb"}
{"Ticker":"MSFT","Date":1642619308,"Headline":"Microsoft's bid for Activision Blizzard comes with 2 big legal hurdles","Source":"Yahoo","Summary":"Microsoft’s (MSFT) largest-ever acquisition, a pending $68.7 billion all-cash purchase of gaming giant Activision Blizzard (ATVI), comes with distinct, and potentially significant, legal hurdles."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4319ec9d78a1d5723be3daf623469c79498dbf2c8ed9d9c945622211a7d522f"}
{"Ticker":"MSFT","Date":1642619243,"Headline":"Stock Market Trades Flat After Tuesday's Sell-Off; PG Stock And MSFT Gain","Source":"Yahoo","Summary":"The stock market traded flat after Tuesday's sell-off; Procter & Gamble and Microsoft jumped, and Rio Tinto led a group of mining stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=77545c00879305c8e4fff1bbd5ce103c2e14bbc9b3042d6f14eed2fac5a9d926"}
{"Ticker":"MSFT","Date":1642618093,"Headline":"Stocks Inch Higher, Oil's Rally Continues","Source":"Yahoo","Summary":"Financial news digest for Jan. 19 with stock, bond, cryptocurrency, and markets news. Breaking news on companies, earnings, and interest rates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=540b34a53978f111d2c8b8946302f7f2eb25dc897fe99ced3a5198d905153bf0"}
{"Ticker":"MSFT","Date":1642617840,"Headline":"Apple, Amazon, Disney Could Buy Game Makers EA, Take-Two","Source":"Yahoo","Summary":"Microsoft's  announcement that it is acquiring Activision  has caused a ripple effect across the gaming sphere, as the move could cause a run on big entertainment companies snapping up gaming studios.  Microsoft paid $75 billion for Activision, representing a potential 50% upside from the company's market cap.  A 50% premium on Electronic Arts' nearly $40 billion market cap would represent a $60 billion price tag."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0be107c15a58b7bcca103e33ab64fc26cbe4702e320c062422979c5f0ddf4bdc"}
{"Ticker":"MSFT","Date":1642617500,"Headline":"Hudson Capital Management LLC Buys JPMorgan Equity Premium Income ETF, Wells Fargo, Bank of ...","Source":"Yahoo","Summary":"Investment company Hudson Capital Management LLC (Current Portfolio) buys JPMorgan Equity Premium Income ETF, Wells Fargo, Bank of America Corp, Innovator U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bca4fc03ba678f91c680e9a1ec68aa99f7d039487e37ba197059307c99d58f4f"}
{"Ticker":"MSFT","Date":1642617493,"Headline":"Newbridge Financial Services Group, Inc. Buys Apple Inc, NVIDIA Corp, NXP Semiconductors NV, ...","Source":"Yahoo","Summary":"Investment company Newbridge Financial Services Group, Inc. (Current Portfolio) buys Apple Inc, NVIDIA Corp, NXP Semiconductors NV, Microsoft Corp, Tesla Inc, sells NIO Inc, Lemonade Inc, Alibaba Group Holding, Carnival Corp, Blackstone Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Newbridge Financial Services Group, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5f5aeb19afc80c073833a32488caaac29e6912afb4da8c2c1af9f76746f74a9"}
{"Ticker":"MSFT","Date":1642616365,"Headline":"If the Fed wanted to stop inflation, it would need to hike rates to nearly 6%: expert","Source":"Yahoo","Summary":"Interactive Brokers founder and chairman Thomas Peterffy has concerns about coming interest rate hikes from the Federal Reserve."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0612417d08d916ed1e581d049e95b9ef2972b85e4f9859d1ac8eb6f384540f5d"}
{"Ticker":"MSFT","Date":1642609870,"Headline":"Microsoft deal to deliver $390 million payday for Activision's embattled CEO","Source":"Reuters","Summary":"Activision Blizzard Inc's Chief Executive Officer Bobby Kotick has gone from defending his handling of sexual harassment and discrimination claims at the video game maker to preparing to walk away with a windfall of at least $390 million."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9dc7e7d8e6b78e526fa737e22c05b410e84ea6110552d75c1a3877643122d18"}
{"Ticker":"MSFT","Date":1642609860,"Headline":"Microsoft Corp. stock outperforms market on strong trading day","Source":"MarketWatch","Summary":"Shares of Microsoft Corp. inched 0.22% higher to $303.33 Wednesday, on what proved to be an all-around rough trading session for the stock market, with the..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f7be1baeb5eaf4761f1fcd45e7bad41f2ba85948e95ac5b3d38931cdf320118"}
{"Ticker":"MSFT","Date":1642608149,"Headline":"Microsoft Buys Activision? We Take Profit And Increase The Exposure At The Same Time","Source":"SeekingAlpha","Summary":"Nobody saw this coming, but Microsoft is making a huge move with its acquisition of Activision. Read more about MSFT & ATVI stock and this deal here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c919dfb1859caa084ae8413af4b69697b1543dea3f65fd3f9f16029911c08f6"}
{"Ticker":"MSFT","Date":1642606500,"Headline":"EXCLUSIVE-Google aims to improve spotty enforcement of children's ads policy","Source":"Nasdaq","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search engine that should have been blocked under its efforts to comply with UK regulations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=874c26e7ed9d813e5ad4525631d5371bd8d7a455222f8cc87ca37200e0955b74"}
{"Ticker":"MSFT","Date":1642605060,"Headline":"2 New Titles For Netflix Games: What Investors Need To Know","Source":"Benzinga","Summary":"Netflix Inc (NASDAQ: NFLX) announced Tuesday the company is expanding its mobile gaming lineup with the addition of two new games. \nWhat Happened: Netflix launched..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5582b71461697a2bb2ee003937f642987547d58e563f0b30dbf8649f64389b33"}
{"Ticker":"MSFT","Date":1642598640,"Headline":"Why Appian Stock Jumped 6% Higher This Morning","Source":"Nasdaq","Summary":"What happened\nIt's been a brutal year for Appian (NASDAQ: APPN) shareholders. After skyrocketing in value in 2020, the stock backtracked in 2021 and lost nearly 60% of its value. The slide has continued the first couple weeks of 2022 as high-growth stocks remain under pressure. B"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a28232496e089c077391c6fe343fcc0ef5afdc54508e5b2fed9ccab4f1854d4b"}
{"Ticker":"MSFT","Date":1642597320,"Headline":"Best Cheap Stocks To Buy Now? 5 Consumer Tech Stocks In Focus","Source":"Nasdaq","Summary":"5 Top Consumer Tech Stocks To Watch In The Stock Market TodayWith the stock market today seemingly on the decline, investors could be looking for stocks with pricing power. Accordingly, this would be where some of the top consumer tech stocks come into play. After all, these are"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1eb1ca2a7884a3747db537c9ea9fbaa98674c5c2e3f6969cd4f20919c3b9ba76"}
{"Ticker":"MSFT","Date":1642596911,"Headline":"Microsoft : How Dynamics 365 is helping build the retail supply chain of the future","Source":"Finnhub","Summary":"Earlier in 2021, we had discussed how retailers can create an intelligent supply chain to successfully navigate through the disruptions and quickly adapt to changing customer behavior.... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f221cce351a36f9ed23c455fc2680e3abbdd6a728f688bfd13de8a1f3257114e"}
{"Ticker":"MSFT","Date":1642595460,"Headline":"Microsoft’s Activision Blizzard Deal to Power Its Netflix-of-Gaming Aspirations","Source":"DowJones","Summary":"With its $75 billion deal for Activision Blizzard, Microsoft aims to shake up the gaming industry by building out its library of blockbusters and bolstering its efforts to entice consumers onto its cloud-gaming service."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6265412b913280dfda1d1e50965434cc58ef86ae0d9c9fd25acced755e8aa56d"}
{"Ticker":"MSFT","Date":1642595220,"Headline":"Oracle (ORCL) Cloud Selected by Xerox to Support New Ventures","Source":"Nasdaq","Summary":"Oracle ORCL recently announced that Xerox XRX has selected Oracle Cloud to support the launch of new businesses.The move will see Xerox capitalizing on Oracle’s expertise in cloud solutions to bring 3D Printing infrastructure to manufacturing, structural health monitoring"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=22dbca8096edab3750a813a3ca26b8263546d7ef1eccc0961413cc91abf00388"}
{"Ticker":"MSFT","Date":1642594920,"Headline":"The Activision Blizzard Deal Is a Welcome Change for Both Companies","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7be161af852c760002fb9bf891d8212853bddf583b059350cf0a954ad2ac2a7d"}
{"Ticker":"MSFT","Date":1642594860,"Headline":"Why Nvidia Stock Dropped Today","Source":"Nasdaq","Summary":"What happened\nAfter initially trading up on generalized enthusiasm or tech stocks (in the wake of yesterday's Microsoft-Activision Blizzard merger announcement), shares of semiconductor giant Nvidia (NASDAQ: NVDA) took a turn for the worse Wednesday, and are now down 2.6% as of 1"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8f6abf4347ee9d62c13e7a89136732a0c2a9f2697bc25a2d13840320286a90e4"}
{"Ticker":"MSFT","Date":1642594583,"Headline":"Yes, The Crash Will Probably Get Worse From Here","Source":"SeekingAlpha","Summary":"Most of the major stock averages are still down by fewer than 10%. Check out why we think the declines could continue and accelerate moving forward."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2d153acebfb19a972c9b0bc625886a2d6cb63fd097f6c561950a8700ddb471eb"}
{"Ticker":"MSFT","Date":1642593360,"Headline":"Procter & Gamble, Microsoft share gains contribute to Dow's nearly 50-point climb","Source":"MarketWatch","Summary":"The Dow Jones Industrial Average is trading up Wednesday morning with shares of Procter & Gamble and Microsoft seeing positive gains for the price-weighted..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd90d83377f86bc0e3f805af69af7f6d87424d6a4d47b20e53fe880048de0e05"}
{"Ticker":"MSFT","Date":1642592760,"Headline":"GameStop stock sinks toward 11-month low as Microsoft-Activision merger poses 'walled garden' risk","Source":"MarketWatch","Summary":"Shares of GameStop Corp. dropped toward their seventh-straight loss Wednesday, after Jefferies analyst Stephanie Wissink said the Microsoft-Activision merger..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=904d0fd432471d0282b7c32095c199a9ced563a229ba92d7001c78fde07bb0de"}
{"Ticker":"MSFT","Date":1642591455,"Headline":"Microsoft : donation to the Smithsonian Latino Center celebrates and supports community history and culture","Source":"Finnhub","Summary":"Today, Microsoft is honored to announce a $1 million donation to the Smithsonian Latino Center to support the new National Museum of the American Latino and the development of the... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f83c6e7253e7ae3c8499d087a140306b440b8de90cddd781b53eb8f3feb40c06"}
{"Ticker":"MSFT","Date":1642590900,"Headline":"5 ETFs to Cash in on Microsoft-Activision Deal","Source":"Nasdaq","Summary":"The world's largest software maker — Microsoft MSFT — has agreed to buy gaming giant Activision Blizzard ATVI for $68.7 billion. It will be the largest-ever merger in the tech space, eclipsing Dell's DELL purchase of EMC for $60 billion in September 2016.Following the new"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=100fc64519a976abadfd3b437fbb5b61949cf58dfb8ff15267947da5a2f99558"}
{"Ticker":"MSFT","Date":1642589340,"Headline":"Plexus (PLXS) Likely to Miss Q1 Guidance on Supply Chain Woes","Source":"Nasdaq","Summary":"Plexus Corp PLXS recently announced that it would be unable to meet its previously-provided (Oct 27, 2021) first-quarter fiscal 2022 revenue guidance of $825-$865 million and GAAP earnings outlook of $1.01 to $1.17 per share. The company noted that performance has been af"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5a478e29944799c28a9ff3ff8cdfdbbf7a29f6b1bd6bbb0f333ae780b387806"}
{"Ticker":"MSFT","Date":1642589181,"Headline":"Microsoft: Activision, Azure, And Why It's Worth Every Penny","Source":"SeekingAlpha","Summary":"Microsoft is a best-of-breed software company whose competitive position looks as strong as ever. Read why the current valuation of MSFT stock seems reasonable."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=563249cd5a56b690a9acc035dea657e38d7be952c10f037a29153111a142d08a"}
{"Ticker":"MSFT","Date":1642588500,"Headline":"Progress Software (PRGS) Q4 Earnings & Revenues Top Estimates","Source":"Nasdaq","Summary":"Progress Software PRGS reported fourth-quarter fiscal 2021 non-GAAP earnings of 92 cents per share that beat the Zacks Consensus Estimate by 24.32% and surged 51.3% year over year.  Non-GAAP revenues of $143.7 million surpassed the consensus mark by 5.59% and increased 11"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61ca6526855358371763028ddf859636644ba904ee7cc1dc9e4520a48d7f4aa1"}
{"Ticker":"MSFT","Date":1642588260,"Headline":"The Metaverse Investment Playbook","Source":"Nasdaq","Summary":"We live in an age where ostentatious billionaires have the resources (and creative ambition) to make their favorite science fiction ideas come to life. The pandemic rapidly accelerated technological adaption, thrusting us into a futuristic economic environment where anyth"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c391bdfe2bb5823a0bf8f11be510c1e21733299f5b2c51b8e23b20ed82e5f448"}
{"Ticker":"MSFT","Date":1642586460,"Headline":"US STOCKS-Wall St rises on earnings boost; Big Tech bounces back","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after upbeat results from a host of companies partially offset a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53e439dc5abfb7833501baa5c86042f25e164db55d1e5189bad5d214a62cf424"}
{"Ticker":"MSFT","Date":1642586160,"Headline":"Stock Market News for Jan 19, 2022","Source":"Nasdaq","Summary":"Wall Street routed on Tuesday as the yields on U.S. government bonds skyrocketed. Investors are anticipating the Fed to take harsh measures and will rise interest rate as early in March in order to contain galloping inflation. All three major stock indexes ended in negati"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=86440579e6fc7c8f6a8dc3cf390882a34e0c8e8ca992b4cbac33bab31752b014"}
{"Ticker":"MSFT","Date":1642576980,"Headline":"SoFi, Bank of America, Cisco, United Airlines: What to Watch When the Stock Market Opens Today","Source":"DowJones","Summary":"SoFi Technologies was cleared by regulators to become a bank-holding company; United Airlines is due to report results."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4552474b20a9a30a4877983a4ed96c7d7ece7d986ef59d22876f6571b518213b"}
{"Ticker":"MSFT","Date":1642583460,"Headline":"US STOCKS-Wall St set to open higher on earnings boost, Big Tech bounces back","Source":"Nasdaq","Summary":"Upbeat results from a host of companies nudged U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=960db6dced7e6e3a9f40e57920b7ea9208fccea69702e24c66361d9fcb936877"}
{"Ticker":"MSFT","Date":1642583400,"Headline":"Why the Microsoft-Activision Merger Is Bad News for GameStop","Source":"MarketWatch","Summary":"On Tuesday, shares of the videogame retailer fell to their lowest level since February 2021 on news of the deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8199c9d819a905dadda0422b9c93b3f1712692b719d5446f0b9f5d334bc76f4"}
{"Ticker":"MSFT","Date":1642583340,"Headline":"Retail investors show signs of fatigue after last year's trading frenzy - report","Source":"Nasdaq","Summary":"Retail investors were less enthusiastic about buying the dip in U.S. stocks on Tuesday, the latest sign of a possible fatigue after last year's tech-fueled trading frenzy, Vanda Research analysts said in a weekly note."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2e551d28d520da68f3ebc651ca3cad5cd022d98e8fe41874866004748f75bb9c"}
{"Ticker":"MSFT","Date":1642581420,"Headline":"GLOBAL MARKETS-Stocks steady, bond yields jump as inflation fears crescendo","Source":"Nasdaq","Summary":"Strong earnings updates in the United States and Europe helped shares recover on Wednesday from earlier falls driven by rising fears over inflation that have sent bond yields on both sides of the Atlantic to multi-year highs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e5a8cbe2a7c5ee8d9d72638eb375e3b5d2808c3ba95ba92d12a7da08e4d3101"}
{"Ticker":"MSFT","Date":1642581060,"Headline":"Videogame Sales Continue to Thrive: 3 Solid Stocks to Buy","Source":"Nasdaq","Summary":"The videogame industry has grown since the pandemic struck. The industry was already thriving, and sales skyrocketed in 2020, making it one of the best years for videogame makers. However, many had predicted that the rally will come to a halt once the economy starts reope"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f64a7772d78ef8b08f2e9288893641261e284be1d0a0d7c973a35e23bbce9559"}
{"Ticker":"MSFT","Date":1642579649,"Headline":"Apple: Arms Race Laggard","Source":"SeekingAlpha","Summary":"Apple (AAPL) has started to under spend on R&D and CapEx. See why I think AAPL is no longer a leader in spending on capital expenditures."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2cc924071fe846df55f5141a8dbc7d4e1236ba1507ab2545d518eb3a96ae7df4"}
{"Ticker":"MSFT","Date":1642579200,"Headline":"From Russia With Love: With Russian Stocks Crashing, Is Sberbank A Buy?","Source":"SeekingAlpha","Summary":"Russian stocks are crashing on fears of more US sanctions over Russia's conflict with Ukraine. Find out if Sberbank stock is a buy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=37e4e95a2d0f1b50a83372fcd2344058ec08a5af31ca1c922ad4de770fa2c019"}
{"Ticker":"MSFT","Date":1642578600,"Headline":"Microsoft Is Becoming the Berkshire Hathaway of Tech","Source":"Nasdaq","Summary":"On Tuesday, Microsoft (NASDAQ: MSFT) announced plans to acquire video-game giant Activision Blizzard (NASDAQ: ATVI) in an all-cash $75 billion deal, or $68.7 billion when factoring in Activision's net cash position. That equates to a price of $95 per share, up from around Activis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e2b491968a17746804b3bd6239f1c86b38db5e3604c8aa0d1ebe06727fa14c77"}
{"Ticker":"MSFT","Date":1642577520,"Headline":"US STOCKS-Futures gain as UnitedHealth, BofA rise on results","Source":"Nasdaq","Summary":"Upbeat results from UnitedHealth and Bank of America pushed U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter earnings reporting season, while Big Tech stocks also looked set to make a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f4ddefc523927360e8aa74d4ef6bbe5b1ef2b73fed6ff2f9c06f5bd34261922"}
{"Ticker":"MSFT","Date":1642577420,"Headline":"Activision Blizzard could be paid up to $3 billion if Microsoft buyout deal is terminated","Source":"MarketWatch","Summary":"Activision Blizzard Inc. undefined disclosed Wednesday the termination provisions of the $68.7 billion merger agreement with Microsoft Corp. undefined, which..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ef4825819a075da9d40f01e670383f1722a8e6221a1d4f181896c6f06706ebbd"}
{"Ticker":"MSFT","Date":1642576980,"Headline":"The Zacks Analyst Blog Highlights: Microsoft, NextEra Energy and Starbucks","Source":"Nasdaq","Summary":"For Immediate ReleaseChicago, IL – January 19, 2022 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c2f16b2cabdd88849f3a20b782237e5d58b43c55d7268132570c0db4a6d3d9c"}
{"Ticker":"MSFT","Date":1642575600,"Headline":"EXCLUSIVE-Google to improve enforcement of adult ads policy","Source":"Nasdaq","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search engine that should have been blocked under its efforts to comply with UK regulations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e7f9f1ae9bc059d497635a32c80e2baa3fe42cec18192e62c71e96f90eb9aa9d"}
{"Ticker":"MSFT","Date":1642575480,"Headline":"The Zacks Analyst Blog Highlights: Microsoft, Activision Blizzard, Tencent and Sony","Source":"Nasdaq","Summary":"For Immediate ReleaseChicago, IL – January 19, 2022 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8395a997209f14fbee5e288f7763e9707041fd4651bc4b18731a75088eef84b0"}
{"Ticker":"MSFT","Date":1642574880,"Headline":"The Microsoft-Activision Deal Is Far From Done. The Winners and Losers Are Already Emerging.","Source":"MarketWatch","Summary":"Treasury yields hit highest levels since pandemic’s start, AT&T and Verizon agree to avoid airports in 5G rollouts, ASML earnings show demand for chips..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c88005f2cfaaeccb7d31de4f52a108185a03ca73c7ddf773ad958aa74378bdd3"}
{"Ticker":"MSFT","Date":1642574040,"Headline":"Zacks.com featured highlights include: Microsoft Corp., CDW Corp., SEI Investments Co. and W.W. Grainger","Source":"Nasdaq","Summary":"For Immediate ReleaseChicago, IL – January 19, 2022 – Stocks in this week’s article are Microsoft Corp. MSFT, CDW Corp. CDW, SEI Investments Co. SEIC and W.W. Grainger GWW."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fc31c3cf8ec0a21f23cfde8fde08c5508eb8a892cd4801e718e3b146f4aff639"}
{"Ticker":"MSFT","Date":1642573320,"Headline":"2 Data Analytics Stocks That Could Help Set You Up for Life","Source":"Nasdaq","Summary":"The amount of data being produced today is already immense. Roughly 90% of the world's data has been created within just the past two years, yet this will double over the next two years. Every day, the world creates 1.1 trillion megabytes of data, and companies are beginning to g"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2bc7c821479abc9f368a9831c4d37945d056bbc1d80c2eb3436e46cd1e98e02e"}
{"Ticker":"MSFT","Date":1642573200,"Headline":"Is iShares ESG Aware MSCI USA ETF (ESGU) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"Making its debut on 12\/01\/2016, smart beta exchange traded fund iShares ESG Aware MSCI USA ETF (ESGU) provides investors broad exposure to the Style Box - All Cap Growth category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f6b4b146977336aebc25af7e828655407ff9b48b50c304cd2984e51c779cc65"}
{"Ticker":"MSFT","Date":1642573200,"Headline":"Is FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"A smart beta exchange traded fund, the FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) debuted on 09\/16\/2011, and offers broad exposure to the Style Box - All Cap Blend category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9905fd19a3d91317724db7df11646051ab11b76f71a5c9536042489a36717717"}
{"Ticker":"MSFT","Date":1642573200,"Headline":"Should SPDR Portfolio S&P 500 ETF (SPLG) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"If you're interested in broad exposure to the Large Cap Blend segment of the US equity market, look no further than the SPDR Portfolio S&P 500 ETF (SPLG), a passively managed exchange traded fund launched on 11\/08\/2005."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=905fcf072a993f6fbe8210616ee3b7f1528f19707fb8fe1b239c9d6a87f86fc5"}
{"Ticker":"MSFT","Date":1642573200,"Headline":"Should WisdomTree U.S. Total Dividend ETF (DTD) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Launched on 06\/16\/2006, the WisdomTree U.S. Total Dividend ETF (DTD) is a passively managed exchange traded fund designed to provide a broad exposure to the Large Cap Value segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b8cbf0b8f86366c22f21427777e2ed2499c6efdbeddf1a20fc34c5be372d782d"}
{"Ticker":"MSFT","Date":1642572602,"Headline":"MICROSOFT CORP : Buy rating from UBS","Source":"Finnhub","Summary":"In a research note published by Karl Keirstead, UBS advises its customers to buy the stock. The target price remains set at USD 360. | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3ac0794bccc18357928f6ebbb9ee64ec3c08bcb3108bdc8a23c7cbbe56e0a7e2"}
{"Ticker":"MSFT","Date":1642572420,"Headline":"3 Beaten-Down Life Science Stocks to Buy at a Discount","Source":"Nasdaq","Summary":"The beating that life science stocks have taken lately is enough to make most investors think twice before risking another hard-earned dollar in this topsy-turvey corner of the stock market. If you can detach your emotions from your math skills, though, you know that there's no b"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6c81ee87fc95eaf10f3d1abe4e0fc0f15797c73b430bdb4fafbf89ad3e87037e"}
{"Ticker":"MSFT","Date":1642570680,"Headline":"Sony Braces for Microsoft’s ‘Pay-to-Win’ Strategy","Source":"DowJones","Summary":"Sony shares dropped nearly 13% after Microsoft’s announced megadeal for Activision. Its investors are right to be concerned. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6e5309881e829e1e0889f7bfec427bb16fb62d650956d4abdd4690ded0de866"}
{"Ticker":"MSFT","Date":1642568580,"Headline":"2 Unstoppable Stocks That Could Turn $200,000 Into $1 Million by 2030","Source":"Nasdaq","Summary":"The new year has just begun, but the best investment strategy in 2022 won't differ all that much from the best plan in 2021: Focus on the long term. Recent stock market volatility, especially in technology stocks, can tempt investors to make short-sighted decisions -- but this sh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f65212f3bfd265a317ba037ffe27636ccd4f3df14534f920f85170abd06ae54"}
{"Ticker":"MSFT","Date":1642567777,"Headline":"Microsoft-Activision Deal: What You Need To Know","Source":"SeekingAlpha","Summary":"Microsoft (MSFT) steps up its game with the acquisition of Activision Blizzard (ATVI). Check out why I suspect the timing of this deal announcement."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b93de19b53aa79e7de36c3d356b04e6a07a053ef53a55d09bd2f757a13a137a4"}
{"Ticker":"MSFT","Date":1642566840,"Headline":"GLOBAL MARKETS-Stocks slide, treasury yields jump as inflation fears crescendo","Source":"Nasdaq","Summary":"Asian and European shares fell, U.S. and European bond yields hit multi-year highs, and oil prices climbed on Wednesday as investors braced for tighter monetary policy to combat troubling levels of inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eb80fd41eb38cb0350fcbb5dea1a656f789f9698e466b7304596c65a804ce2c6"}
{"Ticker":"MSFT","Date":1642565678,"Headline":"Microsoft: The Activision Add-On","Source":"SeekingAlpha","Summary":"Microsoft makes its biggest acquisition ever by acquiring Activision for $68.7 billion. Check out how this deal would impact MSFT on a capital return basis."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ee993f3cf18f9fa3ffcfeb75337c2479f35ab9ce78491df8006616191759869d"}
{"Ticker":"MSFT","Date":1642564509,"Headline":"Game Developer -Microsoft to acquire Activision Blizzard to bring the joy and community of gaming to everyone, across every device","Source":"Finnhub","Summary":"$68.7 billion deal sees Windows giant buy up uber-publisher.Legendary games, immersive interactive entertainment and publishing expertise accelerate growth in Microsoft's Gaming business across... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=045e9390e4bf5d735c4a9ed8f8a63662284c17feabed4813dcc2b448fec2e7c2"}
{"Ticker":"MSFT","Date":1642563337,"Headline":"Activision Sexual Misconduct Fallout Prompted Microsoft to Pursue Deal","Source":"Yahoo","Summary":"(Bloomberg) -- Late last year, as employees at Activision Blizzard Inc. and Chief Executive Officer Bobby Kotick were reeling from accusations that Kotick knew of sexual harassment at the company for years, a group of Microsoft Corp. senior executives suggested that Xbox head Phil Spencer check in with the embattled CEO.The goal, according to a person familiar with the matter, was to offer support to a key partner and make it clear that Microsoft had concerns about the treatment of women at Acti"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f0d5f2c75251d8e542a70e7d15533d82d18a50f1cec6dd2f2d3ecf9aee839534"}
{"Ticker":"MSFT","Date":1642562405,"Headline":"Microsoft Corporation -- Moody's affirms Microsoft Corporation's Aaa senior unsecured rating following announced acquisition of Activision Blizzard, Inc., outlook stable","Source":"Yahoo","Summary":"Rating Action: Moody's affirms Microsoft Corporation's Aaa senior unsecured rating following announced acquisition of Activision Blizzard, Inc., outlook stableGlobal Credit Research - 18 Jan 2022New York, January 18, 2022 -- Moody's Investors Service (\"Moody's\") affirmed Microsoft Corporation's (\"Microsoft\") Aaa senior unsecured rating and the P-1 (Prime-1) rating for commercial paper following Microsoft's announcement that it agreed to acquire Activision Blizzard, Inc. (\"Activision\" or \"Activision Blizzard\") in an all-cash transaction for approximately $68.7 billion in equity value.  Both boards of directors have approved the transaction."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c8585e5aa18d0a134b901f2fe0d858369672b68c29b27327f649f2be4fc3676b"}
{"Ticker":"MSFT","Date":1642561500,"Headline":"ANALYSIS-Sony faces deep-pocketed rivals in war over future of gaming","Source":"Nasdaq","Summary":"Sony Group, perched atop the gaming sector, is facing a fresh challenge from cash-rich rivals betting on a next-generation online video game boom as the Japanese conglomerate eyes expansion on multiple fronts, including electric cars."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f83f344c168bc70edad764b9f9727b401c3909667f8ab0f51be599060d2cbefa"}
{"Ticker":"MSFT","Date":1642560120,"Headline":"Sony Shares Fall Sharply After News of Microsoft Deal for Activision Blizzard ","Source":"DowJones","Summary":"Sony Group’s shares fell nearly 13% in Tokyo on concerns about tough new competition for its videogame business from the newly announced combination of Microsoft and Activision Blizzard. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=69934bbcea67ea20650150b59bb2a2e9769437f74ca5a161a105cc5d028a303e"}
{"Ticker":"MSFT","Date":1642557720,"Headline":"Nikkei falls to 5-month low dragged down by Toyota, Sony","Source":"Nasdaq","Summary":"Japan's Nikkei index fell to a five-month low on Wednesday, dragged down by Sony Group and Toyota Motor, tracking Wall Street's weak finish overnight."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d2d48ce6c9189187bcac5be0d97866515838196998aeced31c82dc51f954b28a"}
{"Ticker":"MSFT","Date":1642557600,"Headline":"Oracle opens data centre to provide cloud services across Africa","Source":"Nasdaq","Summary":"Oracle opened a data centre in South Africa on Wednesday to provide local cloud services across Africa for the first time, joining the likes of Microsoft and Amazon in setting up facilities in the southernmost country on the continent."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d5a2a2b6de7081edc46dea322c46ac5dce4401560f8ef144220145861e77029"}
{"Ticker":"MSFT","Date":1642556760,"Headline":"Sony shares fall sharply in Japan after news of Microsoft deal for Activision","Source":"Yahoo","Summary":"Sony Group Corp. shares fell as much as 10% on Wednesday morning following news that Microsoft Corp. agreed to buy videogame heavyweight Activision Blizzard Inc. in an all-cash deal valued at about $75 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b1561c041c92dfec445a0c2e6dbab430c802bc2019ecb329f72c80350207cffa"}
{"Ticker":"MSFT","Date":1642556347,"Headline":"Activision Blizzard, Inc. -- Moody's places Activision Blizzard's Baa1 senior unsecured ratings on review for upgrade","Source":"Yahoo","Summary":"Rating Action: Moody's places Activision Blizzard's Baa1 senior unsecured ratings on review for upgradeGlobal Credit Research - 18 Jan 2022New York, January 18, 2022 -- Moody's Investors Service (\"Moody's\") placed Activision Blizzard, Inc.'s (\"Activision\" or \"Activision Blizzard\") Baa1 senior unsecured ratings on review for upgrade following Microsoft Corporation's announcement that it agreed to acquire Activision in an all-cash transaction for approximately $68.7 billion in equity value (including Activision's net cash).  Both boards of directors have approved the transaction."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ecbeef22ab2838ee9dba61ea6d7cc33dda182c0fd9c76310a9c701b7943e188"}
{"Ticker":"MSFT","Date":1642555828,"Headline":"Sony slides on 'monumental challenge' from Microsoft gaming deal","Source":"Reuters","Summary":"Shares in Japan's Sony Group fell 9% on Wednesday after gaming rival Microsoft said it will buy developer Activision Blizzard in a record $68.7 billion deal for the industry."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a28af5b67ad7beeb6d9c3f955d748bc72a6a0818bf95d689633dc6e7ecfc5b43"}
{"Ticker":"MSFT","Date":1642554336,"Headline":"Sony Falls Most in Almost Two Years on Microsoft-Activision Deal","Source":"Yahoo","Summary":"(Bloomberg) -- Sony Group Corp. shares fell as much as 9.8% in Tokyo, their biggest intraday drop since March 2020, after PlayStation rival Microsoft Corp. announced a $69 billion deal to acquire games publisher Activision Blizzard Inc.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Te"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1b9e323fd3f018e30495eaa5f331580375e85792e7fd2c58fb91cf32e16cfe7b"}
{"Ticker":"MSFT","Date":1642554016,"Headline":"Microsoft to Buy Activision-Blizzard","Source":"Yahoo","Summary":"Back in the day, video game makers earned their money a quarter at a time, through coin slots at arcades in malls across America. How times have..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3dca2c18f73b5658819b6c14c30eb6b733a8a4ab3577f19e114fdb2cee8c2afd"}
{"Ticker":"MSFT","Date":1642552976,"Headline":"Microsoft’s Metaverse Play Adds Historic $68.7B Gaming Acquisition","Source":"Yahoo","Summary":"Microsoft to buy Activision Blizzard for eye-watering sum, in move to strengthen its gaming push into the metaverse."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=060f6bb12c34779347e55ccdedab14a420eff739fe1f048f11f10065b4b5b33b"}
{"Ticker":"MSFT","Date":1642552426,"Headline":"Analyzing Microsoft's Activision Blizzard Acquisition","Source":"Yahoo","Summary":"Microsoft announced acquisition of Activision Blizzard on Jan. 18, 2022. How will it affect the tech giant's business?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db12e4e0d0f79f62effdb14f74983c8d75a2afaa6651cfa7634059052e2e606a"}
{"Ticker":"MSFT","Date":1642552175,"Headline":"Sony slides 9% as Microsoft gaming deal casts shadow","Source":"Reuters","Summary":"Shares in Japan's Sony Group fell 9% on Wednesday after gaming rival Microsoft said it will buy developer Activision Blizzard in a record $68.7 billion deal for the industry."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4a07220ca24d38261a8bf81601e4f7e3b6eadd4b1153b3c8ad9c95c357808cad"}
{"Ticker":"MSFT","Date":1642551960,"Headline":"GLOBAL MARKETS-Asia shares fall as Treasury yields hit fresh highs","Source":"Nasdaq","Summary":"Asia's share markets fell on Wednesday as U.S. Treasury yields hit fresh two-year highs and a global technology stock sell-off unsettled investors worrying about inflation and bracing for tighter U.S. monetary policy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9be6d340ce9d9905e570005874c3fa8db41b66b5092a7735d5f26193d5d1d307"}
{"Ticker":"MSFT","Date":1642551659,"Headline":"Microsoft to gobble up Activision in $69 billion metaverse bet","Source":"Reuters","Summary":"Microsoft Corp is buying \"Call of Duty\" maker Activision Blizzard for $68.7 billion in the biggest gaming industry deal in history as global technology giants stake their claims to a virtual future."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=307042167fd4ace7069e9dddcb3b1b4f7cb6e8288281e4908042a1564ae4aefc"}
{"Ticker":"MSFT","Date":1642551300,"Headline":"Microsoft faces battle for Activision deal, especially if ‘Call of Duty’ is destined for Xbox exclusivity","Source":"Yahoo","Summary":"Microsoft Corp. has in the last few years gotten a bit of an anti-competitive pass from U.S. regulators, after its long legal battle with the Justice Department in the late 1990s but that pass may now be at an end, with the software behemoth's plans to purchase the troubled video game maker Activision Blizzard Inc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=78fd2bb8e9606e0bd1799af3eccc0c19d6cd2190b145872c053355f18c26f896"}
{"Ticker":"MSFT","Date":1642720524,"Headline":"Xbox Chief Says ‘Call of Duty’ Will Remain on PlayStation","Source":"Yahoo","Summary":"(Bloomberg) -- PlayStation fans will still be able to play the famed ‘Call of Duty’ franchise on the Sony gaming platform even after the proposed purchase of Activision Blizzard Inc. by the parent of rival Xbox, Microsoft Corp.’s head of gaming said on Thursday. Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessWhy Some Vaccinated People Resist Omicron and Others Don’tLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapThailand to Resume Quarantine-Free"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d0610d3688f9f1061be023064af05535b462a30d5d877063e7a79a1464cc79e7"}
{"Ticker":"MSFT","Date":1642720380,"Headline":"Why GameStop Couldn't Hold Onto Its Gains Today","Source":"Yahoo","Summary":"Of course, one of the most recent reasons for its failing fortunes is the announcement by Microsoft (NASDAQ: MSFT) that it would be acquiring Activision Blizzard (NASDAQ: ATVI) for almost $70 billion, or $95 per share in cash.  The fear is that by absorbing the video game developer into its ecosystem, Microsoft would make most or all of Activision's games exclusive to its own Game Pass platform, and this could starve GameStop for customers in the future.  The pre-owned video game market has long been one of GameStop's crutches even as the industry continues to transition to digital gaming and game downloads."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=71a205d91b8cf9f651014ac5f149db72bc6e79f5ef92926bef77cfe19a4b0771"}
{"Ticker":"MSFT","Date":1642720240,"Headline":"Microsoft Jumps After Bullish Pre-Earnings Assessments","Source":"Yahoo","Summary":"Microsoft's (MSFT) shares jumped by 2% Thursday morning after analysts sent out bullish notes about the company's upcoming earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eb0335d833f02ebb1910a926816089c0aaec31f117add8fe51191c1eee108175"}
{"Ticker":"MSFT","Date":1642718590,"Headline":"Microsoft (MSFT) Stakes Claim In Metaverse With $75 billion Activision Blizzard (ATVI) Purchase","Source":"Yahoo","Summary":"This deal would rank Microsoft as the third-largest gaming enterprise on earth and #1 in the US (by revenue)"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0a231ebcdb6413e1cbd6337b56520fa1fa3456a9e1bc986b7c7a1666a6e4cd75"}
{"Ticker":"MSFT","Date":1642718296,"Headline":"Legacy Financial Group LLC Buys FT Cboe Vest Fund of Deep Buffer ETFs, Invesco BulletShares ...","Source":"Yahoo","Summary":"Investment company Legacy Financial Group LLC (Current Portfolio) buys FT Cboe Vest Fund of Deep Buffer ETFs, Invesco BulletShares 2026 High Yield Corporate Bon, iShares S&P 500 Growth ETF, Invesco BulletShares 2027 High Yield Corporate Bon, sells ISHARES TRUST, iShares Intermediate Credit Bond ETF, SPDR Dividend ETF, iShares TIPS Bond ETF, iShares 0-5 Year High Yield Corporate Bond ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Legacy Finan"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a146d64391cc51238c8cc97ec306813d856dc80a9f06567777472264c571e259"}
{"Ticker":"MSFT","Date":1642718293,"Headline":"Alpha Omega Group, Inc. Buys First Trust US Equity Opportunities ETF, CION Invt Corp, Sells ...","Source":"Yahoo","Summary":"Investment company Alpha Omega Group, Inc. (Current Portfolio) buys First Trust US Equity Opportunities ETF, CION Invt Corp, sells Salesforce.com Inc, Adobe Inc, Microsoft Corp, Bluerock Residential Growth REIT Inc, Moderna Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Alpha Omega Group, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e86f9b220f4f871585bed17bb933e75aa07c3ef8223526a4062df01fff30f68c"}
{"Ticker":"MSFT","Date":1642718283,"Headline":"AAFMAA Wealth Management & Trust LLC Buys Caterpillar Inc, Target Corp, PowerShares QQQ ...","Source":"Yahoo","Summary":"Investment company AAFMAA Wealth Management & Trust LLC (Current Portfolio) buys Caterpillar Inc, Target Corp, PowerShares QQQ Trust Ser 1, Microsoft Corp, The Walt Disney Co, sells Pioneer Natural Resources Co, Vanguard Information Technology ETF, Advance Auto Parts Inc, ConocoPhillips, Qualcomm Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, AAFMAA Wealth Management & Trust LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9294bcddefe57f75f0cd3edc3d7df9fe407912f5de27cd2c26bcb756c2597ff0"}
{"Ticker":"MSFT","Date":1642716840,"Headline":"‘Call of Duty’ will stay on Sony’s PlayStation console after Activision deal, Xbox boss promises","Source":"Yahoo","Summary":"Microsoft Corp.'s head of Xbox addressed fears late Thursday that the company will shut out competing consoles from Activision Blizzard Inc.'s flagship \"Call of Duty\" franchise."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c4ea02ff182081fdfa3afe7624e2824334b7b7d48ea636a90f178e721db2057"}
{"Ticker":"MSFT","Date":1642713119,"Headline":"Activision Blizzard: Buy On Antitrust Weakness And Make An Easy Profit","Source":"SeekingAlpha","Summary":"Activision (ATVI) is trading at a 14% discount to the offer by Microsoft amid antitrust concerns. We would buy on antitrust related weakness to take an easy profit."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c96fc128fcedd1573c9724e6800b03a4451f957a30617a8313e0c5373f20c7e7"}
{"Ticker":"MSFT","Date":1642711795,"Headline":"Fact Check-Swedish company – not Microsoft – develops microchip implants that can store COVID-19 vaccine information","Source":"Reuters","Summary":"Update Jan. 20, 2022: Updating to include statement from Microsoft."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ee71f41fff3b1a3fd510289a9094d407b0318ec62c0c29a22a3f10be30e3f2b2"}
{"Ticker":"MSFT","Date":1642711757,"Headline":"Analysis-Microsoft faces challenge cleaning up Activision Blizzard’s culture","Source":"Yahoo","Summary":"The success of Microsoft’s biggest deal ever rides on rehabilitating Activision Blizzard’s culture, Microsoft CEO Satya Nadella declared after announcing the $69 billion transaction.  Accomplishing that will require Microsoft to deviate from its usual hands-off approach on acquisitions to tackle what amounts to a “clean up” job of fixing the famed maker of the “Call of Duty” games franchise, which faces multiple accusations of sexual harassment and misconduct, analysts and management experts say.  Microsoft has traditionally allowed the companies it acquires to run autonomously, RBC Capital Markets analyst Rishi Jaluria said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04b3ffa8b787a610a7d419229653cfd14673b9aa753fc11134cefc93e6131848"}
{"Ticker":"MSFT","Date":1642710762,"Headline":"With Activision Blizzard deal, Microsoft’s Game Pass is now a huge problem for Sony","Source":"Yahoo","Summary":"With the addition of Activision Blizzard, Microsoft's Game Pass is a gaming behemoth that spells trouble for Sony's PlayStation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5d2808fcca5129a3aec8ba3deb64299c83c89620eb5f5f10b320b77ebc096ca6"}
{"Ticker":"MSFT","Date":1642709998,"Headline":"What does the Microsoft-Activision deal mean for Sony?","Source":"Yahoo","Summary":"Yahoo Finance's Daniel Howley details the impact Microsoft's acquisition of Activision has for the video game space and competitors like Sony, cloud gaming innovations, and the benefits this deal holds for Xbox owners."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=66f9ce206f9d2ce593aea42bd98d9bd07ef8608604056d648eedf0c86d16f810"}
{"Ticker":"MSFT","Date":1642708800,"Headline":"Tech Stocks Need a Life Raft. Earnings Season Could Be It.","Source":"Yahoo","Summary":"Even after a rebound on Thursday, the Nasdaq 100 index was almost 8% below the peak it hit in late November."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=42361f588f7e5bd3eeb15d13d127931b05e23ebffa4412edf92fa02c354ed3a2"}
{"Ticker":"MSFT","Date":1642707219,"Headline":"Stock market drop 'is an opportunity for some names,' strategist explains","Source":"Yahoo","Summary":"CFA and owner of Portia Capital Management Michelle Connell joins Yahoo Finance Live to discuss Big Tech, energy and financial sector fund data, commodity futures, and Fed policy makers expecting three interest rate hikes in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=423c6cd306daa86a862bb8120c1893a662ee53dd47284062efb1d82eede44a31"}
{"Ticker":"MSFT","Date":1642703888,"Headline":"Northstar Advisory Group, LLC Buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit Bond ...","Source":"Yahoo","Summary":"Investment company Northstar Advisory Group, LLC (Current Portfolio) buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit Bond ETF, Microsoft Corp, Alphabet Inc, Health Care Select Sector SPDR, sells iShares MSCI USA ESG Optimized ETF, SPDR Portfolio S&P 500 ETF, Vanguard Short-Term Government Bond ETF, SPDR Bloomberg 1-3 Month T-Bill ETF, SPDR Portfolio Short Term Treasury ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Northstar Advisory"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b4defdac188eb194421c00f77d1c014dcd3bd9ef6c546e84937eaacb6976d3e"}
{"Ticker":"MSFT","Date":1642703887,"Headline":"Radnor Capital Management, LLC Buys Microsoft Corp, Apple Inc, International Business Machines ...","Source":"Yahoo","Summary":"Investment company Radnor Capital Management, LLC (Current Portfolio) buys Microsoft Corp, Apple Inc, International Business Machines Corp, Procter & Gamble Co, Johnson & Johnson, sells Xylem Inc, AT&T Inc, HealthEquity Inc, PayPal Holdings Inc, FIGS Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Radnor Capital Management, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=705101be9d1a52e24dc58f223bd3da01047ef5443a5f78ffb56bed91965c194e"}
{"Ticker":"MSFT","Date":1642703883,"Headline":"SevenBridge Financial Group, LLC Buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit ...","Source":"Yahoo","Summary":"Investment company SevenBridge Financial Group, LLC (Current Portfolio) buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit Bond ETF, Health Care Select Sector SPDR, S&P Global Inc, PowerShares QQQ Trust Ser 1, sells Apple Inc, Amazon.com Inc, Schwab US Dividend Equity ETF, Microsoft Corp, Johnson & Johnson during the 3-months ended 2021Q4, according to the most recent filings of the investment company, SevenBridge Financial Group, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=95930c87a57e4588c15ea08dd389dcf3484f4c7735a3f9638870e7ef46280340"}
{"Ticker":"MSFT","Date":1642701978,"Headline":"Why GameStop Stock Is Rising Today","Source":"Yahoo","Summary":"Shares of GameStop (NYSE: GME) were bouncing higher Thursday in noontime trading, rising 3.5% following seven consecutive days of declines, especially following the announcement by Microsoft (NASDAQ: MSFT) that it was acquiring video game giant Activision Blizzard (NASDAQ: ATVI).  While GameStop is in turnaround mode to better benefit from the transition to digital gaming and game downloads, the acquisition could seriously derail the effort if Microsoft keeps Activision's games exclusive to Game Pass, Microsoft's gaming portfolio."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3d39f336004a4109f45d5e8b0c79daf2bf57ec79f3242b91c320ea18dcf9726"}
{"Ticker":"MSFT","Date":1642693860,"Headline":"Why Carbon Credit ETFs Soared in 2021","Source":"Nasdaq","Summary":""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5e6bd6a8cf984496dd8ac962511b15453cb837aefc47454025a5db252f11fe2"}
{"Ticker":"MSFT","Date":1642693472,"Headline":"Microsoft faces challenge cleaning up Activision Blizzard\u0092s culture","Source":"Finnhub","Summary":"The success of Microsoft\u0092sbiggest deal ever https:\/\/www.reuters.com\/technology\/microsoft-buy-activision-blizzard-deal-687-billion-2022-01-18rides on rehabilitating Activision Blizzard\u0092s... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89d9c190f14404c71d5623e46a1fc9e9c9a23997e65d405c1b0c188ef32a8455"}
{"Ticker":"MSFT","Date":1642691051,"Headline":"Microsoft's Activision Deal Is A Must - Buy On Weakness","Source":"SeekingAlpha","Summary":"we believe Microsoft has wrapped up a fantastic deal with Activision that should transform its gaming metaverse ambitions. Read more about MSFT stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8f1fa47a8e31597c1ae920fc8840971e72345987393fa952f99fb7fd300ea65"}
{"Ticker":"MSFT","Date":1642689668,"Headline":"It's Time To Go To Cash For The Next 7 Years - 1-Year Update","Source":"SeekingAlpha","Summary":"The stock market and bond market remain historically overvalued today, however, the almost all-encompassing bubble has started to break. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7c2ddd23e18619f5b895cfc30f95c30a25f601db8acf53fd3e1919c72fc2523"}
{"Ticker":"MSFT","Date":1642687982,"Headline":"Bargain-hunting buoys Wall Street after Nasdaq correction","Source":"Finnhub","Summary":"Wall Street's main indexes rebounded onThursday with solid gains for technology and growth shares asTreasury yields steadied and investors sought bargains a dayafter the Nasdaq fell into correction... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e27c1f7d9dd6e7d15cbe957dd458aeacf745719f20f808405f425ab6cef9e7d5"}
{"Ticker":"MSFT","Date":1642687980,"Headline":"US STOCKS-Bargain-hunting buoys Wall Street after Nasdaq correction","Source":"Nasdaq","Summary":"Wall Street's main indexes rebounded on Thursday with solid gains for technology and growth shares as Treasury yields steadied and investors sought bargains a day after the Nasdaq fell into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=781d9f2652389d725ae45adec42ce830ea9137f7d679806abf0852e9690769ac"}
{"Ticker":"MSFT","Date":1642687272,"Headline":"Microsoft : Building a stronger cybersecurity team through diversity and training","Source":"Finnhub","Summary":"The security community is continuously changing, growing, and learning from each other to better position the world against cyber threats. In the latest post of our Voice of the... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f82ceeae88c166f34dcb6086b6857fa7e4d4d1e29ae2a554cd0839984d59269f"}
{"Ticker":"MSFT","Date":1642686935,"Headline":"Microsoft-Activision deal gives merger speculators a new darling","Source":"Reuters","Summary":"Hedge funds that earn returns speculating on precarious acquisitions were handed a gift this week when Microsoft Corp agreed to buy \"Call of Duty\" maker Activision Blizzard for $68.7 billion in cash."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a2bcea2965d6489ddbe6795a604d8b5d7f4034b9e0b2eb471255e2b4a0860712"}
{"Ticker":"MSFT","Date":1642685494,"Headline":"Is Now A Good Time To Consider Low-Volatility ETFs?","Source":"SeekingAlpha","Summary":"Low Volatility ETFs may seem like a good way to protect yourself against an oncoming bear market. Find out if now is a good time to consider buying them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be4dbc0c5a17348d2d3b9d2b7474880991858db3f923dc00411a2d1fa6e6128d"}
{"Ticker":"MSFT","Date":1642684273,"Headline":"See what's next in education: Join us at upcoming FETC and TCEA events","Source":"Finnhub","Summary":"Today, technology plays a fundamental role in almost every area of our lives-including the ways we teach and learn. Over the past few years, we've seen its impact make education more... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d61092b817e76367a096f45b00fff9c14d9d3ee6d4a375a23020a4774d71530e"}
{"Ticker":"MSFT","Date":1642683360,"Headline":"Price Over Earnings Overview: Microsoft","Source":"Benzinga","Summary":" \nRight now, Microsoft Inc. (NASDAQ:MSFT) share price is at $310.24, after a 2.3% gain. Moreover, over the past month, the stock decreased by 7.31%, but in the past year,..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a9d97bfdcb6a0d165b175b0e233ef10ffc40f094b4023beb43d227903a242881"}
{"Ticker":"MSFT","Date":1642680071,"Headline":"Microsoft : adds to its commitment to affordable housing in Puget Sound region","Source":"Finnhub","Summary":"This month marks three years since Microsoft announced its Affordable Housing Initiative to help address the region's growing housing and homelessness crisis through a commitment of... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90b7b4df9b2623daceb3535b42c25dda18bbddc3254f12dd8415de3d4ba1f01d"}
{"Ticker":"MSFT","Date":1642679700,"Headline":"US STOCKS-Growth bargains, upbeat earnings boost Wall Street","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5cbb94ebc90fc84341b332954bcc75455705511ae34a9e44acfe08b2545a80b3"}
{"Ticker":"MSFT","Date":1642677840,"Headline":"Netflix could be Activision’s Plan B","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     If Microsoft has kicked off the game of who could buy Activision Blizzard, Netflix could be a surprise winner. The software giant’s $69 billion bid for the maker of “Call of Duty” is likely to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=531db50bddebc105bc99f8b7adcdaa9dc6fb678c54c09a434557492c29e1b2d8"}
{"Ticker":"MSFT","Date":1642674060,"Headline":"Microsoft's 10 Biggest Acquisitions Of All Time: Activision, LinkedIn And More","Source":"Benzinga","Summary":"Microsoft Corporation (NASDAQ: MSFT) on Tuesday announced plans to acquire game developer Activision Blizzard Inc (NASDAQ: ATVI) for $95 per share.\nThe proposed all-cash..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9ff96e3e8515dee20031814df3ba1c3f1b29ed858f30a95f085021344fe20115"}
{"Ticker":"MSFT","Date":1642673760,"Headline":"Dow Movers: DOW, TRV","Source":"Nasdaq","Summary":"In early trading on Thursday, shares of Travelers Companies topped the list of the day's best performing Dow Jones Industrial Average components, trading up 3.7%.  Year to date, Travelers Companies Inc registers a 6.1% gain."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4090e19880f13d358ece5e28909a8130ab7485aaaa83bdcd458d01fd68890581"}
{"Ticker":"MSFT","Date":1642673160,"Headline":"US STOCKS-Growth bargains, upbeat earnings take Wall Street higher","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41723a364b6f65901d1188fa99ea089f3e6c418d338aa4e513ef01d51f3bc4af"}
{"Ticker":"MSFT","Date":1642672800,"Headline":"This Is the Best Thing to Happen to Activision","Source":"Nasdaq","Summary":"Thanks to the metaverse, the gaming industry continues to hit headlines. Today's video focuses on Microsoft (NASDAQ: MSFT) and its current plans to acquire Activision Blizzard (NASDAQ: ATVI). This acquisition will improve the gaming catalog Microsoft offers, but more importantly,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a82448858fa9bafd4df2cb1ac3aba4aa2110f5a495a90fdadd563196495b7569"}
{"Ticker":"MSFT","Date":1642670760,"Headline":"Are the Nasdaq's 3 Worst-Performing Stocks Ready to Bounce Back in 2022?","Source":"Nasdaq","Summary":"Last year was great for investors who owned a Nasdaq index fund, but not every stock shared in the gains. Several high-profile constituents suffered big losses, especially some stay-at-home tech stocks. Sometimes a steep sell-off is the best time to buy -- you can profit in the l"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b79d8bb83d1d163dea407a10708d87215b20da29ac2aedecd7c5cb86ea33aae2"}
{"Ticker":"MSFT","Date":1642670040,"Headline":"Cadence's (CDNS) Palladium Z2 Solution Utilized by Microchip","Source":"Nasdaq","Summary":"Cadence Design Systems’ CDNS Palladium Z2 Enterprise Emulation Platform is being utilized by Microchip for advancing work on latest application-specific integrated circuits or ASIC products. These products are designed for high performing system on chip (SoC) solutions fo"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b7d309a706ac701d37009d8070d74c9f76270f9d51d597e22f3b55416e97a06"}
{"Ticker":"MSFT","Date":1642669740,"Headline":"US STOCKS-Wall Street set to open higher after upbeat earnings","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday as upbeat results from American Airlines and Travelers kept the positive momentum going for the fourth-quarter earnings season, a day after the tech-heavy Nasdaq index plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c1cbf1b5be1f96e95e8c74681e0a3e48312870513789e9f5a923ffdb311558f"}
{"Ticker":"MSFT","Date":1642668180,"Headline":"PTC Expands USAF Partnership, Inks 5-Year Definitive Contract","Source":"Nasdaq","Summary":"PTC Inc. PTC recently announced that it has expanded its partnership with the United States Air Force (“USAF”) as part of a five-year definitive contract for the deployment of PTC's Servigistics Service Parts Management SaaS solution. The $95 million contract includes a o"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=583902f02b8a1d2de6d41a13808ff1ff7e944aabfcf5ecafbfadbe7f393087ec"}
{"Ticker":"MSFT","Date":1642667700,"Headline":"Investing In Metaverse Real Estate","Source":"SeekingAlpha","Summary":"A new REIT capitalizing on virtual real estate recently filed for an IPO. Read this article to check out what the metaverse means for REIT investors."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6d73cd6ac1c6b5c89523396c96a9a71b8f0a75883b2602415fe8ab123ff9072f"}
{"Ticker":"MSFT","Date":1642666200,"Headline":"3 Red Flags for Microsoft's Future","Source":"Nasdaq","Summary":"Microsoft's (NASDAQ: MSFT) stock has rallied more than 730% since Satya Nadella took over as the tech giant's third CEO on Feb. 4, 2014. That massive rally, which boosted Microsoft's market cap from about $300 billion to nearly $2.3 trillion, was largely driven by Nadella's inten"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3777577b13b0af7d2af35c1395870f53eba05774957511beed6cb3223cad58d3"}
{"Ticker":"MSFT","Date":1642666080,"Headline":"GLOBAL MARKETS-Wall Street headed higher as tech investors lick their wounds","Source":"Nasdaq","Summary":"Wall Street was headed higher on Thursday, pulling European shares back into the black as investors in Big Tech licked their wounds after Nasdaq's slide into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a55c88092289c8e8f74effd7c53a10b3d0383abc2014203a228128481fd606c2"}
{"Ticker":"MSFT","Date":1642665720,"Headline":"Ukraine Hacks Signal Broad Risks of Cyberwar Even as Limited Scope Confounds Experts ","Source":"DowJones","Summary":"Last week’s cyberattacks might presage a larger operation, but so far, the hacks appear limited and amount to a fraction of the damage Western officials believe Moscow is capable of inflicting on Kyiv."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=270d0d4a009c3a954e13e77a2d9c566d7892a8e7d99612ea8e39c0568956b162"}
{"Ticker":"MSFT","Date":1642664940,"Headline":"U.S. stock futures rise on earnings after Nasdaq enters correction territory","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday on a string of strong earnings led by American Airlines and insurer Travelers, a day after the tech-heavy Nasdaq plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bdbded73dae2ec0cd25707914357b80a3e3e1c932e4f63e807c26c94f979f350"}
{"Ticker":"MSFT","Date":1642664936,"Headline":"SPHD: Moderately Attractive","Source":"SeekingAlpha","Summary":"Invesco's S&P 500 High Dividend Low Volatility ETF (SPHD) offers monthly dividend payments at a 0.30% expense ratio. See why SPHD ETF is an attractive choice."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1696c0bc8ed700337bc7956fefa41c2935f3237476d42c0d3b9e454cb8be236f"}
{"Ticker":"MSFT","Date":1642662000,"Headline":"Microsoft Shows Meta Won’t Own the ‘Verse","Source":"DowJones","Summary":"While Facebook’s Mark Zuckerberg has lately been the loudest evangelist of the metaverse, Microsoft has been embracing its own version for years. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b0991c600bace4917894621ce32b970f7f7577b3d2b5d444f8cb87d45c95b489"}
{"Ticker":"MSFT","Date":1642659600,"Headline":"Is Invesco Dynamic Software ETF (PSJ) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"The Invesco Dynamic Software ETF (PSJ) was launched on 06\/23\/2005, and is a smart beta exchange traded fund designed to offer broad exposure to the Technology ETFs category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4df5faecd53a5feda088f8240007a472791b59820a7da7cd893f8011481d155"}
{"Ticker":"MSFT","Date":1642658700,"Headline":"Microsoft vs. Apple: Which Stock is Headed for Growth in 2022?","Source":"Nasdaq","Summary":"When it comes to pure-play technology companies like Microsoft and Apple, website traffic data is an important tool. This is because, for these companies, most of the retailing takes place online. This is especially true when it comes to selling software and devices such as smartphones, PCs, and wearables to individual customers.\n\n\n\nUsing the TipRanks stock comparison tool, we will compare two technology giants, Microsoft and Apple, and see whether their performance in the December quarter can be gauged using the Website Traffic tool on TipRanks. We will also look at what Wall Street analysts are saying about these stocks.\n\n\n\nMicrosoft (NASDAQ: MSFT)\n\n\n\nMicrosoft dominated the headlines recently as it announced an all-cash acquisition of Activision Blizzard (ATVI) for $68.7 billion. Analysts believe that this acquisition will extend the company’s footprint in the gaming industry.\n\n\n\nWhile this acquisition bodes well for MSFT when it comes to its gaming business, it will be interesting to see how MSFT’s key cloud business fares in the upcoming earnings for fiscal Q2. MSFT earnings for fiscal Q2 are expected to be announced next week, on January 25.  \n\n\n\nIn fiscal Q1, MSFT’s cloud business surpassed $20 billion in revenues for the first time and jumped 36% year-over-year.\n\n\n\nWedbush analyst Daniel Ives thinks that the company’s Azure cloud growth story is just starting. The analyst’s checks for the December quarter have indicated that MSFT has entered into large cloud deals that could be up more than 50%, indicating such deals are gaining momentum entering into 2022.\n\n\n\nWhat’s more, Ives believes that there is still room for Microsoft to penetrate the cloud market further, as he pegs MSFT’s current cloud penetration at 35%.\n\n\n\nThe analyst also approves of MSFT’s hike in the price of Office365 and thinks that it was a “smart strategic poker move that could be another $5 billion+ incremental tailwind for Redmond in 2022, giving more confidence that numbers could continue to move higher.”\n\n\n\nMSFT announced the price hike for its Office365 in August last year. Customers who were using a monthly subscription to Office365 faced a price rise of 20%.\n\n\n\nThe COVID-19 pandemic has forced many companies to switch to remote work or a hybrid model, where people come into work at the office for certain days of the week and at other times, work remotely.\n\n\n\nAnalyst Ives expects this trend will continue and will benefit companies providing cloud computing services like MSFT, Amazon (AMZN) with its Amazon Web Services (AWS), IBM (IBM), and Alphabet (GOOGL).\n\n\n\nBy the analyst’s estimate, the number of companies maintaining their workloads in the cloud will increase from 43% currently to 55% by the end of this year. What’s more, Ives expects that “global cloud spending will approach $1 trillion over the next decade,” effectively representing a $1 trillion total addressable market (TAM) for MSFT.\n\n\n\nEven as the stock has shot up 35.96% in the past year and is currently trading at a price-to-earnings ratio of 33.9, Ives still thinks that the stock could go up even higher over the next 6 to 9 months, “as the Street is still underestimating the underlying growth story in Redmond in our opinion.”\n\n\n\nMicrosoft remains one of Ives’ favorite technology picks for this year and the analyst remains bullish with a Buy rating and a price target of $375 (23.6% upside) on the stock.\n\n\n\nOverall, the rest of the analysts on the Street, are also bullish about the Microsoft growth story, with a Strong Buy consensus rating based on 27 Buys and 1 Hold. The average MSFT stock prediction of $375.12 implies upside potential of approximately 23.7% to current levels for this stock.\n\n\n\nThe Street’s bullish outlook on the stock is also supported by the Website traffic data tool available on TipRanks. This tool indicates that in the month of December alone, Microsoft’s unique visitors across all its domains were up 8.6% year-over-year to 1.6 billion. In calendar Q4, Microsoft’s unique visitors across all its domains have increased year-over-year by 8.5% to 4.9 billion.\n\n\n\n\n\n\n\nApple (NASDAQ: AAPL)\n\n\n\nApple, unlike technology giant Microsoft, is not in the cloud business, but the company competes with Microsoft when it comes to its personal computers business. Apple’s business of manufacturing smartphones, personal computers (PCs), tablets, wearables, and accessories suffered an impact of $6 billion in terms of revenues in the fiscal fourth quarter, due to supply chain constraints.\n\n\n\nThe company also stated on its earnings call that by its estimate, the adverse impact of supply chain shortages will be bigger during the December quarter, even as demand for AAPL’s products continues to be high.\n\n\n\nApple is expected to announce its December quarter results on January 27.\n\n\n\nThe company elaborated more on the supply chain constraints on its September quarter earnings call. While Apple expects that revenues will continue to show an upward trend for most of its categories, the company estimates that iPad revenues could trend downward in the December quarter due to these supply chain challenges.\n\n\n\nDo Wall Street analysts continue to see this trend persisting, just before its December quarter?\n\n\n\nUBS analyst David Vogt didn’t mention the iPad revenues but continues to see upside in iPhone and iMac, fueled by strong demand. That has led him Vogt raise his estimates for fiscal Q1 (December quarter) revenues from $117.5 billion to $119.6 billion and earnings from $1.85 per share to $1.91 per share.\n\n\n\nThe analyst added, “Despite near-term iPhone strength, we keep our FY2022 iPhone unit estimate unchanged at 230M as we prefer to be conservative given lingering supply chain headwinds and uncertain carrier promotional activity next fall and winter.”\n\n\n\nMoreover, the analyst’s channel checks indicated that supply chain challenges continued to improve on a month-over-month basis during the fiscal Q1 quarter. Vogt also mentioned that consumers continued to prefer high-end iPhone models like Pro and Max and are more likely to spend more than $1,000 on the iPhone.\n\n\n\nAs a result, the analyst raised his estimate for iPhone units by 3% from around 52.3 million to 53.8 million units for the March quarter. The analyst remained upbeat about the stock with a Buy rating and a price target of $175 (5.3% upside) on the stock.\n\n\n\nOther analysts on the Street echo Vogt and are also upbeat about Apple, with a Strong Buy consensus rating based on 22 Buys, 4 Holds, and 1 Sell. The average Apple stock forecast of $179.80 implies upside potential of approximately 8.2% to current levels for this stock.\n\n\n\nBut the Street’s bullish outlook on the stock is contrary to the Website Traffic data available on TipRanks. This data indicates that in the month of December alone, Apple’s unique visitors across all its domains were down 7.8% year-over-year to 241.1 million. In calendar Q4, Apple’s unique visitors across all its domains have also declined year-over-year 6.2% to 756.7 million.\n\n\n\n\n\n\n\nBottom Line\n\n\n\nAnalysts’ bullish stance on both stocks seems to be justified, considering that both companies are poised for growth, with MSFT and its cloud business and AAPL's effective management of supply chain challenges.\n\n\n\nBased on the upside potential over the next 12 months, MSFT seems to be a better Buy.\n\n\n\nDownload the TipRanks mobile app now.\n\n\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\n\n\nRead full Disclaimer & Disclosure."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=27bd8e255f1b45f6919478f8f1c4a259fa73e0a8ac68a0897517e050acd03d9d"}
{"Ticker":"MSFT","Date":1642657560,"Headline":"Here Are the 3 Best Growth Stocks to Buy for 2022","Source":"Nasdaq","Summary":"Well-chosen growth stocks can help you earn a fortune in the stock market. The key is to identify powerful long-term trends -- and the companies best positioned to profit from them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ae79f1f74a473bea4704752be8883bab192353faccd80b523613488a12271a9c"}
{"Ticker":"MSFT","Date":1642656780,"Headline":"What the Metaverse Has to Do With Microsoft’s Deal for Activision","Source":"DowJones","Summary":"Microsoft described the $75 billion acquisition of videogame giant as a pathway to the metaverse, a future vision of the internet that is the subject of growing hype."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54a1c1176a0718096f5e87d2e4479a4b6fc9101d86791c934876531cfb7a899a"}
{"Ticker":"MSFT","Date":1642650038,"Headline":"Sony Shares Rebound After Plunging in Response to Microsoft’s Acquisition of Activision Blizzard","Source":"Yahoo","Summary":"Sony shares staged a recovery on Thursday in Japan after previously plunging on news of Microsoft’s proposed acquisition of games giant Activision Blizzard. At the Thursday lunchtime trading halt in Tokyo, Sony Group Corp. shares were priced at JPY12,860 apiece, up 3.6% from their Wednesday close of JPY12,410. On Wednesday, the shares had fallen by […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41ffbdf2370c52aa7f4c6126554a71a8784d906da5ad30dd14e039c0c5f3a7c8"}
{"Ticker":"MSFT","Date":1642639840,"Headline":"Dow Jones Futures: Market Correction Extends Losses; Four Stocks In Beat-Up Sector Worth Watching","Source":"Yahoo","Summary":"The market correction worsened Wednesday. Some stocks in the beat-up software sector are worth watching."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e83ed04be732cf6ab008103c3eb5fe87bf3bb6946812c83e03e5b5d9128186e"}
{"Ticker":"MSFT","Date":1642645469,"Headline":"Sonos, Yelp Tell White House to Back Big Tech Antitrust Bill","Source":"Yahoo","Summary":"(Bloomberg) -- Amazon.com Inc. and Google parent Alphabet Inc. need to be regulated so smaller businesses can compete, a panel that included the chief executive officers of Sonos Inc. and Yelp Inc. told White House advisers Wednesday.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseWhy Some Vaccinated People Resist Omicron and Others Don’tCov"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=108135fc669867a55d5e676b79dccb2b59dbffdb5b78c71e4ad8fb27baf47cd3"}
{"Ticker":"MSFT","Date":1642643438,"Headline":"UPDATE 1-World Bank chief takes swipe at Microsoft's $69 bln gaming deal as poor countries struggle","Source":"Yahoo","Summary":"World Bank President David Malpass on Wednesday criticized Microsoft's $69 billion takeover of gaming developer Activision Blizzard as a questionable allocation of capital at a time when poor countries are struggling to restructure debts and fight COVID-19 and poverty.  Malpass said during a Peterson Institute for International Economics virtual event that more capital needed to flow into poor countries, but these flows have been disrupted by unusually easy monetary policies in developed countries.  He said he was struck by the scale of Microsoft's acquisition deal for https:\/\/www.reuters.com\/technology\/microsoft-buy-activision-blizzard-deal-687-billion-2022-01-18 \"Call of Duty\" maker Activision Blizzard."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=84093e1a12d2234c119b65dd78da4072f5eae26edd5bad399161e3d0daf410f6"}
{"Ticker":"MSFT","Date":1642640155,"Headline":"Microsoft Is Priced To Perfection","Source":"SeekingAlpha","Summary":"Cloud has begun to eat software and is projected to become the vast majority of enterprise software within the next few years. Microsoft is an industry leader in cloud with key advantages."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de55402f258341dc3dbee662f19d4fa01f0b04d25f902e078a49445a04719ab8"}
{"Ticker":"MSFT","Date":1642638394,"Headline":"Microsoft's Acquisition Of Activision: What's There For Investors","Source":"SeekingAlpha","Summary":"Microsoft will acquire Activision Blizzard in an all-cash deal valued at $68.7 billion. If the deal closes, Microsoft will become the world's 3rd largest gaming company in terms of revenue."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4f92999f00a8b26a9329bfc4ca9ba54ce209baf0bd8b2aa71c75fb7c80311b6"}
{"Ticker":"MSFT","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"MSFT","Date":1642759860,"Headline":"2 Reasons Activision Shareholders Shouldn't Be Quick to Sell Ahead of a Microsoft Deal","Source":"Nasdaq","Summary":"Microsoft's (NASDAQ: MSFT) proposal to buy top game publisher Activision Blizzard (NASDAQ: ATVI) is far from a done deal. On Tuesday, the software giant agreed to pay $68.7 billion, or $95 per share, in an all-cash deal to buy Activision."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a93ca76be9ce769b232c4b898dcb57834986ffddec998d20a0f9d5a6729cd44"}
{"Ticker":"MSFT","Date":1642755540,"Headline":"Where Will Snowflake Be in 1 Year?","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) has served its early investors well. Warren Buffett's Berkshire Hathaway invested in this stock before the IPO at a significantly discounted price. When Snowflake ultimately debuted for retail investors, it was priced at more than double the $120 per share"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dffdc165d9582d986761f7986ead652b390f6fc1191e78ad67b6d76e2c3058d"}
{"Ticker":"MSFT","Date":1642755437,"Headline":"Nasdaq set for lower open after disappointing Netflix forecast","Source":"Finnhub","Summary":"The Nasdaq index was set to open lower onFriday after a weak forecast from Netflix sent its shares alongwith other streaming companies spiraling lower, with WallStreet's main indexes headed for... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f2db17eacb166a19bf82a9f84c9228288610382e79e1636788d7a3f95a2dbd6c"}
{"Ticker":"MSFT","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"MSFT","Date":1642755064,"Headline":"MICROSOFT CORP : Jefferies maintains a Buy rating","Source":"Finnhub","Summary":"In his latest research note, analyst Brent Thill confirms his positive recommendation. The broker Jefferies is keeping its Buy rating. The target price remains unchanged at USD 400. | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6c38dab5e7284025fb828de099e75635b5a9ca54d198cbf5be33c503a5d1276"}
{"Ticker":"MSFT","Date":1642754100,"Headline":"Why Microsoft Shouldn't Have Bought Activision Blizzard","Source":"Nasdaq","Summary":"Microsoft (NASDAQ: MSFT) stunned the gaming industry on Jan. 18 by announcing that it would buy Activision Blizzard (NASDAQ: ATVI), one of the world's largest video game publishers, for $68.7 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ea1a6b9503f778ad68db22f6ec78a585bec94ff3105554548fa6192fecdd26cb"}
{"Ticker":"MSFT","Date":1642752360,"Headline":"Snowflake Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) launched the largest software IPO ever in September 2020. The cloud-based data warehousing company went public at $120 per share, started trading at $245, and hit an all-time high of $405 a share last November.But over the past two months, Snowflake's stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c125abffa32d67037717c3bc79bef2e14e44dca89823945e59098c1a23cea22c"}
{"Ticker":"MSFT","Date":1642748400,"Headline":"Netflix, Peloton Bring the Pandemic-Stock Era to Shuddering Halt","Source":"Yahoo","Summary":"(Bloomberg) -- The Covid-19 pandemic isn’t over yet, but the boom it helped create for stay-at-home stocks appears to be vanishing.Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessJeremy Grantham Doubles Down on Crash Call, Says Selloff Has StartedLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tThailand to Resume Quarantine-Free Tourism as Covid EasesNetflix Inc. and Peloton Interactive Inc.,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02e98e02ef263e0bba335d9ecbd98c6735903ade553e27e05dc4c8f887918fc5"}
{"Ticker":"MSFT","Date":1642732683,"Headline":"Pinnacle Wealth Management Advisory Group, LLC Buys Microsoft Corp, Apple Inc, Berkshire ...","Source":"Yahoo","Summary":"Investment company Pinnacle Wealth Management Advisory Group, LLC (Current Portfolio) buys Microsoft Corp, Apple Inc, Berkshire Hathaway Inc, Johnson & Johnson, FlexShares iBoxx 3-Year Target Duration TIPS Index, sells Foot Locker Inc, Direxion Auspice Broad Commodity Strategy ETF, SPDR Metals & Mining ETF, Alibaba Group Holding, CF Industries Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Pinnacle Wealth Management Advisory Group,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=34cff3b71913714313af573952ebda9a0b756cf9810dd0e95a6524d328f07477"}
{"Ticker":"MSFT","Date":1642725540,"Headline":"Microsoft’s Results Are Next Week. Why Analysts Are Upbeat.","Source":"Yahoo","Summary":"The earnings report is due after the close on Wednesday. Citi analyst Tyler Radke said he sees “a modestly positive set-up” for next week’s report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d8541600c9b52d65f6e6a34c9158777d3337abc75d5dea2f645bd1b0010671a"}
{"Ticker":"MSFT","Date":1642765020,"Headline":"Why Activision Blizzard Stock Popped This Week","Source":"Nasdaq","Summary":"What happened\nUnless you've been disconnected this week, you might have heard about Microsoft's (NASDAQ: MSFT) $68.7 billion all-cash deal to buy Activision Blizzard (NASDAQ: ATVI) at $95 per share. Shares of Activision were up 25.2% week to date as of 9:55 a.m. ET on Friday, acc"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8638554b36550f72f081e1c60200674a6ff4692c2003dcd253b116e13a71d665"}
{"Ticker":"MSFT","Date":1642763520,"Headline":"Workers at Activision Blizzard-owned studio Raven say they have formed union","Source":"Nasdaq","Summary":"A group of workers at Activision Blizzard-owned studio Raven Software said on Friday that they had formed a union with the with Communications Workers of America and would seek voluntary recognition from the company, which is set to be acquired by Microsoft."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2249fd9f5c89b2f7e8e65387dd7cefd218c32e5d1df2fb1d3670b0304ca8b3d7"}
{"Ticker":"MSFT","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"MSFT","Date":1642759860,"Headline":"2 Reasons Activision Shareholders Shouldn't Be Quick to Sell Ahead of a Microsoft Deal","Source":"Nasdaq","Summary":"Microsoft's (NASDAQ: MSFT) proposal to buy top game publisher Activision Blizzard (NASDAQ: ATVI) is far from a done deal. On Tuesday, the software giant agreed to pay $68.7 billion, or $95 per share, in an all-cash deal to buy Activision."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a93ca76be9ce769b232c4b898dcb57834986ffddec998d20a0f9d5a6729cd44"}
{"Ticker":"MSFT","Date":1642755540,"Headline":"Where Will Snowflake Be in 1 Year?","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) has served its early investors well. Warren Buffett's Berkshire Hathaway invested in this stock before the IPO at a significantly discounted price. When Snowflake ultimately debuted for retail investors, it was priced at more than double the $120 per share"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dffdc165d9582d986761f7986ead652b390f6fc1191e78ad67b6d76e2c3058d"}
{"Ticker":"MSFT","Date":1642755437,"Headline":"Nasdaq set for lower open after disappointing Netflix forecast","Source":"Finnhub","Summary":"The Nasdaq index was set to open lower onFriday after a weak forecast from Netflix sent its shares alongwith other streaming companies spiraling lower, with WallStreet's main indexes headed for... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f2db17eacb166a19bf82a9f84c9228288610382e79e1636788d7a3f95a2dbd6c"}
{"Ticker":"MSFT","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"MSFT","Date":1642755064,"Headline":"MICROSOFT CORP : Jefferies maintains a Buy rating","Source":"Finnhub","Summary":"In his latest research note, analyst Brent Thill confirms his positive recommendation. The broker Jefferies is keeping its Buy rating. The target price remains unchanged at USD 400. | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6c38dab5e7284025fb828de099e75635b5a9ca54d198cbf5be33c503a5d1276"}
{"Ticker":"MSFT","Date":1642754100,"Headline":"Why Microsoft Shouldn't Have Bought Activision Blizzard","Source":"Nasdaq","Summary":"Microsoft (NASDAQ: MSFT) stunned the gaming industry on Jan. 18 by announcing that it would buy Activision Blizzard (NASDAQ: ATVI), one of the world's largest video game publishers, for $68.7 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ea1a6b9503f778ad68db22f6ec78a585bec94ff3105554548fa6192fecdd26cb"}
{"Ticker":"MSFT","Date":1642752360,"Headline":"Snowflake Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) launched the largest software IPO ever in September 2020. The cloud-based data warehousing company went public at $120 per share, started trading at $245, and hit an all-time high of $405 a share last November.But over the past two months, Snowflake's stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c125abffa32d67037717c3bc79bef2e14e44dca89823945e59098c1a23cea22c"}
{"Ticker":"MSFT","Date":1642748400,"Headline":"Netflix, Peloton Bring the Pandemic-Stock Era to Shuddering Halt","Source":"Yahoo","Summary":"(Bloomberg) -- The Covid-19 pandemic isn’t over yet, but the boom it helped create for stay-at-home stocks appears to be vanishing.Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessJeremy Grantham Doubles Down on Crash Call, Says Selloff Has StartedLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tThailand to Resume Quarantine-Free Tourism as Covid EasesNetflix Inc. and Peloton Interactive Inc.,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02e98e02ef263e0bba335d9ecbd98c6735903ade553e27e05dc4c8f887918fc5"}
{"Ticker":"MSFT","Date":1642732683,"Headline":"Pinnacle Wealth Management Advisory Group, LLC Buys Microsoft Corp, Apple Inc, Berkshire ...","Source":"Yahoo","Summary":"Investment company Pinnacle Wealth Management Advisory Group, LLC (Current Portfolio) buys Microsoft Corp, Apple Inc, Berkshire Hathaway Inc, Johnson & Johnson, FlexShares iBoxx 3-Year Target Duration TIPS Index, sells Foot Locker Inc, Direxion Auspice Broad Commodity Strategy ETF, SPDR Metals & Mining ETF, Alibaba Group Holding, CF Industries Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Pinnacle Wealth Management Advisory Group,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=34cff3b71913714313af573952ebda9a0b756cf9810dd0e95a6524d328f07477"}
{"Ticker":"MSFT","Date":1642725540,"Headline":"Microsoft’s Results Are Next Week. Why Analysts Are Upbeat.","Source":"Yahoo","Summary":"The earnings report is due after the close on Wednesday. Citi analyst Tyler Radke said he sees “a modestly positive set-up” for next week’s report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d8541600c9b52d65f6e6a34c9158777d3337abc75d5dea2f645bd1b0010671a"}
