{"Ticker":"TSLA","Date":1641854880,"Headline":"Volkswagen sold 70,625 ID electric cars in China last year, missing targets","Source":"Nasdaq","Summary":"Volkswagen AG sold 70,625 of its ID electric vehicles in China last year, missing its goal of selling 80,000 to 100,000 cars, the company said on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=740c710e161613582793132f68b056ea626ab4c088463e5d7c15b46b2fae5474"}
{"Ticker":"TSLA","Date":1641854241,"Headline":"Tesla Strikes Battery-Metal Deal in Push to Ensure Supply","Source":"Yahoo","Summary":"(Bloomberg) -- Tesla Inc. agreed to purchase nickel supplies from miner Talon Metals Corp. as an expected surge in demand spurs automakers to secure access to battery metals and other electric-car parts.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameDip Buyers Drive U.S. Stock Rebound After Selloff: Markets WrapCyprus Finds Covid-19 Infections That Combine Delta and OmicronT Cells Triggered by Commo"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e218426c8b1994cb7a3f2680bd9177abd9bb36f1b54fc9a5f92abca7d79629bb"}
{"Ticker":"TSLA","Date":1641854160,"Headline":"Elon Musk-Backed Signal To Now Be Led By WhatsApp Co-Creator Brian Acton","Source":"Benzinga","Summary":"Matthew Rosenfeld, also known as Moxie Marlinspike, says he is replacing himself as CEO of Signal, a privacy-focused messaging application. \nWhat Happened: Marlinspike’..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=24d86e8355f7d4f780aa2261618463e320aea9aef79675f370a07cd3b88a1785"}
{"Ticker":"TSLA","Date":1641853099,"Headline":"Tesla signs deal for first U.S. nickel supply with Talon Metals","Source":"Reuters","Summary":"Tesla Inc has signed its first U.S. nickel supply deal, choosing Talon Metals Corp's Tamarack mine project in Minnesota due to plans to make the electric vehicle battery metal in a way it considers more environmentally friendly."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=948c6075f4a2cf530fe4b039593fe9dd27343d0ef928dc9ccd91e7513f3d28ca"}
{"Ticker":"TSLA","Date":1641852275,"Headline":"Apple is still bigger than all these companies combined","Source":"Yahoo","Summary":"King Apple still towers over its megacap peers despite the tech selloff"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a30df40725bdd7d32dbb07fcaa296c8e4bcda25a70d115ac9473e270b22b05f"}
{"Ticker":"TSLA","Date":1641850991,"Headline":"The top 50 stocks by market cap in the S&P 500","Source":"Yahoo","Summary":"Jared Blikre dives in the most valuable S&P stocks by market cap."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d3cf4f3bdb88e90c8e28f8953db1e260be088191334c12b0922cdee75efabbea"}
{"Ticker":"TSLA","Date":1641848340,"Headline":"LG revs up Asia’s green-car capital engine","Source":"Nasdaq","Summary":"HONG KONG (Reuters Breakingviews) -     Asia's capital markets are ready to fire on all cylinders for the electric-car boom. LG Chem is starting the regional frenzy with its $10.7 billion battery spinoff. For now, investors have good reasons to go a"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=960df7573f72283516e0dd91f61d59635b60c416b719d2f038dbbf4269a92dd5"}
{"Ticker":"TSLA","Date":1641847952,"Headline":"Tesla stock pares losses on bullish Goldman Sachs note","Source":"Yahoo","Summary":"Yahoo Finance's Ines Ferre discusses how Tesla stock is rebounding after Goldman Sachs raised their price target for the electric vehicle company."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c304c1920ebbb51eef6643e933b5cfa1db112f5e47e0ee25882bd44b7c81c06e"}
{"Ticker":"TSLA","Date":1641847595,"Headline":"Signal’s Marlinspike Stepping Down as CEO of Messaging App","Source":"Yahoo","Summary":"(Bloomberg) -- Moxie Marlinspike, the longtime chief executive officer of the encrypted messaging app Signal, announced that he is replacing himself.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameCyprus Finds Covid-19 Infections That Combine Delta and OmicronDip Buyers Drive U.S. Stock Rebound After Selloff: Markets WrapT Cells Triggered by Common Cold Fend Off Covid in StudyMarlinspike, who started"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75941c617af8207f695bbed5abf08388135ff504aa6b58e54497ad705ba8c511"}
{"Ticker":"TSLA","Date":1641843179,"Headline":"US STOCKS-Wall Street tumbles with Nasdaq leading declines","Source":"Yahoo","Summary":"Wall Street's main indexes tumbled on Monday with Nasdaq leading the declines as technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs.  While the Nasdaq pared its losses in the afternoon session it had earlier fallen as much as 10.37% below its intraday record level reached on Nov. 22."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=719ccaca4eeb516aaba47657d1e6c6747e1d94bc3a9aa737a6b214493d7257c1"}
{"Ticker":"TSLA","Date":1641841200,"Headline":"The New Solar Roof That Is Half The Price Of Tesla’s","Source":"Yahoo","Summary":"Tesla’s solar roof got plenty of media attention when it was launched but the tech giant has failed to dominate the market and now a new product is half the price of Tesla’s solar shingles"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=84225f49962d9cb649a8fddd74a8d97a65ec8ea44ada1ddc8573d09e8b9e4e3a"}
{"Ticker":"TSLA","Date":1641840507,"Headline":"Stock market is 'massively' overvalued, warns this strategist","Source":"Yahoo","Summary":"Buckle up stock market bulls, it could be a rough January."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c085fecb451c6457a941366206f0e1600996586429993ff5627ad2344dbacce5"}
{"Ticker":"TSLA","Date":1641839520,"Headline":"Tesla Inks Nickel Supply Deal With Talon Metals","Source":"Nasdaq","Summary":"(RTTNews) - Luxury electric car maker Tesla Inc (TSLA) has signed a nickel supply deal with Talon Metals Corp. (TLO)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2fed80d1a7d45bf70203babed9897791b0bfdf5d5c6602bfe1fc39b6af024320"}
{"Ticker":"TSLA","Date":1641837860,"Headline":"'Very important' Tesla factory in Austin nearly ready to produce Model Ys: Wedbush's Dan Ives","Source":"Yahoo","Summary":"Tesla is set to ramp up production at its Giga Austin factory in about a week, according to Wedbush."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00230eb58e9235855ce1e5e2ca7f8f870f7bc9d1eed809b18161f6a1e897d341"}
{"Ticker":"TSLA","Date":1641836948,"Headline":"US STOCKS-Wall Street tumbles as tech stocks extend slide","Source":"Yahoo","Summary":"Wall Street's main indexes tumbled on Monday, as heavyweight technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs.  The Nasdaq fell as much as 10.37% below its intraday record level reached on Nov. 22.  \"Big tech companies should do fine because rising rates don't really affect them too much,\" said Randy Frederick, managing director of trading and derivatives at Charles Schwab in Austin, Texas."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4579c24deeca58a202aa7df49c23c8b277564766d5dc1098e655510575101b0"}
{"Ticker":"TSLA","Date":1641835191,"Headline":"Nasdaq ekes out gain in late session comeback","Source":"Finnhub","Summary":"Wall Street's three major indexes stageda late-session comeback on Monday as the Nasdaq managed to ekeout a tiny gain and investors swooped in to hunt for bargains,while the S&P 500 and the Dow... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=30fd9881b1480026bd4a08c2a95c7e67655e9895451a612ff4b49da7064a7260"}
{"Ticker":"TSLA","Date":1641835140,"Headline":"US STOCKS-Nasdaq ekes out gain in late session comeback","Source":"Nasdaq","Summary":"Wall Street's three major indexes staged a late-session comeback on Monday as the Nasdaq managed to eke out a tiny gain and investors swooped in to hunt for bargains, while the S&P 500 and the Dow Jones Industrial Average finished well above their session lows."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bdec9f36a86a9f62f936a251023db8dea28785cd6de2a13d6c7bab57d31ef85"}
{"Ticker":"TSLA","Date":1641834760,"Headline":"Tesla price target raised at Goldman Sachs","Source":"Yahoo","Summary":"Tesla (TSLA) stock slid for a fifth straight session as growth names are declining during Monday's session. The pressure on shares of the electric vehicle giant come despite a bullish note from Goldman Sachs analyst Mark Delaney."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=80b48ec8facc1cf6abd93e7db3ea3fec1fe6586ceb6db009e0bff439d3ad7118"}
{"Ticker":"TSLA","Date":1641833661,"Headline":"Market check: Dow plunges 500+ points, 10-year yield climbs, crypto stocks sell off","Source":"Yahoo","Summary":"Yahoo Finance Live’s Jared Blikre breaks down how markets are moving in midday trading as  Amazon, Meta, Nvidia, Apple, Microsoft, and Tesla stocks underperform."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23051c7727a8de664ff7f6e53e77af35e8cb19a49006d092d0224be3b990ab44"}
{"Ticker":"TSLA","Date":1641833290,"Headline":"Why Tesla Stock First Crashed, Then Bounced Today","Source":"Yahoo","Summary":"The Nasdaq is having a rough morning, but the electric vehicle leader just got several pieces of good news from Wall Street."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55a8fe225076e68e579a38fe4c8f11d90fc6f5f155af7dea56b6a21e9abdd28f"}
{"Ticker":"TSLA","Date":1641830940,"Headline":"Don’t Steer Clear of Gores Guggenheim Stock","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3fa294190975cb2f795482cbb3dfeb4930e1617e3aa08abdc46113eeb19fd2d1"}
{"Ticker":"TSLA","Date":1641830841,"Headline":"Joe Manchin's former aides gain influential lobbying clients as their ex-boss battles Biden's agenda","Source":"CNBC","Summary":"Former aides to Sen. Joe Manchin who are now lobbyists are scoring big clients as their ex-boss battles President Biden's agenda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=13c03f30005f651331f2a34931690b9b040475aa5d00ff462ba2e15d7e764365"}
{"Ticker":"TSLA","Date":1641830520,"Headline":"GM and Ford Are Tech Companies Now. Just Look at the Stocks.","Source":"Yahoo","Summary":"Wall Street is getting more optimistic about GM and Ford stock and investors are too. That's good news for both, but it comes with one negative: days like Monday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e26aef987184f89b6e8fd8f53ebe1c6f51151b1146bc17a8658e9255c61f789b"}
{"Ticker":"TSLA","Date":1641830460,"Headline":"Wall Street closes lower with Nasdaq staging late session comeback","Source":"Nasdaq","Summary":"U.S. stocks ended down but well off their lows of the day, with the Nasdaq staging a furious comeback late in the session as some investors appeared to be hunting for bargains even as they worried about rising interest rates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=66e11fc8387f171a463844233a38f4393f8aeafc4f6cebcf7c0cd73ec437046f"}
{"Ticker":"TSLA","Date":1641829560,"Headline":"Tesla signs deal for first U.S. supply of nickel with Talon Metals","Source":"Nasdaq","Summary":"Tesla Inc on Monday said it has signed its first U.S. supply deal for nickel, choosing Talon Metals Corp's Tamarack mine project in Minnesota because of plans to make the electric vehicle battery metal using a process it considers more environmentally friendly."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0658ba24bdf7a37e1f3d3d3546979ec2e70af09e314d935a601fba1b8fe1d6e9"}
{"Ticker":"TSLA","Date":1641829039,"Headline":"Market check: Stocks fall in early trading, tech renews declines, Tilray shares soar","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre joins Yahoo Finance Live to discuss the stock market as Amazon drops to its lowest level since May 2021, Tesla faces its fifth day of losses this week, and Tilray shares soar 18% even with the overall market being down."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c0fc286ad580875817a22d7c7d29c0de7ffb5515259d2ee13be63c756984784"}
{"Ticker":"TSLA","Date":1641828120,"Headline":"Tesla Stock Can Soar in 2022 Even if the Fed Hikes Rates Four Times","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=27df49a7bebf57fbe6882100f358f541f595f96ce169cf2b8b8fe1997139c69d"}
{"Ticker":"TSLA","Date":1641827700,"Headline":"Tesla Is a Goldman Sachs Top Pick for 2022. The Stock Is Dropping Anyway.","Source":"Yahoo","Summary":"Analyst Mark Delaney increased his price target for the electric-vehicle stock and maintained his Buy rating."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=528c022d1d65a32e2d4ad0724aae67f8acab526d17dbdecdb622b7f951a3af9c"}
{"Ticker":"TSLA","Date":1641827010,"Headline":"Dow Jones Sells Off As Yields Rise; AMD, Tesla Slide, While Apple Chipmaker Rises On Strong Sales","Source":"Yahoo","Summary":"The Dow Jones Industrial Average lost 300 points Monday, as Treasury yields rose. Tesla stock sold off sharply in morning trade."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a1591081d1cfa42319f77c48b68acaec2052c93218b223ad77d4dd082169e1d9"}
{"Ticker":"TSLA","Date":1641826020,"Headline":"Is BYD Stock a Buy?","Source":"Yahoo","Summary":"Chinese company BYD (OTC: BYDDY) (OTC: BYDD.F) is solidifying its position in the global electric vehicle (EV) market. BYD sold 593,745 electric vehicles, including 272,935 plug-in hybrids, in 2021. That makes it the fourth largest EV manufacturer in the world after Tesla (NASDAQ: TSLA), Volkswagen (OTC: VWAGY), and SAIC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bf40a28c1d8cc9d8edd11f7049267058485a157efabdf57fef0fc3969ff20a1"}
{"Ticker":"TSLA","Date":1641825960,"Headline":"Tesla Stock: Is Tech Edge Enough over Competitors?","Source":"Nasdaq","Summary":"I am neutral on Tesla (NASDAQ: TSLA) as it has a very strong moat, rapid growth momentum, and a compelling technological edge that should serve it well moving forward. \n\n\n\nOn the other hand, it trades a massive valuation multiple premium.\n\n\n\nTesla is a manufacturer of home power storage and car batteries, solar panels, and EVs. The EV manufacturing company was founded in 2003; the company gained massive following after the release of Tesla Roadster, the world’s first electric sports car. \n\n\n\nIts customers are spread across the globe and Tesla has over 70,757 employees in total, according to the 2020 reports. Its factory is located in Fremont, California, and the headquarters are in Austin, Texas. \n\n\n\nIt is also known as one of the most valuable automakers in the industry that is constantly working toward sustainable, budget-friendly solutions for its targeted customer base.\n\n\n\nStrengths\n\n\n\nIn 2021, Tesla’s Model 3 became the first electric car to cross the 1-million mark for total units sold across the globe. Innovative capabilities and a niche target audience give this company a greater competitive edge than some its competitors in the industry. \n\n\n\nIn 2019, Tesla was also named one of the best employers of the year by Forbes, and its employment rate has only increased since then. Highly skilled and talented employees aside, the company is also known as the leading automotive company, after the spike in Tesla Model 3 sales. \n\n\n\nThe strong brand image and customer-focused approach give Tesla robust brand equity.\n\n\n\nRecent Results\n\n\n\nIn 2020, the total revenues generated by Tesla reached $31.5 billion and gross profit reached $6.6 billion. In 2019, these numbers totaled $24.6 billion and $4.1 billion, respectively. The basic and diluted earnings per share finally showed a positive trend since the 2016 results, with $0.74 and $0.64 attributed to them, respectively.\n\n\n\nThe gross margin also increased to 21% in 2020, compared to 17% and 19% in 2019 and 2018, respectively. The R&D expenses as a percentage of revenues remained consistent between 2019 and 2020 at 5%.\n\n\n\nIn 2021, TSLA has seen massive growth, with revenues expected to rise by 65.3%, EBITDA expected to soar by 88%, and normalized net income expected to nearly triple.     \n\n\n\nValuation Metrics\n\n\n\nTSLA stock looks richly priced at the moment. Its enterprise value-to-EBITDA ratio is high relative to its history at 63.4x compared to its historical average of 40.7x. \n\n\n\nMoreover, its P\/E ratio is also very elevated at 111.5x compared to its historical average of 66.4x.\n\n\n\nWall Street’s Take\n\n\n\nAccording to Wall Street analysts, TSLA earns a Moderate Buy analyst consensus based on 15 Buy ratings, nine Hold ratings, and six Sell ratings in the past three months. Additionally, the average Tesla price target of $1,028.59 puts the upside potential at 0.2%.\n\n\n\n\n\n\n\nSummary and Conclusions\n\n\n\nTesla is a clear global leader in EVs as it boasts best-in-class technology, particularly on the battery front. \n\n\n\nIt is led by visionary CEO Elon Musk, has finally proven that it can be profitable, is growing rapidly, and it also possesses a compelling advantage in artificial intelligence and autonomous driving technology. The future certainly looks bright for the company.\n\n\n\nThat said, the stock has soared in recent years which means that the valuation is extremely stretched.\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRead full Disclaimer & Disclosure"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c19662fe186a7382a14b47b012927f4b7e7821a79a88f49c677da2b0ceaa81d8"}
{"Ticker":"TSLA","Date":1641825120,"Headline":"Wall Street tumbles with Nasdaq leading declines","Source":"Nasdaq","Summary":"Wall Street's main indexes tumbled on Monday with Nasdaq leading the declines as technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d2d365624a95a1f82096be1e5c107ce19ab0bddd8740182e3a18a6b764998f0"}
{"Ticker":"TSLA","Date":1641823893,"Headline":"Tesla built $1.1B Austin-area factory in a year and a half — here's how it looks now","Source":"Yahoo","Summary":"In roughly a year and a half, construction crews have substantially completed Tesla's electric vehicle plant, measuring at least 4.28 million square feet, and the company has begun to secure the paperwork necessary to start production. Click through to see what the factory looks like now and how construction has progressed since summer 2020."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d2b717089ca8f4c12976177a92bda7c4f73919addee5ab8675bb83fa6ac5ff4d"}
{"Ticker":"TSLA","Date":1641823415,"Headline":"10 Best EV Battery Stocks To Invest In","Source":"Yahoo","Summary":"In this article, we discuss the 10 best EV battery stocks to invest in. If you want to skip our detailed analysis of these stocks, go directly to the 5 Best EV Battery Stocks To Invest In. The rising global adoption of electric vehicles has expanded the race among battery manufacturers. According to Deloitte, total EV […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ca50f7dd6f05424249c3a896f8b099fecc17fd3ded23057db6455daf0200f142"}
{"Ticker":"TSLA","Date":1641823080,"Headline":"Market Update: Why Are Stocks Down Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=336770503c1e910a0d802655aea57e977a141ae1ee9093a759809cce84e3d086"}
{"Ticker":"TSLA","Date":1641822935,"Headline":"US STOCKS-Nasdaq set to open lower as tech stocks extend declines","Source":"Yahoo","Summary":"Nasdaq futures fell 1% on Monday as heavyweight technology stocks dropped on expectations of a high interest rate environment, while big banks extended gains after U.S. Treasury yields climbed to new two-year highs.  Megacap growth companies including Apple Inc, Amazon.com Inc, Microsoft Corp, Meta Platforms Inc and Tesla Inc fell between 1.2% and 2.8% in premarket trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6e6b514a9b12c20f54b2f9e22d01ecdaada0e3ea1a2e29e2d3d5dfc8bca8597"}
{"Ticker":"TSLA","Date":1641822378,"Headline":"Ark Invest CEO Cathie Wood’s Strategic Investments – Report","Source":"Yahoo","Summary":"Cathie Wood, the CEO of investment firm Ark Invest seems to be interested in growth stocks for 2022. According to a tweet, Wood invested in high-growth stocks in the first week of the year while selling shares in EV maker Tesla (NASDAQ: TSLA), DocuSign, and social networking company Twitter. Notably, Wood has offloaded a massive stake in Tesla since September, selling shares worth $140 million in the last week. Additionally, Ark sold DocuSign shares worth $180 million and $95 million worth of Tw"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b01ce796a0d8456af4ad44e079f5d59babd80febb4007d6bb603d20c2cbbaa0"}
{"Ticker":"TSLA","Date":1641822360,"Headline":"Tesla Battery Supplier LG Energy Eyes $11B IPO: What You Need to Know","Source":"Benzinga","Summary":"South Korea's LG Energy Solutions, which  supplies  EV batteries to the likes of Tesla, Inc. (NASDAQ: TSLA), Ford Motor Company (NYSE: FM) and Volkswagen AG (PNK: VWAGY), is..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0281a7de953eb9db390fa6fe2e6b79c3d1f837d1fcda8ad59bdf517321bc5b5d"}
{"Ticker":"TSLA","Date":1641820704,"Headline":"Dow Jones Futures Fall, Nasdaq Futures Off Sharply With Market Rally At Key Levels; What To Do Now","Source":"Yahoo","Summary":"The 2022 market has been an expectation breaker so far, with the Nasdaq and Tesla selling off hard. Here's what to do now."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e687cc3224f201266c0e3f47eff0066bbde5a1a0dadafadea648f85be0da762"}
{"Ticker":"TSLA","Date":1641820320,"Headline":"This Robot Trader Is Betting on Big Gains for Tesla and Nvidia Stock. It’s Been Right Before.","Source":"Yahoo","Summary":"This artificial intelligence-powered ETF ditched Netflix, Merck, and three other familiar stocks this month. Here's what it bought."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=32ca252b8181916afc106097637756906e36055e51ab6c719ad48724bba73d48"}
{"Ticker":"TSLA","Date":1641818352,"Headline":"The Zacks Analyst Blog Highlights: Ford, General Motors, Stellantis, Tesla, and Rivian","Source":"Yahoo","Summary":"Ford, General Motors, Stellantis, Tesla, and Rivian have been included in this analyst blog."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=68da257f578a6b28f4e6bac4e8f6970050e6fcd3ad3aad8d7cb0c16913405bc3"}
{"Ticker":"TSLA","Date":1641817037,"Headline":"US STOCKS-Futures muted, banks extend gains on high yields","Source":"Yahoo","Summary":"U.S. stock index futures were subdued on Monday after posting losses for their first week of the new year, while big banks extended gains as U.S. Treasury yields climbed a new two-year high.  The benchmark 10-year Treasury yield hit 1.80% in early trading - a level last seen in early 2020, having shot up 25 basis points last week in its biggest move since late 2019.  Big banks like JPMorgan Chase & Co, Goldman Sachs , Bank of America Corp, Morgan Stanley and Citigroup Inc gained between 0.3% and 0.8% in premarket trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bb6b738050262ead96e1238d7ec107e2a5670fc2e1366a70914b375065faede2"}
{"Ticker":"TSLA","Date":1641812039,"Headline":"It's A Bear Market, No Wait, It's A Bull Market","Source":"SeekingAlpha","Summary":"A lot of digital ink is spilled debating whether we are in a continued bull market or when the next market crash will arrive. Read what to know here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54d260ad37c17a04b1230d6e64f11427bd6c231d46f8231b4a49166dd0016730"}
{"Ticker":"TSLA","Date":1641810900,"Headline":"EV Stocks: Why Are TSLA, RIVN, XPEV, RIDE, NKLA and LCID Riding Lower Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=20e54dc9e46fcd67b0ab922744fa397ef1cc0d1df0694d688bd6cc3d23e227c5"}
{"Ticker":"TSLA","Date":1641809644,"Headline":"TESLA : Goldman Sachs gives a Buy rating","Source":"Finnhub","Summary":"Mark Delaney from Goldman Sachs retains his positive opinion on the stock with a Buy rating. The target price has been lifted and is now set at USD 1200 compared to USD 1125 before. | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aaa1d655603c5ecc282dae6ef3c8eca69f0cbd990199aa5c2ca737311da7cf2f"}
{"Ticker":"TSLA","Date":1641808800,"Headline":"3 Reasons Why Austin is a Homebuyer's Dream in 2022","Source":"Nasdaq","Summary":"Austin, Texas, fell from the No. 1 spot in 2021 to No. 10 in 2022 on Zillow's list of hottest housing markets in America. Tampa, Florida, has assumed the top spot, but Austin is still a very robust market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=14aeb2dbe08e2af639c8281878779151fc56efb1078af62e6ead5a281658e98d"}
{"Ticker":"TSLA","Date":1641807180,"Headline":"Benzinga Asks: Which Company Could Join The $1-Trillion Market Cap Club Next? Did NVDA, TSM, BRKA Or TCEHY Win?","Source":"Benzinga","Summary":"Several of the largest technology companies made headlines in 2021 for hitting significant market capitalization milestones.\nMicrosoft Corp (NASDAQ: MSFT) hit a $2-trillion market..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36cdad239316c49c6bfaa7654643f204a7a793f32f002d0246509d9c824c7132"}
{"Ticker":"TSLA","Date":1641804000,"Headline":"How to Beat the S&P 500 in 2022","Source":"Nasdaq","Summary":"Famous investor Warren Buffett is famous for (among other things) winning a bet that money parked in an S&P 500 (SNPINDEX: ^GSPC) index fund would outperform professional money managers over 10 years. It's not easy to consistently beat a collection of the world's largest and most"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afadb65b82cea7ebda29107f534ec77be0814d7da41c125b1196569864ae78a3"}
{"Ticker":"TSLA","Date":1641802920,"Headline":"METALS-Nickel price buoyed by strong demand, dwindling stocks","Source":"Nasdaq","Summary":"Nickel prices held near their highest in more than two months on Monday boosted by demand from the electric vehicle battery sector lowering stocks held in London Metal Exchange (LME) approved warehouses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5a75c65eb436f3d604e32d9f9979a3afd6b057fbeaa519a4ca18617694c8feae"}
{"Ticker":"TSLA","Date":1641799080,"Headline":"5 Stocks Insiders Are Selling","Source":"Benzinga","Summary":"When insiders sell shares, it indicates their concern in the company’s prospects or that they view the stock as being overpriced. Either way, this signals an opportunity to..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0b216971fc139558eb204221cb352f9f953438df788edd6e3079757842d6984d"}
{"Ticker":"TSLA","Date":1641798765,"Headline":"Intel Drops A Bomb On The Robotaxi Industry","Source":"SeekingAlpha","Summary":"Intel’s (INTC) Mobileye is currently in volume production of SuperVision. Check out why I think Mobileye is well positioned in autonomous driving space."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=081fa64835b7e6196279200f15da5dc9cdc87a2aaf93189aa7d048a737bc37b7"}
{"Ticker":"TSLA","Date":1641795600,"Headline":"Apple Sought Japanese Auto Parts Maker's Help For Apple Car Project: Report","Source":"Benzinga","Summary":"Apple Inc. (NASDAQ: AAPL) had sought Japanese auto parts maker Sanden’s help two years ago for high-performance components related to the Apple Car project, Nikkei Asia..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=868b87b46ab7cf6cb7624ab68b562dc6915090c275752416e3f9d832a011b98c"}
{"Ticker":"TSLA","Date":1641795000,"Headline":"Tesla vs. NIO: Which EV Stock Will Gear Up in 2022?","Source":"Nasdaq","Summary":"Electric vehicles, or EV stocks, have been dominating the headlines recently, as their Q4 production and delivery numbers trickle in. Competition is also heating up in this sector, as new entrants like Rivian (RIVN) gear up to compete with existing incumbents like Tesla.\n\n\n\nMeanwhile, Tesla is eyeing new markets like India, as the EV market globally is getting a boost with a friendly regulatory environment and government initiatives.\n\n\n\nUsing the stock comparison tool, let us compare two EV stocks, Tesla and NIO, and predict whether the uptick in Q4 delivery numbers could continue, using the website traffic data for these companies as a gauge.\n\n\n\nTesla (NASDAQ: TSLA)\n\n\n\nTesla investors cheered in the New Year as the EV giant said that it had delivered 308,000 vehicles in Q4, a 27.6% jump in vehicle deliveries, quarter-over-quarter. In full-year 2021, it delivered 936,172 vehicles versus 499,647 vehicles that the company delivered in 2020 – a rise of 87% year-over-year.  The company’s vehicle deliveries were also a notch above consensus estimates of 893,755.\n\n\n\nThe stellar delivery numbers came in at a time when automobile manufacturers were plagued by supply shortages.\n\n\n\nThe strong delivery numbers led Mizuho Securities analyst Vijay Rakesh to be positive about TSLA's performance in 2022, as the company’s factories in Austin and Berlin start production of its cars. Moreover, the analyst pointed out that the rise in deliveries of TSLA’s Cybertruck and 4680 batteries would result in the expansion of TSLA’s portfolio “into additional auto segments and driving down the battery cost curve.”\n\n\n\nTSLA is focusing on lowering battery costs and adding to its available sources of supply of battery cells by manufacturing its own battery cells.\n\n\n\nWhile Rakesh believes that the company’s gross margins could improve over time, 2022 could see some gross margin headwinds as initial production at Tesla’s factories in Texas and Berlin gradually ramps up. At least at the outset, the full potential capacity of these plants could be underutilized.\n\n\n\nTSLA delivered a gross margin of 26.6% in Q3 on revenues of $13.76 billion.\n\n\n\nThe analyst remains bullish on the stock with a Buy rating and raised the price target from $950 to $1300 (26.6% upside) on the stock.\n\n\n\nRest of the Street is cautiously optimistic about the stock with a Moderate Buy consensus rating based on 15 Buys, 9 Holds, and 5 Sells. The average Tesla stock prediction of $1,053.73 implies upside potential of 2.6% to current levels for this stock.\n\n\n\nIt is important here to note that TSLA also sells its EVs through its website, and visits to its website are telling. An indication of the strong delivery numbers in Q4 is also supported by the company’s Website traffic data. \n\n\n\nThis data, provided by SEMrush Holdings (SEMR) and available through the TipRanks Website Traffic tool, indicates that in Q4, unique visitors to the TSLA website were up 5.1% year-over-year and increased approximately 8.9%, quarter-over-quarter.\n\n\n\n\n\n\n\nNIO (NYSE: NIO)\n\n\n\nNIO designs, develops and manufactures premium electric vehicles. The company’s main market is China, but it has also made a foray into the European market.\n\n\n\nThis EV maker also delivered stellar delivery numbers and achieved a new quarterly record in Q4. The company delivered 25,034 vehicles in Q4, up 44.3% year-over-year and 10,489 vehicles in December alone, an increase of around 50% year-over-year.\n\n\n\nNIO’s vehicle deliveries in 2021 soared 109.1% year-over-year to 91,429 vehicles.\n\n\n\nMizuho Securities analyst Vijay Rakesh was upbeat about these delivery numbers, in spite of production constraints due to supply chain shortages and “production line upgrades.”\n\n\n\nThe analyst is optimistic about NIO’s 2022 performance, as the company increases production and plans to launch its ET7 and ET5 sedans in March and September this year, respectively. NIO is also ramping up its plans to expand globally, including in countries like Norway, Germany, and the Netherlands.\n\n\n\nET7 is the company’s flagship premium smart electric sedan while ET5 is NIO’s mid-sized premium smart electric sedan.\n\n\n\nRakesh believes that the company’s ET5 could be a “viable competitor to the Tesla Model 3” and Lucid Group’s (LCID) vehicles.\n\n\n\nThe analyst is upbeat, with a Buy rating and a price target of $65 (121.8% upside) on the stock.\n\n\n\nRest of the analysts echo Rakesh and are bullish with a Strong Buy consensus rating based on 7 Buys and 1 Hold. The average NIO stock prediction of $61.86 implies upside potential of 111.1% to current levels for this stock.\n\n\n\nNIO sells its vehicles through a combination of offline sales and online sales through its mobile application.\n\n\n\nUsing the TipRanks website traffic data for NIO, we see that total unique visitors to the NIO site on mobile are up 19.1% year-over-year in Q4.  Since China is a major market for NIO, the website traffic data for China is encouraging.\n\n\n\nInterestingly, going by the website traffic data for Tesla in China, it seems that the company continues to make waves there.\n\n\n\nTesla’s unique visitors in China across all devices soared 251% in the month of December to 148,300.\n\n\n\nIn Q4, for NIO, total unique visitors to the site in China across all devices are up 22.5% year-over-year to 48,500, while monthly unique visitors in China in December were up a whopping 392.2% to 22,200.\n\n\n\n\n\n\n\nBottom Line\n\n\n\nWhile analysts are cautiously optimistic about Tesla, they are bullish about NIO. Going by the upside over the next 12 months, NIO does seem to be a better Buy.\n\n\n\nDownload the TipRanks mobile app now.\n\n\n\nDisclosure: At the time of publication, Shrilekha Pethe did not have a position in any of the securities mentioned in this article.\n\n\n\nDisclaimer: The information contained in this article represents the views and opinion of the writer only, and not the views or opinion of TipRanks or its affiliates.  Read full Disclaimer & Disclosure"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=18c5ad3c236022e7173e37b3367f972d29f6823159e9d7f6362e6cd319b4c592"}
{"Ticker":"TSLA","Date":1641794760,"Headline":"Investing in This ETF Right Now Could Make You a Millionaire Retiree","Source":"Nasdaq","Summary":"So you want to amass a million dollars by retirement, and you'd like to get there by investing in an exchange-traded fund (ETF) -- a fund that trades like a stock. That's a fine plan (though some people might want to aim for more than a million dollars).There are more than 2,500"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=020f5e840ab6a7914f0fb69aba36c67c9a03fb7568c333c55ae5828580564a89"}
{"Ticker":"TSLA","Date":1641794400,"Headline":"Down 17% in First Week of 2022, Rivian Stock Looks Extremely Undervalued","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=52c6bf1cebeb602f99fca72fd6d7d43dbd27028209ad2cde3295ab76c39662ec"}
{"Ticker":"TSLA","Date":1641794400,"Headline":"FOCUS-Forget shareholder resolutions, fund manager says: hire better directors","Source":"Nasdaq","Summary":"A Texas-based fund manager is not jumping on the bandwagon of peers backing shareholder resolutions that call on companies to take stronger action on climate change. Dimensional Fund Advisors argues it would be more effective to just replace corporate directors who fail to address the issue."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f52c7ad2086e021d516237921ffe7dc704ed1ce3f844dca2aa27da8dd77fb91c"}
{"Ticker":"TSLA","Date":1641793860,"Headline":"A Peek Into The Markets: US Stock Futures Edge Higher; Crude Oil Up 0.5%","Source":"Benzinga","Summary":"Pre-open movers\nU.S. stock futures traded slightly higher in early pre-market trade after the three major averages recorded losses last week. Investors are awaiting earnings..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c798d17b5b48d9c44b05110ccfa776922c18c5702ad5c604017945b579ae5fa8"}
{"Ticker":"TSLA","Date":1641790920,"Headline":"Ahead of IPO, S.Korea's LG Energy Solution flags market share, profit ambitions","Source":"Nasdaq","Summary":"Days before pricing its $10.7 billion IPO, South Korean battery maker LG Energy Solution (LGES) forecast its market share would overtake main rival CATL thanks to its wider range of customers and said it was aiming for a double-digit operating margin."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a02362f31630ea70063ad46e0aac6755bf4025fad10891597302ada648babeed"}
{"Ticker":"TSLA","Date":1641785760,"Headline":"Sector Themes In Play In The Markets For 2022","Source":"SeekingAlpha","Summary":"Dips will continue to be bought unless something significant changes. Click here for more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6d62d8f286b6960b7a4db16d3b514067ec4d996e1556715b87302038aa4bdd9"}
{"Ticker":"TSLA","Date":1641785700,"Headline":"Tesla Hikes Price on Full Self-Driving to $12K","Source":"Nasdaq","Summary":"The world’s largest electric vehicle (EV) maker Tesla, Inc. (TSLA) is increasing the price of its Full Self-Driving (FSD) feature to $12,000, effective from January 17, 2022. Meanwhile, TSLA shares closed down 3.5% at $1,026.96 on January 7.\n\n\n\nFSD Feature\n\n\n\nTesla formally released the FSD Beta Button in the last week of September to select drivers based on their safety scores. In October 2022, the price of the FSD was raised by $2,000 for the first time.\n\n\n\nThe latest price hike was announced by CEO Elon Musk in a tweet saying, “Tesla FSD price rising to $12k on January 17.” The reason for the price hike remains unknown.\n\n\n\nAccording to the Society of Automotive Engineers (SAE) standard, Tesla’s FSD feature is currently rated at Level 2, which implies that the autonomous vehicle can control both steering and speed. The level requires  the driver to be attentive and take control of the car when required.\n\n\n\nTesla regularly updates its FSD Beta feature once every two weeks. The FSD feature comes at a subscription fee of $99 per month and can be canceled at any time. The feature includes navigation on Autopilot Beta, auto lane change, smart summon, Traffic and Stop Sign control Beta, Autosteer, and Traffic-Aware Cruise Control.\n\n\n\nAnalysts’ View\n\n\n\nRecently, analyst Daniel Ives of Wedbush reiterated a Buy rating on the stock with a price target of $1,400, which implies 36.3% upside potential to current levels.\n\n\n\nAccording to Ives, Tesla’s Giga factories in Berlin and Austin are a focal point for the Street. Ives is very optimistic about the production of Model Y, which he believes will have a massive year in 2022.\n\n\n\nThe analyst said, “Based on our analysis of Giga Austin it appears paperwork is now clearing the way for Model Y production starting over the next 7-10 days. We also believe the stamping machines for Model Y and testing is already in place and mostly completed, with paperwork now filed by Tesla to officially start key production in Austin over the next week.”\n\n\n\nOverall, the stock has a Moderate Buy consensus rating based on 15 Buys, 9 Holds, and 5 Sells. The average Tesla price target of $1,053.73 (2.6% upside potential to current levels). Meanwhile, TSLA shares have gained 26.6% over the past year.\n\n\n\nBlogger Opinions\n\n\n\nAccording to TipRanks data, financial bloggers opinions are 73% Positive on TSLA, in line with the EV stocks sector average of 73%.\n\n\n\n\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRelated News:Bed Bath & Beyond Misses Q3 Expectations; Meme Frenzy Drives the Shares UpNikola Signs LOI with Saia; Shares Soar Above 9%Uber to Stop Uber Eats Restaurant Delivery in Brazil"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e994592e92be7229957183eda3493fe8229e6b4fe4b84ebb1adc4f68049314fa"}
{"Ticker":"TSLA","Date":1641784440,"Headline":"SpaceX Gearing Up For Second Orbital Launch Of The Year To Deploy Smaller Satellites","Source":"Benzinga","Summary":"​Tesla Inc (NASDAQ: TSLA) CEO Elon Musk-led SpaceX is planning a second orbital launch of the year aboard the reusable Falcon 9 rocket later this week to transport dozens of..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=82ea76f9294a291558c96d7470b4c94c2bf8b4efe96cbe855b01431f870f8897"}
{"Ticker":"TSLA","Date":1641773424,"Headline":"Dow Jones Futures Fall With Market Rally At Key Levels; What To Do Now","Source":"Yahoo","Summary":"The 2022 market has been an expectation breaker so far, with the Nasdaq and Tesla selling off hard. Here's what to do now."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=072973e97a2ba10b1be14c55a86bc2bcc2847da0b51d6bdb6f039857dbcd1be4"}
{"Ticker":"TSLA","Date":1641778320,"Headline":"S.Korea's LG Energy Solution expects its global market share to overtake rival CATL's","Source":"Nasdaq","Summary":"South Korean battery maker LG Energy Solution (LGES) said on Monday it expects its global market share to become bigger than that of its Chinese rival Contemporary Amperex Technology Co Ltd (CATL) because it has a more diverse customer base."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c65c775fc8a34244f94b758cba4724b21a4c0d81f811bf1c8123e962cc2f22b"}
{"Ticker":"TSLA","Date":1641775800,"Headline":"Apple Rivals Microsoft, Blackberry, Nokia Laughed At iPhone, Shrugged It Off And Flung It To The Ground As Steve Jobs Lifted The Curtains —  15 Years Later, Here We Are","Source":"Benzinga","Summary":"Fifteen years ago, the world was introduced to the iPhone for the very first time by Apple Inc (NASDAQ: AAPL) co-founder Steve Jobs.\nThe iPhone Debut: Jobs made the announcement..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=745fa47b8a28ac80c787a13587f3c0a3f72f57a51f998001fbdd71ea4f48815e"}
{"Ticker":"TSLA","Date":1641772882,"Headline":"Bitcoin: Top 10 'buy the dip' investors","Source":"Yahoo","Summary":"From Elon Musk to Jack Dorsey, and Ark Investment's Cathie Wood, here's how world's top crypto believers gathered more bitcoin when it was falling."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c11f4de20bcf0095f2cfb918ce6a627fbdbbf27dcc39644ae371ab662d5f0b6e"}
{"Ticker":"TSLA","Date":1641944580,"Headline":"Why Alibaba And Other Tech Stocks Are Shooting Up In Hong Kong Today","Source":"Benzinga","Summary":"Shares of U.S.-listed Chinese tech companies surged in Hong Kong on Wednesday, leading the benchmark Hang Seng Index notably higher.\nWhat’s Moving: Shares of Alibaba Group..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5706f1a8483b94408db382fbf75860f8ee1dd99b0dfc48c8aec91e63b78514e6"}
{"Ticker":"TSLA","Date":1641943680,"Headline":"METALS-Industrial metals rise as dollar drops after Powell testimony","Source":"Nasdaq","Summary":"Industrial metals rose on Wednesday, lifted by the dollar that weakened after U.S. Federal Reserve Chairman Jerome Powell made less hawkish comments during his renomination hearing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2843f196586c76b9a174633e59c93429024249a7571a67340df3dfa2e1c79e28"}
{"Ticker":"TSLA","Date":1641942091,"Headline":"Tesla is losing its head of human resources to a startup","Source":"Yahoo","Summary":"Valerie Capers Workman is joining the company behind the Handshake recruiting service as its chief legal officer"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=94a4166a285e56a3031ca030c93129c0b7613634cdb7507ff419413e2be6c8a2"}
{"Ticker":"TSLA","Date":1641941110,"Headline":"Tesla (TSLA) Gains But Lags Market: What You Should Know","Source":"Yahoo","Summary":"In the latest trading session, Tesla (TSLA) closed at $1,064.40, marking a +0.59% move from the previous day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa9e772ad11a59e4785f91a6d7c41fd84a987e4d54ba1169730ac36ac3b2a08b"}
{"Ticker":"TSLA","Date":1641940681,"Headline":"Lynch & Associates Buys NVIDIA Corp, Ford Motor Co, PROSHARES TRUST, Sells Taiwan ...","Source":"Yahoo","Summary":"Investment company Lynch & Associates (Current Portfolio) buys NVIDIA Corp, Ford Motor Co, PROSHARES TRUST, sells Taiwan Semiconductor Manufacturing Co, Tesla Inc, BP PLC, Wells Fargo, Sylvamo Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Lynch & Associates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6d335a2cff0d1a7100db536e52b6c84c6e3ea1853f2f2adc0c9bb379e1b528a4"}
{"Ticker":"TSLA","Date":1641940096,"Headline":"Electric vehicles: Audi's ‘entire portfolio will be fully electric’ by 2025, executive says","Source":"Yahoo","Summary":"Audi of America President Daniel Weissland joins Yahoo Finance Live to discuss 2021 car sales, the automaker's electric vehicle portfolio, its timeline for phasing out internal combustion engine vehicles, and the outlook for EVs and autonomous driving."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de6d10163fe662f8f7b2a0bbec67c12e227fa9cb314a1bc2c6e7a4e45b2fddc6"}
{"Ticker":"TSLA","Date":1641936805,"Headline":"Tesla Stock: China Sales Topped 70,000 In December","Source":"Yahoo","Summary":"Tesla December sales in China surged, as a Jan. 1 subsidy cut spurred demand from several EV makers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=da5ea16ef1d34d0f3d4a9e8ac3fc0ecc10e91e5f64151809eb02fbad268a3958"}
{"Ticker":"TSLA","Date":1641936792,"Headline":"Dow Jones Gains As Powell Makes This Inflation Pledge; Tesla Offers Opportunity; GE Stock Rallies","Source":"Yahoo","Summary":"The Dow Jones rose after Fed chair Jerome Powell made an inflation pledge. Tesla stock is offering a new opportunity. GE stock jumped."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e462edac6248cd379ee611a3b9cbdd5dc71b559ec95086c54dfe569f6039f75"}
{"Ticker":"TSLA","Date":1641936537,"Headline":"Market check: Nasdaq stocks stage comeback, Dow and S&P 500 close near all-time highs","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down a market chart comparing Nasdaq stock returns."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc781f9dc0d816a54852aa527687fb106d56cc0af2eba684a6ae26075650023f"}
{"Ticker":"TSLA","Date":1641932880,"Headline":"Cathie Wood is expecting a ‘bloodbath’ in this segment of the market: ‘autos are one example of…many disturbances out there in the world order’","Source":"Yahoo","Summary":"Cathie Wood, the star fund manager and chief executive of ARK Invest, in a Tuesday monthly market update says that the used car market is where she is expecting possible losses after a surge in values."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50897f59c671b7c8976a56f9e2eb7aecdd302af0367cbcf0a139a323f0b71c58"}
{"Ticker":"TSLA","Date":1641930367,"Headline":"Rivian (RIVN) COO Resigns Amid Production Challenges, Stock Falls (revised)","Source":"Yahoo","Summary":"Rivian's (RIVN) COO steps down at a time when the company is stretched with production ramp-up challenges. This brings down its shares below its IPO price."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b929f766520bccb4d25cfa3f5c7a331e5b2b6726550d68d0e3e4f87a5dfdc49"}
{"Ticker":"TSLA","Date":1641929160,"Headline":"Australia's Liontown signs supply deal with S.Korea's LG Chem, shares jump","Source":"Nasdaq","Summary":"Australian lithium miner Liontown Resources Ltd said https:\/\/bit.ly\/3r7epNv on Wednesday it signed a deal to sell lithium spodumene from its flagship project to the battery unit of South Korea's LG Chem, sending its shares soaring 13%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=088c3232672ce9642c121abe32f681339ac91f63a13dd632327f29ea4c655a19"}
{"Ticker":"TSLA","Date":1641928920,"Headline":"These Are Our 3 Favorite Growth Stocks to Buy In January","Source":"Nasdaq","Summary":"We're only a few weeks into 2022, and it has already felt like months with market volatility causing stocks large and small to seesaw up and down seemingly at a moment's notice."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=35593641bc0a7d32dcd72d91862273041ddfe276186465a39249a67758a94a10"}
{"Ticker":"TSLA","Date":1641928337,"Headline":"Tesla’s Austin factory is the ‘golden jewel’ in its supply ecosystem: Analyst","Source":"Yahoo","Summary":"Wedbush Managing Director & Senior Equity Analyst Dan Ives joins Yahoo Finance Live to discuss the outlook for Tesla production and the electric vehicle market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b4e25f841c280fa07eadca11b55859bd7c19db199d6d3e2459101de6f1e2dba"}
{"Ticker":"TSLA","Date":1641927540,"Headline":"Tesla Delivered a Record Number EVs From Its China Plant Last Month. What It Means for the Stock.","Source":"Yahoo","Summary":"Tesla’s China sales were out of this world.  Everyone already knows Tesla delivered a lot of vehicles in the fourth quarter.  The production from Tesla’s Shanghai facility is impressive, even if another company took the December delivery crown."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1fce90db39daad1b54cfcee177d4e208145a53a23d2de5278fcd497bd89e3d6"}
{"Ticker":"TSLA","Date":1641926282,"Headline":"First American Trust, Fsb Buys Nike Inc, Tesla Inc, Teradyne Inc, Sells Starbucks Corp, Newmont ...","Source":"Yahoo","Summary":"Investment company First American Trust, Fsb (Current Portfolio) buys Nike Inc, Tesla Inc, Teradyne Inc, Union Pacific Corp, Uber Technologies Inc, sells Starbucks Corp, Newmont Corp, Walmart Inc, Activision Blizzard Inc, Stericycle Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, First American Trust, Fsb."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ca8428577570af3295e5d26ad51a8d9ed1adfc0d486f230ba0b247675eb96efc"}
{"Ticker":"TSLA","Date":1641924422,"Headline":"Why Is Lucid Group's Stock Higher Today?","Source":"Yahoo","Summary":"Higher oil prices may be giving EV stocks a lift. But a Wall Street analyst isn't feeling bullish."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e9cd84fc1262dc286dd824debb823c52054299e7fe736d68e080e67a4caf254"}
{"Ticker":"TSLA","Date":1641923220,"Headline":"Tesla, GM Hype Autonomous Cars, But Offer Automated Features (For Now)","Source":"Yahoo","Summary":"Cars can perform many maneuvers on their own safely, but they can't drive themselves yet, despite breakthroughs produced by AI."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6cbb15f0ffdc0a4fde95a04b0ae813a5164c56c2f976442c29aaf9d91958dc8"}
{"Ticker":"TSLA","Date":1641922980,"Headline":"Tesla Has Sold More Than  70,000 In December In China","Source":"Nasdaq","Summary":"(RTTNews) - Breaking into the Chinese market has been of huge success for EV major Tesla Inc. (TSLA) and data published by the China Passenger Car Association (CPCA) on Tuesday has only cemented the claims. According to the agency, Tesla has sold 70,847 vehicles just in December,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4907b78cb458b07743944e56ee0b846c7397a838c3fd42d68fc61b9e1cbcc840"}
{"Ticker":"TSLA","Date":1641921034,"Headline":"Tesla Stock Rises After Analysts Boost Price Targets","Source":"Yahoo","Summary":"Tesla (TSLA) shrugged off a four-day decline in its share price and began rising after key analysts increased their price targets for the stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00a24bb8403b6870f5fa85cbaec156927c21b386e54218257a882972f7709afb"}
{"Ticker":"TSLA","Date":1641920121,"Headline":"Apple's Tim Cook made $98M in 2021 — how that compares to other tech CEOs","Source":"Yahoo","Summary":"Apple CEO Tim Cook made $98 million in 2021. Here's how that compares to other major tech CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=83476b2936ed1a93f5564b75ba25716a7699a7dfff77a5269b17b69a7bb2a643"}
{"Ticker":"TSLA","Date":1641920110,"Headline":"Rolls-Royce CEO on making EVs: 'We'd never compromise'","Source":"Yahoo","Summary":"“It needs to be a true, perfect Rolls-Royce, and then number two comes electrification,” Müller-Ötvös says about the Spectre EV. “We'd never compromise the experience of what a Rolls-Royce stands for, just for the pure sake that we have a different drivetrain.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9cd3692dbae460052f312deb2654d99a66dc92cf1167fd86a99c5cd6a86bd472"}
{"Ticker":"TSLA","Date":1641918988,"Headline":"Two of Sen. Kyrsten Sinema's former aides have lobbied for corporate giants looking to influence Joe Biden's agenda","Source":"CNBC","Summary":"Two of Sen. Kyrsten Sinema's former aides have become key aides for corporate giants looking to impact President Joe Biden's agenda. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=111d6e9729960e1e46abdebcd8343a198181d97fb8199a6e39514c548ccced61"}
{"Ticker":"TSLA","Date":1641913980,"Headline":"Best Stocks To Buy Right Now? 3 Automotive Stocks In Focus","Source":"Nasdaq","Summary":"Top Automotive Stocks To Check Out This WeekAutomotive stocks have been a hot topic of discussion among investors over the past few years. The stock market offers plenty of exciting prospects and the automotive industry is at the top of the list. Whether it is electric vehicles ("," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ccb4c6b42d3f7c39110f080925fdfd07a393b463be2575d30d5199266f159fb9"}
{"Ticker":"TSLA","Date":1641913407,"Headline":"Tesla sold a record 70,847 China-made vehicles in Dec -CPCA","Source":"Reuters","Summary":"U.S. electric vehicle maker Tesla Inc sold 70,847 China-made vehicles in December, the highest monthly rate since it started manufacturing in Shanghai in 2019, data from the China Passenger Car Association (CPCA) showed on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e66804e10d2f2f93c2f901ec7ab387bcc032ac1be9bcd62b3f9f3eee86b137e"}
{"Ticker":"TSLA","Date":1641905760,"Headline":"US STOCKS-Wall St bounces as tech stocks rise after Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock indexes reversed course on Tuesday as technology stocks recovered, with investors taking comfort in Federal Reserve Chair Jerome Powell's testimony to Congress not delivering any major surprises."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c8b3a5decaf5683ba65a677c1d00fb7722c1ff94e35f4b3537de2a4c2efddcc8"}
{"Ticker":"TSLA","Date":1641904200,"Headline":"3 Hot Penny Stocks: Why TLOFF, PHIO and SBEV Are Seeing Big Gains Today","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a63e54ed2ed8216c236178dc9a6d6d9b402f5f6ebb86c61927e51683c2228960"}
{"Ticker":"TSLA","Date":1641903240,"Headline":"Nickel Prices: 9 Things to Know as Demand for the Silvery-White Metal Surges","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d7a3c99bdf0390aed7ce6a9f5fa54494ce7d18910cd46f9aeac66233fdb6f1e6"}
{"Ticker":"TSLA","Date":1641900978,"Headline":"Triple Threat","Source":"SeekingAlpha","Summary":"Stocks, bonds, and gold have all stumbled out of the gates in 2022. Read more about three sectors that show signs of strength amid stock market weakness."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0e9030025eba0d9ee73fba827c22a7cba6f2d65e48ab01c4eaefbbe895d4016"}
{"Ticker":"TSLA","Date":1641900540,"Headline":"TLOFF Stock: The $1.5B Tesla Deal That Has Nickel Supplier Talon Metals Taking Off Today","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9230212ab50c260c529083a12f67bb4443a195156d2fcf010f39b17226be11c3"}
{"Ticker":"TSLA","Date":1641899400,"Headline":"Is A Rivian Electric Bike On The Horizon? What Investors Should Know About New Trademark","Source":"Benzinga","Summary":"Rivian Automotive (NASDAQ: RIVN) has a focus on electric pickups and electric delivery vehicles, and it might have another mode of transportation in its sights. \nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=188b7679828eb4b89b2dddb76bc09ba849f4eea4307943d870174d41b2cc93ab"}
{"Ticker":"TSLA","Date":1641899340,"Headline":"Tesla Pushing For Direct Sales In New York: What It Could Mean For Investors","Source":"Benzinga","Summary":"Despite being the largest electric vehicle company by units in the Unites States, Tesla Inc (NASDAQ: TSLA) still faces several disadvantages to traditional automakers. The..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=207a3c34cb157d871325f2fccb251388002ce7890cc47d7ece1e9bea2bac7f0d"}
{"Ticker":"TSLA","Date":1641899100,"Headline":"GGPI Stock Accelerates as Polestar Hits EV Goals. 6 Things to Know.","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f3c05ff2304528e08f1a7c85cbbf9c340686c0da713e42fa2a10fec995785c53"}
{"Ticker":"TSLA","Date":1641897000,"Headline":"Stock Market Today: Dow Jones, S&P 500 Fall Ahead Of Powell Renomination; Morgan Stanley Raises Tesla PT;","Source":"Nasdaq","Summary":"Stock Market Today Mid-Morning UpdatesOn Tuesday, the Dow Jones Industrial Average is down by 200 points. This is after the markets clawed back from record intraday lows late Monday, following extended losses. Worries over sooner-than-expected interest rate hikes have hampered in"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=380b0882b6b635ecb53f259c3fc6bf60535f21ad7ba0aefa54a572b99a554cf1"}
{"Ticker":"TSLA","Date":1641896740,"Headline":"How DigitalOcean Stock Could Grow 10x In 10 Years","Source":"SeekingAlpha","Summary":"DigitalOcean is a relatively small company with a huge opportunity in the fast growing SMB IaaS\/PaaS space. Learn more about DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c8a649792836873cf4452789b960902aeadbcb2c468ff9010d215a6c4542420"}
{"Ticker":"TSLA","Date":1641895800,"Headline":"3 Top Tech Stocks Under $20 Per Share","Source":"Nasdaq","Summary":"You don't need to have thousands of dollars to begin investing. If you have only $20, you can still buy shares of high-quality stocks. Your future self might thank you for investing that $20 instead of buying pizza tonight -- because investing $100 or even $20 can help you build"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=273f335370a49ff4d6981b68b275d9bf1700cdc38417caa366b87ecfc99b6d9f"}
{"Ticker":"TSLA","Date":1641895180,"Headline":"CORRECTED-UPDATE 2-Tesla sold a record 70,847 China-made vehicles in Dec -CPCA","Source":"Reuters","Summary":"U.S. electric vehicle maker Tesla Inc sold 70,847 China-made vehicles in December, the highest monthly rate since it started manufacturing in Shanghai in 2019, data from the China Passenger Car Association (CPCA) showed on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff08d78d2f4675207653964f50bb4a83be00e8368c8483785d41555b39f61067"}
{"Ticker":"TSLA","Date":1641893880,"Headline":"Paying Up Precedes Spectacular Repricing Cycles","Source":"SeekingAlpha","Summary":"The negative start to 2022 is a step in the mean reversion needed - but much more is yet to come. Click here to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=530b56a3b30a850794ddf95cfa01567bd80920bbc98150dd469db15c7063ccf3"}
{"Ticker":"TSLA","Date":1641893580,"Headline":"IBM, Black Diamond Therapeutics, Rivian, Tesla: What to Watch in the Stock Market Today","Source":"DowJones","Summary":"China’s car market snapped a three-year decline last year, helped by strong electric vehicle sales."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=29c2d0de7b2574ade584274754aeb9bcc45235ec021967f6c7a65cc87eb3afb5"}
{"Ticker":"TSLA","Date":1641893460,"Headline":"Prediction: These Will Be 3 of the Biggest Stocks by 2032","Source":"Nasdaq","Summary":"We're a couple of weeks removed from new-year celebrations. Now that 2022 is officially underway, it's time for investors to reset their focus to where the real wealth is built: the long term."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8e8ef0221cab55167d51de7e41874b8cebdee35b82994beadd7591954d63381f"}
{"Ticker":"TSLA","Date":1641891278,"Headline":"Tesla sold 70,847 China-made vehicles in December-CPCA","Source":"Reuters","Summary":"U.S. electric vehicle maker Tesla Inc sold 70,847 China-made vehicles in December, including 245 for export, the China Passenger Car Association (CPCA) said on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=490a21d3891f830c3e455e91b586ad3a0daa622aaf871d7303d51a84464ff1c2"}
{"Ticker":"TSLA","Date":1641889200,"Headline":"RIVN Stock Alert: Why Is Rivian Under Pressure Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55a68accc53d16b5d76344b25392b4aea579793b158ca09d9cda39cd283779be"}
{"Ticker":"TSLA","Date":1641888000,"Headline":"Wall Street Attacks Tech And Growth Stocks - I Disagree","Source":"SeekingAlpha","Summary":"Fundamentally superior growth stocks are poised to continue as market leaders. Superior fundamentals are very important as the stock market becomes more selective. Read more here..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e7b7f15bb32a57c8e5fed8ea2dd6effc088f68427a4f84cdc5805588a62ba2f"}
{"Ticker":"TSLA","Date":1641887820,"Headline":"Tesla's China EV Sales Surge In December, Outperforming Nio, XPeng, Others","Source":"Benzinga","Summary":"Tesla, Inc.'s (NASDAQ: TSLA) China sales rose to a record in December, Reuters reported Monday, citing data released by the China Passenger Car Association.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1489c7b62d70a43513368d4709ee68687fbc8b2eaf4da0d121d155b988c85efb"}
{"Ticker":"TSLA","Date":1641887520,"Headline":"Top Stock Market News For Today January 11, 2021","Source":"Nasdaq","Summary":"Stock Market Futures Steady After Turbulent Start To The Trading WeekStock market futures remain mostly unchanged ahead of Tuesday’s opening bell this week. In general, investors could still be digesting yesterday’s choppy trading session. After all, stocks sank towar"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a26ceffe01f64961b77ec489eaced8e2a66aaeb0e21f2f8ed864e9ab67ad9ca7"}
{"Ticker":"TSLA","Date":1641885540,"Headline":"US STOCKS-Futures rise ahead of Fed Chair Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Tuesday as investors picked up beaten-down stocks ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d920ab73002864d9e1a50d729fa83281ea23cee41cfd2079072477bc2a7eaf5d"}
{"Ticker":"TSLA","Date":1641884400,"Headline":"How We Beat The Market In 2021 And Aim To Do It Again In 2022","Source":"SeekingAlpha","Summary":"In 2021, we were blessed to outperform the market substantially. Check out the three key factors that will help us outperform once again in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=96242271de3b1eb5fdd92d776e33f6ea11c7f2929cc320b498617430dbec10ff"}
{"Ticker":"TSLA","Date":1641883320,"Headline":"Tesla Strikes Deal To Secure Nickel Supplies From Tamarack In Minnesota","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) has agreed to buy nickel supplies from Talon Metals Corp’s (OTC: TLOFF) Tamarack mines in central Minnesota, a first such U.S.-based nickel supply..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=298a06019c46391254d327d41f5b411ff34c3c71d80849d8e503894da14a72a1"}
{"Ticker":"TSLA","Date":1641881340,"Headline":"Electric Vehicles Drive Growth for China Car Sales","Source":"DowJones","Summary":"China’s car market snapped a three-year decline last year, helped by strong sales of electric vehicles, though the global chip shortage and Covid-19 outbreaks in the country disrupted some production."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=027f4e89e618e713b8a1967278d2d2e8f896932486cf0891c71ff28c256e271f"}
{"Ticker":"TSLA","Date":1641880800,"Headline":"7 Stocks Best Positioned to Win the EV Race in 2022","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3f59bcb9f7aac8d52dfbde859ad10e0eb116ff27b674194c49656b4eb6878438"}
{"Ticker":"TSLA","Date":1641878820,"Headline":"Tesla Inks First U.S. Nickel Supply Deal with Talon Metals","Source":"Nasdaq","Summary":"Tesla, Inc. (NASDAQ: TSLA) has inked a deal with Talon Nickel LLC, the U.S. subsidiary of Talon Metals Corp. (TSX: TLO), for the purchase of nickel concentrate to be produced from the Tamarack Nickel Project in Aitkin County, Minnesota. The EV maker plans to make the electric vehicle battery metal in a more environmentally-friendly manner. \n\n\n\nTalon is a base metals company in a joint venture with Rio Tinto on the high-grade Tamarack Nickel Project. Talon currently owns a 51% interest in the Tamarack Project and has the right to increase its stake by 9% to 60%. \n\n\n\nBenefits of the Deal \n\n\n\nDemand for nickel is expected to jump over the next decade on the growing momentum in the EV market. Notably, Nickel boosts energy storage in a battery's cathode, which in turn, extends the range of EVs. \n\n\n\nTherefore, the deal with Talon secures Tesla’s key U.S. source of the metal for its battery factories in Texas and Nevada. Last year, Tesla signed nickel supply deals with BHP in Australia and from New Caledonia. \n\n\n\nTerms of the Agreement \n\n\n\nPer the terms of the agreement, Tesla will purchase 75,000 metric tonnes (165 million pounds) of nickel in concentrate over a period of six years. Additionally, the company has a preferential right to purchase additional nickel concentrate over and above the committed 75,000 metric tonnes if needed. \n\n\n\nThe agreement is conditional on Talon earning a 60% interest in the Tamarack Nickel Project, the commencement of commercial production at the Tamarack Nickel Project by Talon, and the execution of detailed supply terms and conditions.  \n\n\n\nTalon is expected to commence commercial production on or before January 1, 2026, at the Tamarack Nickel Project, which might be extended for up to 12 months, following which Tesla has the right to terminate the agreement and Talon can sell to other parties. \n\n\n\nNotably, the price at which Tesla will purchase the nickel concentrate will be linked to the London Metals Exchange (LME) official nickel cash settlement price. Also, any additional economics gained from by-products of the nickel concentrate, such as iron and cobalt, will be shared by both parties. \n\n\n\nOfficial Comments \n\n\n\nSVP of Powertrain and Energy Engineering at Tesla, Drew Baglino, said, “The Talon team has taken an innovative approach to the discovery, development and production of battery materials, including to permanently store carbon as part of mine operations and the investigation of the novel extraction of battery materials. Responsible sourcing of battery materials has long been a focus for Tesla, and this project has the promise to accelerate the production of sustainable energy products in North America.” \n\n\n\nAnalyst Recommendations \n\n\n\nYesterday, Goldman Sachs analyst Mark Delaney maintained a Buy rating on Tesla and lifted the price target to $1,200 (13.41% upside potential) from $1,125.  \n\n\n\nDelaney increased his estimates to reflect \"robust\" deliveries in the fourth quarter, and he expects the company to sell more vehicles in 2022 and 2023. \n\n\n\nFurthermore, the analyst anticipates Tesla to expand margins in the intermediate term driven by its Model Y product and new factories in Berlin, Germany, and Austin, Texas. \n\n\n\nThe rest of the Street is cautiously optimistic about the stock, with a Moderate Buy consensus rating based on 15 Buys, 9 Holds, and 5 Sells. The average Tesla stock forecast of $1,053.73 implies that shares are fully valued at current levels. Shares have gained 24.6% over the past year. \n\n\n\nWebsite Traffic \n\n\n\nTipRanks’ Website Traffic Tool, which uses data from SEMrush Holdings (NYSE: SEMR), the world’s biggest website usage monitoring service, offers insight into Tesla’s performance.  \n\n\n\nAccording to the tool, the Tesla website recorded a 7.33% decrease in global visits in December compared to the same period last year. Also, a quarter-to-date comparison showed a decline of 6.71% compared to Q4 2020, while year-to-date website traffic growth stands at 0.95%.\n\n\n\n\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRead full Disclaimer & Disclosure\n\n\n\nRelated News: Ocugen Reveals Positive Results from Phase 2 Analysis of COVAXIN FedEx Operations Affected by Omicron & Bad Weather – Report Bank of America to Reward Employees with Higher Bonuses – Report"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0bfcdd3db44411151bbdd091f6760324cc709f0d601431c482fed970f3ea3ac"}
{"Ticker":"TSLA","Date":1641874260,"Headline":"Rivian Misses 2021 Production Target Of 1,200 Electric Vehicles: What You Need To Know","Source":"Benzinga","Summary":"Rivian Automotive Inc (NASDAQ: RIVN) said on Monday it fell short of its target of making 1,200 electric vehicles in 2021.\nWhat Happened: The maker of R1T electric trucks and R1S..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b509931153db080b34386fe2d917a331299848b538455c1d2fa4aba41ae79272"}
{"Ticker":"TSLA","Date":1641867817,"Headline":"Dow Jones Futures Rise: Stock Market Rally Finds Support Ahead Of Powell Hearing; Tesla Reverses Higher","Source":"Yahoo","Summary":"Dow Jones futures were in focus Monday. The stock market rally found support ahead of Fed chief Jerome Powell's confirmation hearing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f0af0f6e12010f7bc0baf8f5c2f663102b56d26f333ee2ebbc9363c27f9351e5"}
{"Ticker":"TSLA","Date":1641871578,"Headline":"Tesla sold 70,847 China-made vehicles in December - CPCA","Source":"Finnhub","Summary":"U.S. electric vehicle maker Tesla Inc sold 70,847 China-made vehicles in December, including 245 for export, the China Passenger Car Association said on Tuesday.... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46b785fd93de35db6d07f7782c91e05d3d3bac069f66e94593a68f9f94620796"}
{"Ticker":"TSLA","Date":1641870780,"Headline":"South Korea's LG Energy Solution IPO attracts around $80 bln in bids - sources","Source":"Nasdaq","Summary":"South Korean battery maker LG Energy Solution's (LGES) $10.7 billion initial public offering (IPO) has received bids worth around $80 billion from institutional investors, two sources with direct knowledge of the deal said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ae845570dfa7b7c4d142c2ba10c4c386632b50e73cfd1ffc5d805494f7be238"}
{"Ticker":"TSLA","Date":1641868728,"Headline":"ARKK: Disruptive Tech Investing Has Never Been A One-Year Approach","Source":"SeekingAlpha","Summary":"ARKK ETF has continued to underperform the broad market. But we think the current narrative over inflation, the Fed, and bond yields is transitory and re-iterate an ARKK buy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61cae0ea900f0167b7e5afbc8c50e42881ab4ea7823da61983ba273049872d68"}
{"Ticker":"TSLA","Date":1641867840,"Headline":"Tesla Hikes FSD Price By Another $2,000","Source":"Nasdaq","Summary":"(RTTNews) - EV maker Tesla, Inc (TSLA) CEO Elon Musk tweeted that the company has decided to increase the price of Full Self-Drive feature by another $2000. The feature already costs around $10,000 at the moment.    \n  \nMusk tweeted: \"Tesla FSD price rising to $12k on Jan 17.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e922dc246e4b9ab2a6368b6457249debcd3b5c5586fbbe5070775f4f31d33ae"}
{"Ticker":"TSLA","Date":1641863040,"Headline":"Tesla Is Miles Ahead of Others in the EV Race, This Analyst Says. The Stock Is Rallying.","Source":"Yahoo","Summary":"Morgan Stanley analyst Adam Jonas on Monday increased his price target for Tesla stock to $1,300 a share from $1,200."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1d4bba0cf1ce2881356f7ef14d5c08f5ea03ce39536595cd4dce1461e98a3c34"}
{"Ticker":"TSLA","Date":1642030879,"Headline":"Tesla Brandenburg: Volume Production Is Still Months Away","Source":"SeekingAlpha","Summary":"Tesla's Brandenburg factory is still waiting for a construction permit, which may be granted at the end of January. However, the permit does not mean that production can start."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e4157430fd4c91e48c188553296112c05be5dab4e90c270e91c32ac310dc838"}
{"Ticker":"TSLA","Date":1642029540,"Headline":"Tesla Announces Date for Fourth Quarter and Full Year 2021 Financial Results and Webcast","Source":"Yahoo","Summary":"AUSTIN, Texas, January 12, 2022--Tesla will post its financial results for the fourth quarter and full year ended December 31, 2021 after market close on Wednesday, January 26, 2022. At that time, Tesla will issue a brief advisory containing a link to the Q4 and full year 2021 update, which will be available on Tesla’s Investor Relations website. Tesla management will hold a live question and answer webcast that day at 4:30 p.m. Central Time (5:30 p.m. Eastern Time) to discuss the Company’s fina"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dbefb7abe7f404e372a6ec63811f05c1d6db4d12d7b7fb8c6c98a28d6196cbb"}
{"Ticker":"TSLA","Date":1642029540,"Headline":"Why Tesla Stock Popped Today","Source":"Yahoo","Summary":"Shares of Tesla (NASDAQ: TSLA) rose 3.9% on Wednesday following positive analyst remarks.  New Street analyst Pierre Ferragu believes the electric vehicle (EV) maker's investors are in store for sizable rewards.  Ferragu says Tesla's new manufacturing facilities in Texas and Berlin will help it ramp its production to an annual rate of 1.8 million vehicles by the end of this year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=28a5f92e7cf8184746f7645f9bd592cd2b3bb1a2e69313a47cbb3b9195a04f2d"}
{"Ticker":"TSLA","Date":1642027095,"Headline":"Bridge Creek Capital Management LLC Buys Amazon. ...","Source":"Yahoo","Summary":"Investment company Bridge Creek Capital Management LLC (Current Portfolio) buys Amazon.com Inc, Teleflex Inc, Walmart Inc, Tesla Inc, The Hershey Co, sells Bank of New York Mellon Corp, Sylvamo Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Bridge Creek Capital Management LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4c713c235d8bd2423354605c31de3334fa7191aa361e4659bffef1b02f9e4087"}
{"Ticker":"TSLA","Date":1642025560,"Headline":"Tesla stock is 'a confidence gauge' for markets: Strategist","Source":"Yahoo","Summary":"Tesla (TSLA) is a 'barometer' of market confidence, says TD Ameritrade chief market strategist JJ Kinahan. \n\"This is a name that really is a confidence gauge in my opinion,\" Kinahan told Yahoo Finance Live."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0a96110d6e103bf0bb9989de1b2767a0033fc6cc1a3357d730025cec14578d6"}
{"Ticker":"TSLA","Date":1642023117,"Headline":"Dow Jones Gains As Inflation Explodes; Tesla Stock, Rivian Charge Higher; Covid Test Stock Plunges","Source":"Yahoo","Summary":"The Dow Jones gained even as inflation exploded. Tesla stock and Rivian charged higher. A covid testing stock plunged. Microsoft rose."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2666d1daaf25bfaa8f931687b6edfed9c71185c5ff92b4c701fbeb716b89c84e"}
{"Ticker":"TSLA","Date":1642022855,"Headline":"Market check: Stocks close higher after gaining steam in final hour","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre reports how markets closed on Wednesday, as emerging markets and Chinese stocks show strong sentiment."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=76b4fbddd9cd4f1bf3f5943db0f270e8a9747994ebd2ae0a359c64ff6d93aa0d"}
{"Ticker":"TSLA","Date":1642021440,"Headline":"Tesla Stock Is Back Above $1,100. Is the EV Leader a Buy?","Source":"Nasdaq","Summary":"Tesla's (NASDAQ: TSLA) shareholders have endured some stomach-turning volatility in recent months. After surging to new all-time highs above $1,200 in early November, the electric vehicle (EV) company's stock price plunged below $900 by late December."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=137113de3ec7d70e56b5e4ac803ea0bd8c92ce4e4f7ef14244a70e48faffab9d"}
{"Ticker":"TSLA","Date":1642019691,"Headline":"California reviews whether Tesla's self-driving tests require regulatory oversight","Source":"Reuters","Summary":"California is evaluating whether Tesla Inc's self-driving tests require regulatory oversight, following \"videos showing a dangerous use of that technology\" and federal investigations into Tesla vehicle crashes, a state regulator said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9bd1fb67fcb9da91174e85f2665e8950036d17d365ed1bcc3ecdb4fcd3a97cae"}
{"Ticker":"TSLA","Date":1642016040,"Headline":"GM Has Lost Its EV Mojo to Ford. Can It Get It Back?","Source":"Yahoo","Summary":"Ford is eating GM's electric-vehicle lunch. That's a surprise, given just how much work GM has done laying out its EV plans in recent years."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=829597645dd18e90698709154ea775ccaeb7b1862f1c1a96412132fcf3a846ba"}
{"Ticker":"TSLA","Date":1642015757,"Headline":"ARK Invest’s Cathie Wood shrugs off inflation pressures","Source":"Yahoo","Summary":"Yahoo Finance's Alexandra Semenova details Cathie Wood's affirmation of the ARK ETF's outlook as inflation and tech sell-offs are appearing to be the fund's biggest obstacles in early 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ac62a5118008c180298744e0325a961af9c3c37d01c45781bb7a35b1696b7678"}
{"Ticker":"TSLA","Date":1642014360,"Headline":"Cramer's Mad Money Recap 1\/12: Tesla, Ford, GM","Source":"Yahoo","Summary":"Jim Cramer reminds investors they'll never make money in the stock market if they're too afraid to buy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d55f70bcecd7476eac62a552dc084e50d7563627cacee67afbf7e13987176cc4"}
{"Ticker":"TSLA","Date":1642011540,"Headline":"Robinhood CFO Doesn’t Plan to Put ‘Meaningful Amount’ of Cash Into Crypto Assets","Source":"DowJones","Summary":"Retail-trading platform Robinhood Markets doesn’t plan on spending significant amounts of corporate cash on crypto assets anytime soon, despite growing demand from its users for such investments, Chief Financial Officer Jason Warnick said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8617cc1cafc4c8403085a70253c85750f4b86af452ecdb2a56fed934821f75d4"}
{"Ticker":"TSLA","Date":1642008996,"Headline":"Third-Party Software for Teslas Can Be Hacked, German Teen Says","Source":"Yahoo","Summary":"(Bloomberg) -- A 19-year-old said he’s found flaws in a piece of third-party software that appears to be used by a relatively small number of owners of Tesla Inc. cars that could allow hackers to remotely control some of the vehicles’ functions.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Starts to Consider Treating Covid Like the FluJ"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c862b00a5a17c13ea999ef17b48a0540fba7345a535550247c440ff33fc05ab"}
{"Ticker":"TSLA","Date":1642008676,"Headline":"Stock Market Pares Gains As Inflation Hits 40-Year High; Microsoft, Tesla Lead","Source":"Yahoo","Summary":"Key market indexes stayed positive after trimming early gains midday Wednesday, as Microsoft led the Dow Jones Industrial Average."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c85cd1e7dca02fa4476a9a9571ba82e705732f0251dc4ffb882713cfe1df7e46"}
{"Ticker":"TSLA","Date":1642007640,"Headline":"4 Top Stock Trades for Thursday: TSLA, PG, Ethereum, BA","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=62c8345f991f2b8c60b1632d6df28eaf17e5e590cf7cb88eb61b598d83b31d3d"}
{"Ticker":"TSLA","Date":1642007280,"Headline":"3 Under-the-Radar Auto Technology Stocks to Watch in 2022","Source":"Nasdaq","Summary":"With the internal combustion engine no longer the sole option for power, the vehicle is being completely reimagined. Dozens of electric vehicle maker start-ups have appeared to capitalize on this coming sea change. But a slew of new auto parts manufacturers and service providers"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=62d62a2f0109f0806f01cdd584d1e82926aea55ff7c483906b9b52d231c7a042"}
{"Ticker":"TSLA","Date":1642006440,"Headline":"US STOCKS-Wall Street closes higher as inflation data supports Fed bets","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after data showed that while U.S. inflation was at its highest in decades, it largely met economists' expectations, cooling some fears that the Federal Reserve would have to pull back support even more forcibly than already expected."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=33cb30cb6f6514ce6628dbdc37019e3126f7954e55451d67f33db97b06da9579"}
{"Ticker":"TSLA","Date":1642005913,"Headline":"TBJ Plus: More hype for Triangle housing market; New businesses soar in NC; Wolfpack's time to shine in 2022?","Source":"Yahoo","Summary":"With the Triangle's housing market projected to keep roaring in 2022, it's no surprise that some local neighborhoods are up there with the buzziest places in the country for homebuyers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0a53bfd443e6cd65a067260331ef7977d9bd8f4e10121c1b59c6d3498256c076"}
{"Ticker":"TSLA","Date":1642005760,"Headline":"Britain's Octopus grabs nearly 100,000 German energy customers","Source":"Reuters","Summary":"Britain's Octopus Energy said it is nearing 100,000 German retail electricity and gas customers as its low overhead model makes inroads in a marketplace hit by wholesale price surges."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a2d096af645f64cb760fc573df33c3ff77a1e91515ed7bdb1881e82a3619f99c"}
{"Ticker":"TSLA","Date":1642005652,"Headline":"UPDATE 2-Britain's Octopus grabs nearly 100,000 German energy customers","Source":"Yahoo","Summary":"Britain's Octopus Energy said it is nearing 100,000 German retail electricity and gas customers as its low overhead model makes inroads in a marketplace hit by wholesale price surges.  With three million customers in Britain and a presence in Spain, Italy, Japan, Australia, New Zealand and the United States, Octopus is targeting one million of Germany's 41.5 million households by 2024.  \"We are just days away from cracking the number of 100,000 customers,\" Andrew Mack, its Chief Executive in Germany, said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f065b7c94b5a58f6270bd0026b99bdb456afb804a825dbc84599545ca81c65d0"}
{"Ticker":"TSLA","Date":1642005600,"Headline":"Stock Market Today: Stocks Hang On to Gains After Scorching Inflation Update","Source":"Nasdaq","Summary":"Inflation was the story of the day on Wall Street, and the latest numbers sparked another choppy session for stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c6c0d9b8e5a8239be02e5804de08999b5b63b247899167461045716df550612"}
{"Ticker":"TSLA","Date":1642004959,"Headline":"Market check: China stocks gain, Tesla shares climb, bitcoin recovers","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre gives an update on today's market, China stocks, Tesla, and bitcoin."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e5647b99bf427998c1049e0d7f9dddace157758187a9a3e5b35f29ba9258078"}
{"Ticker":"TSLA","Date":1642004940,"Headline":"Why Tesla Shares Raced Higher Today","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) surged higher Wednesday following a CnEVPost report suggesting the company's Giga Shanghai factory accounted for 51.7% of..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=146bef4cc4752e5ec3d6c9ad9cba9276fc86038e96a74eb8fc3f4ea951112b9d"}
{"Ticker":"TSLA","Date":1642003387,"Headline":"CORRECTED-UPDATE 1-Britain's Octopus grabs nearly 100,000 German energy customers  ","Source":"Reuters","Summary":"Britain's Octopus Energy said it is nearing 100,000 German retail electricity and gas customers as its low overhead model makes inroads in a marketplace hit by wholesale price surges."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=811d9bf7ca4f3ad024c9e94b224ea27b9572731f8e4383fada0ddafbfcc0a689"}
{"Ticker":"TSLA","Date":1641999540,"Headline":"Why Lucid Stock Rocketed 280% in 2021","Source":"Nasdaq","Summary":"What happened\n2021 was a stellar year for electric vehicle (EV) stock Lucid Group (NASDAQ: LCID), with its shares gaining a whopping 280.1% in the year, according to data provided by S&P Global Market Intelligence. In fact, Lucid shares listed in the U.S. in July but soared o"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=253610c05fa8ce2749cf82fc4d6736c0249ef15a1d1a0c14abb3b9bd8913d2a4"}
{"Ticker":"TSLA","Date":1641996780,"Headline":"Tesla Stock Has a Secret Key to Winning the EV Race in 2022","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d214b91d23c6320422f7d6a7b6df06fbff3eaf01878e7ec57fb1c25c9caffefc"}
{"Ticker":"TSLA","Date":1641996302,"Headline":"Why Lucid Dipped In December And Why It Is Poised For A Comeback","Source":"SeekingAlpha","Summary":"Lucid is on a steady climb back towards its post-SPAC-merger peak this week, defying broad market declines. Read what to know about LCID stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5aa2e26321033c0005ea8e41dda8dcbcf83e1ee1f5c7df761fa03ad46b302b3e"}
{"Ticker":"TSLA","Date":1641996300,"Headline":"Rivian Stock May Have Bottomed Out but It’s Still Not a Bargain","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4a3522bf741558ee42acfa11f695e4f288faaf1c79724ba18261f9f86f0a5392"}
{"Ticker":"TSLA","Date":1641991293,"Headline":"Tesla Could Be On The Path To $2,500 By 2025","Source":"SeekingAlpha","Summary":"I expect Tesla to continue beating consensus expectations, and its stock price should continue trending higher in the coming years. Read more about TSLA here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50ca3d1c0cb75ae358f2e9e00d2bacf3c27e5a75723b41932266d7a6297aa281"}
{"Ticker":"TSLA","Date":1641991020,"Headline":"US STOCKS-Wall St inches up after in-line inflation data eases investor fears","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with megacap technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=744ab1c4ba5e3f04d8360a8f26260ee86c1e11ab5ec99f328d2c421502b59cb5"}
{"Ticker":"TSLA","Date":1641986940,"Headline":"3 Bear Markets to Buy as Traders Adjust","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e5803fe198270de86972b26634c75c0d0b9594517fe7b2b65f31e2a0dda991e"}
{"Ticker":"TSLA","Date":1641984420,"Headline":"EXCLUSIVE: Unusual Whales Creates 'Nancy Pelosi ETF' So You Can Track Her Trades","Source":"Benzinga","Summary":"Members of U.S. Congress are permitted to buy and sell stocks and options in public companies as long as they publicly disclose their trades. The rule has come under scrutiny..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0d4b2e7c9be28b7c1039ff064f903e7f51ebf796fc3314f73bcc06048ded81e"}
{"Ticker":"TSLA","Date":1641983340,"Headline":"Stock Market Today: Dow Jones, S&P 500 Up After Powell Comments; Didi Gains On Potential Hong Kong IPO","Source":"Nasdaq","Summary":"Stock Market Today Mid-Morning UpdatesOn Wednesday, the Dow Jones Industrial Average is up by 90 points. Today’s market moves came following a strong rebound on Tuesday. Investors are finding temporary relief in assurances from the Federal Reserve Chair Jerome Powell that t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3e5ac9240ccb465da4f93659358387f5260fa19931258b9d38841fea3dbcc23c"}
{"Ticker":"TSLA","Date":1641982440,"Headline":"This EV Stock Has A Better 6-Month Return Than Tesla, Ford, Nvidia And Apple","Source":"Benzinga","Summary":"Lucid Group Inc (NASDAQ: LCID) aims to create sustainable mobility without compromise, and recent traders and investors in the luxury EV-maker have been rewarded handsomely.\nSince..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1017000199d9b7b7a8104a0997c100894656143390e5d5410a8fc112660e750b"}
{"Ticker":"TSLA","Date":1641982440,"Headline":"Wall St rises as in-line inflation data calms nerves","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with big technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d84f0cad02ab8738f6ff4f8c26ddd8c1eb2d45dde9bf40ff37a82dd380bf4cf"}
{"Ticker":"TSLA","Date":1641979925,"Headline":"Thinking about trading options or stock in Pinduoduo, DISH Network, Futu Holdings, Tesla, or Illumina?","Source":"Finnhub","Summary":"NEW YORK, Jan. 12, 2022 \/PRNewswire\/ -- InvestorsObserver issues critical PriceWatch Alerts for PDD, DISH, FUTU, TSLA, and ILMN. ... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b43f9f50ce5637190488e50b8cab82ead8b322446633efa87d08bfe56d29022"}
{"Ticker":"TSLA","Date":1641979680,"Headline":"Tesla Near its All-Time High: Bull Vs. Bear","Source":"Nasdaq","Summary":"Tesla (NASDAQ: TSLA) and its CEO Elon Musk are no strangers to the spotlight. But when Tesla makes headlines for meaningful business accomplishments, the auto industry can't help but sit back in awe."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9f2c8d0c6e80e3f22fc0dcd18fa49a7c7cc1172f751a77255475a46abfb13047"}
{"Ticker":"TSLA","Date":1641979140,"Headline":"US STOCKS-Futures extend gains as inflation data meets estimates","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Wednesday after largely in-line consumer prices data eased some concerns about faster-than-expected interest rate hikes, with big technology stocks leading the gains after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c30b87e09669cb0c94b6fa55bb069e6e4159584e83ebf5401af6b0c855047d37"}
{"Ticker":"TSLA","Date":1641979020,"Headline":"Should You Invest In Rivian in 2022?","Source":"Nasdaq","Summary":"Rivian (NASDAQ: RIVN) grabbed a lot of attention after its multibillion-dollar initial public offering (IPO) last year. Many investors saw Rivian's partnership with Amazon (NASDAQ: AMZN), under which it will deliver 100,000 electric delivery vans to the latter, as a key pillar of"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0739e12d49ef55ddb6c4eb5e50a4d2317efd1fc74d497bfa3e6f3d8b4aa288f1"}
{"Ticker":"TSLA","Date":1641976115,"Headline":"China's annual auto sales climb for first time since 2017","Source":"Reuters","Summary":"China's auto sales last year grew for the first time since 2017, industry data showed on Wednesday, boosted partly by a jump of 1.5 times in sales of new energy vehicles (NEVs)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c5695af19bb001821cb3180282ce9ee51c28de51c32b078e3d831da851e477b"}
{"Ticker":"TSLA","Date":1641974400,"Headline":"After Exxon win, Engine No. 1 turns to diversity, workforce issues","Source":"Nasdaq","Summary":"After scoring a landmark win at Exxon Mobil Corp over climate concerns last year, activist investor Engine No. 1 is broadening its sights to press companies on diversity and workforce issues in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b292ee3b172993c11af16d025b454961434b8aae93a39afb314795dd4334320d"}
{"Ticker":"TSLA","Date":1641972900,"Headline":"My Top Growth Stock to Buy for 2022 (and It's Not Even Close)","Source":"Nasdaq","Summary":"Volatility is rippling through the U.S. stock market as investors grapple with a record-high stock market, valuation concerns, potentially higher interest rates, and an ongoing pandemic. Yet that hasn't stopped many investors' appetites for growth stocks that have the potential t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89fb9bc4c5f3350c0f674c4b702c048e0b71ee0fc0cafd35110a2baf6780768b"}
{"Ticker":"TSLA","Date":1641971880,"Headline":"US STOCKS-Futures edge higher ahead of key U.S. inflation data","Source":"Nasdaq","Summary":"U.S. stock index futures edged higher on Wednesday, with investors bracing for consumer prices data that is expected to show an almost four-decade high in December, while big technology stocks bounced after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88f02d641a81ffe2d34d9c63948bbb5966398d19b9244ad7c28fc0ed7235288e"}
{"Ticker":"TSLA","Date":1641970954,"Headline":"California DMV reviewing approach to regulating Tesla's public self-driving test - report","Source":"Reuters","Summary":"California is reevaluating Tesla Inc's Full Self-Driving (FSD) test program, to determine if the electric-car maker's software should fall under its motor vehicle department's autonomous vehicle regulations, the Los Angeles Times reported on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02f1788ae16a327e748cd3272ce01bef2e07aa040ce1f9eda9d69839fc5d7200"}
{"Ticker":"TSLA","Date":1641967200,"Headline":"XPeng Stock: Here’s Why I Don’t Feel the Love That Others Do","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cfae9186894b5eb0ee94331d3a5ad32cebc77ac845868e620c0210270b15896e"}
{"Ticker":"TSLA","Date":1641967080,"Headline":"A Peek Into The Markets: US Stock Futures Edge Higher Ahead Of Consumer Price Index","Source":"Benzinga","Summary":"Pre-open movers\nU.S. stock futures traded higher in early pre-market trade after the Nasdaq jumped more than 200 points in the previous session. Investors are awaiting earnings..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ab677c7ea4562295076361a34ee1d5aceff184eda3bc2ed6f0433c6c5e51e8eb"}
{"Ticker":"TSLA","Date":1641964860,"Headline":"Teen Hacker Says He Got Remote Access To Over 25 Tesla Cars In 13 Countries","Source":"Benzinga","Summary":"David Colombo, a Germany-based self-described teen-hacker claims to have hacked into over 25 Tesla Inc (NASDAQ: TSLA) electric cars remotely in more than 13 countries.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f6d6eed91e2dfa7820d73089d9c946ef8c1b51dbd4cadef04850c3b6fd5ae87d"}
{"Ticker":"TSLA","Date":1641960300,"Headline":"Tesla Saw 52% Of 2021 Global Deliveries From Giga Shanghai Alone","Source":"Benzinga","Summary":"Tesla Inc’s (NASDAQ: TSLA) Giga Shanghai accounted for more than half of the electric vehicle maker’s global deliveries in 2021, cnEVpost reported on Wednesday, citing..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=341317bc8a69735722d6a062311ffa5e210dd7aa237cac53abcc361f52447ec9"}
{"Ticker":"TSLA","Date":1641960209,"Headline":"Mercedes-Benz to assemble its EQS electric luxury sedan in India","Source":"Finnhub","Summary":"German luxury carmakerMercedes-Benz plans to start local assembly of its EQS electricsedan in India this year, part of a broader push to electrifyits portfolio in Asia, the head of its India unit... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ccfebe4cbdbcdb4c038e479b5ac2f94f6b50255c6728bf769ad97a4efda58ca9"}
{"Ticker":"TSLA","Date":1641957120,"Headline":"Tesla Secures Green Light To Build More Test Cars At Giga Berlin","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) has secured the green light to build more test cars at Giga Berlin, Bloomberg News reported on Tuesday, citing a spokeswoman for the environment ministry..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fdd322f14b581f04a91afbf410f52eb3c102e0d0e5f7093b78781b00d4ebdee6"}
{"Ticker":"TSLA","Date":1641937710,"Headline":"Dow Jones Futures: Market Rallies On This Powell Comment As Inflation Data Looms; Apple, AMD, Nvidia, Tesla, ZIM In Focus","Source":"Yahoo","Summary":"The stock market rallied Tuesday as Fed chief Powell signaled he wouldn't be too aggressive. Key inflation data looms."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3f330c80f07d5a14655bba4983353b367bb4fc109f161e0d4adfc87ce1471816"}
{"Ticker":"TSLA","Date":1641950226,"Headline":"DMV 'revisiting' its approach to regulating Tesla's public self-driving test","Source":"Yahoo","Summary":"In light of videos showing self-driving Teslas attempting dangerous maneuvers, the California DMV is considering whether to require the company to conform to the same laws as other robot car makers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=92022bf71a39f3212320b1af6266014086110d5f24e07944b3301946cbbf1d58"}
{"Ticker":"TSLA","Date":1641949320,"Headline":"Tesla Reports Solid China Sales Numbers for December; Shares Up","Source":"Nasdaq","Summary":"One of the most popular EV stocks Tesla, Inc. (TSLA) reported solid delivery numbers for December 2021 in China. Following the news, shares rose as much as 1.7% and ended the day at $1,064.40 on January 11.\n\n\n\nTesla China December Deliveries\n\n\n\nAccording to the China Passenger Car Association (CPCA), Tesla China delivered a total of 70,847 electric vehicles (EV), a massive year-over-year growth of 197.6% and a solid 34% sequential growth.\n\n\n\nOut of the total cars delivered, 70,602 cars were delivered locally and only 245 cars were delivered internationally. In November 2021, Tesla China reported wholesale numbers totaling 52,859 autos, which in itself is a massive feat. \n\n\n\nIf the raw production numbers were anywhere close to the wholesale numbers, it would translate into an annual run rate of more than 800,000 autos even before 2021 ended.\n\n\n\nDomestic V\/S International Deliveries\n\n\n\nA look at the domestic and international breakup of Tesla China deliveries shows that the company typically focuses on export deliveries in the first half of every quarter and stresses the importance of local deliveries during the latter half.\n\n\n\nGoing by numbers reported in the fourth quarter, in October, Tesla China delivered a little more than 13,000 local vehicles and in November, the company sold around 31,700 local vehicles. Following the upward trend, in December, Tesla China sold 70,602 vehicles locally.\n\n\n\nThis also means that Tesla China hasn’t been able to focus entirely on the domestic Chinese market, which is witnessing a burgeoning demand for electric vehicles amid shifting preferences towards green energy and environment-friendly initiatives.\n\n\n\nDespite the global chip shortages and supply chain issues, Tesla China managed to deliver a total of 319,102 domestic vehicles in 2021. This number could grow even higher if the unit focuses more of its efforts on local demand.\n\n\n\nWall Street View\n\n\n\nYesterday, Morgan Stanley analyst Adam Jonas lifted the price target on the stock to $1,500 (40.9% upside potential) from $1,200, while maintaining a Buy rating.\n\n\n\nJonas is impressed by Tesla’s solid Q4 delivery numbers and sees it as a sign that the company is poised for more deliveries in 2022 and 2023. Furthermore, the analyst believes Tesla is well established to gain from its leadership position with Giga factories at Berlin and Austin, structural park, and introduction of new models all entering the narrative in 2022.\n\n\n\nOverall, the stock has a Moderate Buy consensus rating based on 15 Buys, 9 Holds, and 6 Sells. The average Tesla price target of $1,039.70 implies 2.3% downside potential to current levels. Shares have gained 24.6% over the past year.\n\n\n\nNews Sentiment\n\n\n\nTipRanks’ News Sentiment and Media Buzz Analysis shows the combined News Score based on TSLA’s News Sentiment and Media Buzz.\n\n\n\nTipRanks data shows that the News Score for Tesla is currently Neutral based on 322 articles published over the past seven days. 78% of the articles have a Bullish Sentiment compared to a sector average of 63%, while 22% of the articles have a Bearish Sentiment compared to a sector average of 37%.\n\n\n\n\n\n\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\n\n\nRead full Disclaimer & Disclosure\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRelated News:JD.com Opens Robotic Stores in Europe; Shares RiseApple Provides Services Segment UpdatefuboTV Releases Preliminary Q4 Results; Shares Down 8.4%"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aa5b9b1d8061d7882d4d8d9a9cde55d2d99b684c73a731baeb38a06936ecae75"}
{"Ticker":"TSLA","Date":1641949200,"Headline":"Time to buy: Retail investors swoop in when stocks falter","Source":"Nasdaq","Summary":"U.S. retail investors have been dip-buyers so far in 2022, snapping up equities that funds have shed from their portfolios in light of a more hawkish Federal Reserve, but with a focus on quality stocks as opposed to speculative names."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c93c3b628b981c21d068c8afe14740158311cafa083bc1b894aa449b31155ad3"}
{"Ticker":"TSLA","Date":1641947770,"Headline":"Australia's Liontown signs supply deal with S.Korea's LG Chem, shares jump","Source":"Reuters","Summary":"Australian lithium miner Liontown Resources Ltd said on Wednesday it signed a deal to sell lithium spodumene from its flagship project to the battery unit of South Korea's LG Chem, sending its shares soaring 13%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=68f76a56e8d56bcbf4a78f3d0b49902d34fea3e9ffb89b618f86e7406dc6ca67"}
{"Ticker":"TSLA","Date":1642118061,"Headline":"Exclusive-Tesla delays initial production of Cybertruck to early 2023 -source","Source":"Reuters","Summary":"Tesla Inc aims to start initial production of its much-anticipated Cybertruck by the end of the first quarter of 2023, pushing back its plan to begin production late this year, a person familiar with the matter told Reuters on Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=312a7c93846c9c9529932ee12d00d6b23fb51e105ca4953b06c47e9a256fd8eb"}
{"Ticker":"TSLA","Date":1642116840,"Headline":"Continued Setbacks: Why Alibaba, Other Tech Stocks Are Slumping In Hong Kong Despite Upbeat China Data","Source":"Benzinga","Summary":"Shares of U.S.-listed Chinese tech companies fell in Hong Kong on Friday, extending losses from the previous session and leading the benchmark Hang Seng Index lower.\nWhat’s..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3eaf062934521edc75bd6b5e5cbd8702779d7d51fdae91b730c451779c4aa4d3"}
{"Ticker":"TSLA","Date":1642116199,"Headline":"Stocks Slide Following Jobs and Inflation Data","Source":"Yahoo","Summary":"Daily financial news summary: stock market falls after increases in jobless claims and inflation are reported."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8672ac2ba2d79ad8169ce455d39301934d5e45757beaa6920e19b4141debabca"}
{"Ticker":"TSLA","Date":1642116011,"Headline":"Morgan Stanley Pounds the Table on Tesla Stock","Source":"Yahoo","Summary":"The race for EV dominance is on and new entrants are vying to catch up with undisputed sector leader Tesla (TSLA). With the segment still finding its feet, Morgan Stanley’s Adam Jonas says the race is akin to a marathon. The problem for the competition is Tesla is already way ahead of the pack. “Tesla is in the lead at mile number 21,” said the 5-star analyst. “Everybody else is at mile 2 or still tying their shoes.” Not only that, Jonas thinks Tesla is pulling further away, saying there are “si"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b1ac9d4594e2a843a585b0b6e2d740302d758655b9a4234c24d5423df02e91b2"}
{"Ticker":"TSLA","Date":1642115898,"Headline":"Exclusive: Tesla delays initial production of Cybertruck to early 2023 -source","Source":"Finnhub","Summary":"Tesla Inc aims to start initial production of its much-anticipated Cybertruck by the end of the first quarter of 2023, pushing back its plan to begin production late this year, a person familiar... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6c241d7110e50b542758a68dcf127b9825f1b4e5f680b0d5244f8a6b9749fcd2"}
{"Ticker":"TSLA","Date":1642115700,"Headline":"SpaceX Successfully Sends 105 Small Satellites To Orbit In Second Orbital Launch Of The Year","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) CEO Elon Musk-owned SpaceX on Thursday successfully completed its second orbital launch of the year aboard the reusable Falcon 9 rocket to lift 105 small..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ba5c8adfa121192a30332f8968f5fbf39338da9bc6482514db7b0eea050d738"}
{"Ticker":"TSLA","Date":1642114011,"Headline":"Jobless Claims Jump More than Expected; Stocks Advance","Source":"Yahoo","Summary":"Digest of today's breaking financial and economic news; jobless claims, stock market gains, and Delta Air Lines news."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6cf842d5c12869a2a145f36043a92b81f4a838b16fcdd672c140ec0d0f82f210"}
{"Ticker":"TSLA","Date":1642113840,"Headline":"Ford Hit a $100 Billion Market Capitalization. The Question Is Why.","Source":"Yahoo","Summary":"The news makes Ford the fifth-most valuable auto maker in the world, but there wasn't a lot of current news to explain the gain."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c5ae6b74a3d6096c44fa306bcc75b434d43c24965fbd7ad04bcfd4315b77525d"}
{"Ticker":"TSLA","Date":1642110960,"Headline":"Elon Musk, Hollywood Actors Criticize California’s Plan to Cut Solar Subsidies","Source":"Yahoo","Summary":"The state’s public utilities commission said the proposal balances the power grid, environment and consumers’ needs; critics said it hampers environmental progress."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=af71deddc3a4174110978c5a8252e12137ba91c8f3e8453081e1f1a4dd22d076"}
{"Ticker":"TSLA","Date":1642108841,"Headline":"Dow Jones Falls; Ford Stock Passes Milestone, Tesla Gets Hammered; Nvidia Dives Despite This","Source":"Yahoo","Summary":"The Dow Jones reversed lower. Ford stock passed a milestone while Tesla stock plunged. Nvidia stock took a dive."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e5c1490967a48524431326b00364ef6163c293fb202a38cc37370d75535fd83"}
{"Ticker":"TSLA","Date":1642107420,"Headline":"Canada opens probe into Tesla's heating system following consumer complaints","Source":"Nasdaq","Summary":"Canada's auto safety regulator said on Thursday it has opened an investigation into the heating system of Tesla Model 3 and Model Y vehicles following 16 consumer complaints about its performance during cold weather."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=21ceaeb310096c452459872322774b3afa6d941cd550f0f33f9d01ac9f4e5ced"}
{"Ticker":"TSLA","Date":1642106300,"Headline":"Bill banning stock trading by lawmakers is 'fair for everyday people': Retail trader","Source":"Yahoo","Summary":"Momentum is growing to restrict stock trading by members of Congress and their spouses, as retail traders have been tracking politician trades and their performance."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3be30399467d449a7b1b842dcfe3af853084c0e99853f12bc67879b0b1bf92d"}
{"Ticker":"TSLA","Date":1642106100,"Headline":"S.Korea's LG Energy Solution plans U.S. battery JV with Honda -report","Source":"Nasdaq","Summary":"South Korean battery maker LG Energy Solution (LGES) plans to build a battery joint venture (JV) with Japan's Honda Motor Co Ltd in the United States, South Korea's Maeil Business Newspaper said on Friday, citing an unnamed industry source."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ae9218dff7e8d35a1f6fe04f60d0ba714d281f32b8580d6b7dee14b226ff4519"}
{"Ticker":"TSLA","Date":1642105133,"Headline":"Market check: Nasdaq poised to end three-day streak, tech and health care lag","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down the stock market latest and the sell-off in tech."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e72a88298405fb9115ac2c5731012499107fb979c5450644eb2a5baeec2658e"}
{"Ticker":"TSLA","Date":1642104316,"Headline":"Ford crosses $100 billion in market value for the first time","Source":"Yahoo","Summary":"Ford is now worth more than its century-old rival General Motors, whose market cap stands at about $88.61 billion and EV start-up Rivian Automotive, whose value is about $77.8 billion.  But, the automakers are still dwarfed by EV leader Tesla Inc, which has a market cap of over $1 trillion.  Shares of Tesla were down 4.7% on Thursday after a report said the company updated its Cybertruck model webpage to remove references to the year 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b6ef1736c5b4b54cc6609f8d891839f25c88b9352df15f6b205b933121bf9db"}
{"Ticker":"TSLA","Date":1642099860,"Headline":"S.Korea's LG Energy Solution plans battery JV with Honda in U.S. -media report","Source":"Nasdaq","Summary":"South Korean battery maker LG Energy Solution (LGES) plans to build a battery joint venture with Honda Motor Co in the United States, South Korea's Maeil Business Newspaper said on Friday, citing an unnamed industry source."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=526e321dae283e2b65f3408d1aa8d07856e7eb35e14aa1764e14502ad2ac1612"}
{"Ticker":"TSLA","Date":1642094042,"Headline":"Court rejects Tesla push to reinstate higher U.S. fuel economy penalties","Source":"Reuters","Summary":"A U.S. appeals court on Thursday rejected a request from Tesla Inc to quickly reinstate higher civil penalties for automakers who fail to meet U.S. fuel economy standards."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ba61ef0848339ee2f0b86b3ab142f8a84b4b5d021a203242b59be5d8ff290368"}
{"Ticker":"TSLA","Date":1642092540,"Headline":"Dear NKLA Stock Fans, Here’s the Latest Catalyst You Should Be Watching","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cd642d9fed9f7a44838b4a03d0c24e21f4e026331d2d6a0ce909631cbe745dc7"}
{"Ticker":"TSLA","Date":1642092011,"Headline":"Supreme Court vaccine mandate ruling won't bar companies from demanding Covid shots for workers — Biden vows to advocate for that","Source":"CNBC","Summary":"President Biden urged companies to voluntarily impose Covid vaccination rules on workers after the Supreme Court blocked a government order to do that."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02855b44c057214e24defd3ad2d6a77304657e1178951553d53f39e861729cea"}
{"Ticker":"TSLA","Date":1642092000,"Headline":"Stock Market Today: Stocks Resume Slide on Busy News Day","Source":"Nasdaq","Summary":"Choppy trading continued on Wall Street as investors balanced good news, bad news headlines."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=15112f0aea5aab647bb3956443fc01d8f9e9b4a517358c5605f04745b5c2e289"}
{"Ticker":"TSLA","Date":1642091520,"Headline":"A Novel Approach to Employee Retention From Coinbase","Source":"Nasdaq","Summary":"Coinbase, the largest U.S. crypto exchange, has announced that it will be implementing an almost-total company shutdown for four weeks out of the year in order to allow its employees time to rest and recharge, reports CoinTelegraph. The popular crypto exchange often has what it describes as “long days and long weeks” of work that can [...] Read more at ETFtrends.com."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7cf715705052120dc987732ee90b3b28d015dec2347a90d970471eb219c7f124"}
{"Ticker":"TSLA","Date":1642091340,"Headline":"Tesla Starts Rolling Out Software Update To Address The Heat Pump Not Working In Extreme Cold","Source":"Benzinga","Summary":"In Tesla Inc.'s (NASDAQ: TSLA) quest to increase electric vehicle range and efficiency, the company last year switched all of its models to a heat pump system. This..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=051c54bf7d9aa583d86c65a5b8980038669a0a8260fce12caf7d44bea47e13bf"}
{"Ticker":"TSLA","Date":1642089060,"Headline":"Tesla Stock Could Explode Thanks to India Expansion. Musk Just Needs to Negotiate.","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b776600daefa2439c946916a0c30df707ddd8b34a1b18058d56d4039570dabf5"}
{"Ticker":"TSLA","Date":1642086045,"Headline":"Ford crosses $100 bln in market value for the first time","Source":"Finnhub","Summary":"Ford Motor Co's market valuebreached $100 billion for the first time on Thursday, as moreinvestors bet on the Detroit automaker's electrificationstrategy. The company's shares, which... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=37ad9eec418d6e71026b768c9ff508f2b8f07876fa8ebc7e36da223da17432b6"}
{"Ticker":"TSLA","Date":1642085760,"Headline":"Cybertruck Production Delayed Yet Again? Removal Of Date From Configuration Page Set Tongues Wagging","Source":"Benzinga","Summary":"Tesla Inc.'s (NASDAQ: TSLA) much-awaited Cybertruck could be further delayed and there is limited visibility into the timeline for its production to begin.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b4e1a7770b4e413b7c26c62b5661cab9c0b1512de349b5c6d1541f433dd4682"}
{"Ticker":"TSLA","Date":1642085520,"Headline":"Polestar Looks Like the Right EV Stock At the Wrong Time","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=97fa72359ffd247cf55cec8b5b66b21a6d22c3373e2d1c1d2dec22470c3ac606"}
{"Ticker":"TSLA","Date":1642084620,"Headline":"Ford Motor Company Reaches Record $100B Market Cap As Stock Defies The SPY: What's Next?","Source":"Benzinga","Summary":"Ford Motor Company (NYSE: F) popped up about 5% higher at one point on Thursday to reach a $100 billion market cap for the first time in history. Intraday, the stock was holding..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4206749dff5bb28b036e66a4baf17173584eb1d38de2119314a2e1da12ce5d89"}
{"Ticker":"TSLA","Date":1642084140,"Headline":"Why Tesla Shares Are Hitting The Brakes Today","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) is trading lower Thursday. Weakness may be the result of multiple reports showing the company has removed the Cybertruck production..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc80bb051973d83896cf0eb081843ebae1bad83dc6783d9896b00ace15a765db"}
{"Ticker":"TSLA","Date":1642081740,"Headline":"March 4th Options Now Available For Tesla","Source":"Nasdaq","Summary":"Investors in Tesla Inc (Symbol: TSLA) saw new options become available today, for the March 4th expiration.   At Stock Options Channel, our YieldBoost formula has looked up and down the TSLA options chain for the new March 4th contracts and identified one put and one call contr"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1acb9c064cb3b2c8a81ba9431ac900b3fec55c0aa374019c2c95f80c81a4a05"}
{"Ticker":"TSLA","Date":1642080060,"Headline":"7 Up-and-Coming Cryptos to Buy Early While You Still Can","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e848f99b384a6e9c824379099f18a2d8e8059f071fdb3a07cafc8bab8a906c1"}
{"Ticker":"TSLA","Date":1642078260,"Headline":"US STOCKS-Wall St pressured by Big Tech declines; PPI data offers relief","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Thursday, dragged down by declines in megacap growth stocks, while a slower rise in producer prices in December spurred hopes that inflation has potentially reached its peak."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4086d6c2c7ed61893c598820c2c193edd12a95f09f1764e93776733ab3a1eea3"}
{"Ticker":"TSLA","Date":1642077900,"Headline":"2 Reasons Why Tesla Stock Is Toast Today","Source":"Nasdaq","Summary":"What happened\nTesla (NASDAQ: TSLA) took another tumble on Thursday, falling 3.6% through 11:10 a.m. ET in response to a couple of negative news items."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=35ba8f53ea1d5f6925589783f11d67a291813ef8a4dbfd9453928fdd883ba455"}
{"Ticker":"TSLA","Date":1642077422,"Headline":"Long Live The Long Bond Or: How Stock Investors Can Learn To Stop Worrying About Inflation And Love U.S. Treasuries","Source":"SeekingAlpha","Summary":"Stock investors dismiss the long bond at the peril of their portfolios. In many ways, it holds the key to your stock total return dreams. Read why here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=acad0cd68fc4f10fddee8dcb9be93e7042a27cb3d3964b4672a16ab2588bfb45"}
{"Ticker":"TSLA","Date":1642076760,"Headline":"FirstDog Crypto Prices Soar 1,300% in Pupcoin Frenzy. Is It the Next Shiba Inu?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8055b40a5d68f2742ff707361a707bdc3fd3f46b96d77f52e8d2e33d05fa7c90"}
{"Ticker":"TSLA","Date":1642075200,"Headline":"Spring Free EV, Cox partner to supply used EVs to small businesses","Source":"Nasdaq","Summary":"Fintech startup Spring Free EV and Cox Automotive have partnered to provide used electric vehicles to smaller businesses through a new subscription program, the two companies said Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=408568828b244a67e6f3e9716afaab6f969c403d42bffeb84c02791687bb6449"}
{"Ticker":"TSLA","Date":1642072560,"Headline":"Exploring 2021's Major Stock Market Trends with Schaeffer's Investment Research","Source":"Benzinga","Summary":"Photo by Carlos Muza on Unsplash\nThis post contains sponsored advertising content. This content is for informational purposes only and is not intended to be investing advice.\nWith..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e6f6742c37137cb387d227716173cddc143ecb1adb1f2cd1775ec12d3f85420d"}
{"Ticker":"TSLA","Date":1642071746,"Headline":"Rivian Vs. Lucid Group: Which EV Stock Is The Better Buy?","Source":"SeekingAlpha","Summary":"Lucid and Rivian are fledgling but competent EV players with proven technologies. Read more to find out if RIVN or LCID stock is the better buy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=edd32a2ffcc304675ada6fd4b78de130f02f0ea13a78fecae5e69c6f6efcdb12"}
{"Ticker":"TSLA","Date":1642071060,"Headline":"Elon Musk's SpaceX To Launch Three South African-Made Nanosatellites: Why This Is Historically Important","Source":"Benzinga","Summary":"Elon Musk is giving a major hat-tip to his birthplace by launching the first nanosatellite constellation made entirely in South Africa on today’s SpaceX Transporter-3..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9a0bbd390d017539f643437d89560001340cd0c8f08e84358a1ad3f00cb6c137"}
{"Ticker":"TSLA","Date":1642070520,"Headline":"US STOCKS-Dow higher after producer prices data; Nasdaq, S&P 500 fall","Source":"Nasdaq","Summary":"The Dow rose on Thursday after a slower rise in producer prices in December fueled hopes that inflation has potentially reached its peak, while declines in healthcare stocks and megacap companies pressured the S&P 500 and the Nasdaq."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1810a09e24dd2e12d9a7121eae9dc0388c84ac9bd14dcfaff9cd4155274ae6ae"}
{"Ticker":"TSLA","Date":1642069140,"Headline":"Stock Market Today: Dow Jones, S&P 500 Ticks Upwards; TSM Soars On Record Quarter","Source":"Nasdaq","Summary":"Stock Market Today Mid-Morning UpdatesOn Thursday, the Dow Jones Industrial Average is up by 110 points. This comes after consumer prices rose to the highest in nearly 40 years. In brief, U.S. inflation came in at 7% in December. However, other parts of the globe like the U.K. an"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1caaf3c2e80f7399923359ef591e899a0a57f6c8a20ee3f496f1c4b85926d6ae"}
{"Ticker":"TSLA","Date":1642068660,"Headline":"Why Bulls Shouldn't Be Concerned With Stock Sale By AMC Entertainment CEO","Source":"Benzinga","Summary":"The CEO of one of the most popular public companies recently sold shares. The sale was criticized Wednesday as it was reported, but more clarification into the sale may..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61a005653c9df73e0e02abc263a67e59fcbe828f2d5973438046b53630bef249"}
{"Ticker":"TSLA","Date":1642067520,"Headline":"Better Buy: Tesla or Equal Parts of Lucid, Rivian, Nio, and Ford?","Source":"Nasdaq","Summary":"After making waves in 2021, the electric vehicle (EV) industry has wasted no time making a name for itself so far in 2022. Despite the Nasdaq Composite being negative for the year, share prices of Lucid Group (NASDAQ: LCID) and Ford Motor Company (NYSE: F) have already gained ove"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d84563035423265bcbda7bd8b8d4edd8363c5ce5d00554c21e444b23083f73f8"}
{"Ticker":"TSLA","Date":1642066980,"Headline":"Is XPeng Stock a Buy?","Source":"Nasdaq","Summary":"China is a leading market for electric vehicles. BloombergNEF estimates there were global sales of roughly 6.3 million electric vehicles (EVs) in 2021. Of these, around 3 million were sold in China. XPeng (NYSE: XPEV) sold 16,000 EVs in China in December, which looks impressive c"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fe5bbf9ad7e8f9a0cefea75b4215f6da81b156eb92f9b30c340db35437130cad"}
{"Ticker":"TSLA","Date":1642066380,"Headline":"Stock Market News for Jan 13, 2022","Source":"Nasdaq","Summary":"U.S. stocks closed slightly higher on Wednesday after data showed that inflation hit a four-decade high but came in largely in line with economists’ expectations. This somewhat eased fears that the Fed would have to roll back its financial stimulus more aggressively than"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6a0f45a66956397114d451878e4fb2bd7b78aa04644a0f2f99fadca6af9bb71"}
{"Ticker":"TSLA","Date":1642064851,"Headline":"Matthews International - Backbone Of Tesla's Battery Gigafactory","Source":"SeekingAlpha","Summary":"On the surface, Matthews is a classic boring industrial conglomerate with two cash-cow businesses. Read more about MATW stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ddc623552d0660e011146c662094ddeb731330e5018d0c7fcfbbe0da90744f05"}
{"Ticker":"TSLA","Date":1642062600,"Headline":"1 Key Ratio All Investors Should Be Looking at When Buying Growth Stocks in 2022","Source":"Nasdaq","Summary":"Growth stocks are struggling of late and many of them are on sale. In just three months, the ARK Innovation ETF has fallen more than 23% while the S&P 500 has risen by 8%. It can be tempting to buy up many growth stocks right now given their depressed valuations, but knowing"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=15beb804c65edc816fe25b1660c4f1aa0b9c219f056cbb6dfba93af861058378"}
{"Ticker":"TSLA","Date":1642044039,"Headline":"Elon Musk Says Tesla Isn’t in India Yet Due to ‘Challenges With the Government’","Source":"Yahoo","Summary":"(Bloomberg) -- Elon Musk has wanted to sell Tesla Inc. cars in India as early as 2019. Three years later, the U.S. electric-vehicle pioneer isn’t really much closer. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Starts to Consider Treating Covid Like the FluJ&J Vaccine Gets Additional Warning on Bleeding Side Effect“Still working throug"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=777336b456d6435cc6d2bfa324f669f4518fda5b7e6bed185631ecb36411105e"}
{"Ticker":"TSLA","Date":1642061700,"Headline":"Tesla Co-Founder Says Overall EV Demand Is Incredible But Production Can't Keep Up","Source":"Benzinga","Summary":"Tesla Inc. (NASDAQ: TSLA) co-founder JB Straubel believes that electric vehicle production is not moving fast enough to keep pace with the demand.\nWhat Happened: Citing the faster..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=77cf286c3340e38607639c92fd8c12794eb23ca14c3b2d10509e7fed5cd030e1"}
{"Ticker":"TSLA","Date":1642061400,"Headline":"Will Lucid Be the Breakout Stock for 2022?","Source":"Nasdaq","Summary":"The number of electric vehicle (EV) manufacturers is quickly growing, and stock buyers are looking hard at which could ultimately become winning investments. Investment dollars have piled in, giving lofty valuations to companies that have yet to bring in any revenue, let alone pr"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bf44168bd0811602a986a134ddf367a3c0cc3e854f4750777a1b9083215416b"}
{"Ticker":"TSLA","Date":1642060440,"Headline":"Top Stock Market News For Today January 13, 2022","Source":"Nasdaq","Summary":"Stock Market Futures Steady After Another Green Day For StocksStock market futures are edging up today following a session where stocks climbed marginally higher. For some, this slight movement in markets could be a welcomed sign. Before the release of December’s Consumer P"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ab19b936a2b1e286c1a95f9b7b30862e60ac187ba62306c649f4641bfbefce32"}
{"Ticker":"TSLA","Date":1642060200,"Headline":"5 S&P 500 Stocks Set to Report Triple-Digits Earnings Growth","Source":"Nasdaq","Summary":"The fourth-quarter earnings season is heating up, with total S&P 500 earnings expected to be up 19.9% from the same period last year on 11.9% higher revenues. This would follow a 41.4% rise in earnings on 17.3% higher revenues in the third quarter. Earnings were up 94"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0299566cbba8faae48d00d7572a497c2b297f3a29460df6ecfcf0d0581c27c0b"}
{"Ticker":"TSLA","Date":1642059000,"Headline":"These Automakers Are Tesla's Biggest Threats","Source":"Nasdaq","Summary":"In this segment of \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Fool contributors Brian Feroldi and Toby Bordelon discuss some of the competition facing Tesla (NASDAQ: TSLA) in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=729f25f70517f4264b43ae65a7b19ed0a49793b59d984efa41e5d58fa815a8f2"}
{"Ticker":"TSLA","Date":1642058400,"Headline":"These Are 5 of the Fastest-Growing Large-Cap Stocks on the Planet","Source":"Nasdaq","Summary":"Are you looking for raw rapid growth in your investments, even if that means dealing with (more than) a little extra volatility? It's understandable if you are."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c44d125a5b86fb9b2241b916dcb74ec0c6f24b69529d9ad20e22e006572ca457"}
{"Ticker":"TSLA","Date":1642057200,"Headline":"Electric Vehicle Checkpoint: Tesla Will Raise Price of Self-Driving Feature","Source":"Yahoo","Summary":"See the latest news for the top stocks in the electric vehicle space including Ford, Rivian, Lucid, Nio, and more."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5bc32505fcfee8e4da26a6e1d4d4d17d17a1335b1e20427058a3c9d2b9655554"}
{"Ticker":"TSLA","Date":1642055559,"Headline":"Tesla's Musk says 'working through challenges' with India government","Source":"Reuters","Summary":"Tesla Inc is \"still working through a lot of challenges with the government\" in India, its billionaire chief executive Elon Musk said on Twitter on Thursday, responding to a question on when it would launch its electric cars in the country."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc41f6bc0878888d1758d0fca29bf1d766381aa3bdeb20d03fcdddb771eb8c48"}
{"Ticker":"TSLA","Date":1642053600,"Headline":"5 Great Reasons to Buy Ford Stock","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=944c8a389949f16df04949d4918ba271b17ac00d5b017e82ae5ba72701870c5d"}
{"Ticker":"TSLA","Date":1642053600,"Headline":"Buy Into the Transformation of Ford as an EV Maker","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b8ed7169692d2c8776aa49521dfdff02c84f760e387f824ecc7285c6a866359"}
{"Ticker":"TSLA","Date":1642043100,"Headline":"Indian Government Fires Back At Elon Musk As He Blames Red Tape For Delay In Tesla India Entry","Source":"Benzinga","Summary":"Tesla Inc’s (NASDAQ: TSLA) attempted India foray has been mired in red tape, the billionaire entrepreneur and CEO Elon Musk said on Wednesday.\nWhat Happened: The world..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e67ba2ce8f0eaee72c448ed463c9f13aaddcf65d72ef3d54cd667df8731c9778"}
{"Ticker":"TSLA","Date":1642042380,"Headline":"Volkswagen Says Global Electric Vehicle Sales Jumped 97% Last Year","Source":"Benzinga","Summary":"Volkswagen Group’s (OTC: VWAGY) global electric vehicle deliveries nearly doubled last year helped by sales of its ID.4 electric sports utility vehicle and the legacy..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=47099934ef0116720e6b6d4b6acf34cb2f17876ae121441910c3dadf35e01684"}
{"Ticker":"TSLA","Date":1642041600,"Headline":"Efforts To Snag Apple Car Supply Chain Opportunities Lead To Formation Of Task Forces In South Korea","Source":"Benzinga","Summary":"Some Korean suppliers have reportedly created Apple Car task forces after meeting with Apple Inc (NASDAQ: AAPL) last month.\nWhat Happened: The focus of Apple’s Korean visit..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=271abd859171083ee383ac59d09c780a6a160811c2500e4ae3467e4196a73644"}
{"Ticker":"TSLA","Date":1642037341,"Headline":"Dow Jones Futures: Market Rally Pauses But Tesla, AMAT Pop; Apple Chipmaker Near Buy Point With Earnings Due","Source":"Yahoo","Summary":"The market rally hit resistance Wednesday, but Tesla and AMAT made strong moves. Taiwan Semiconductor earnings are due early Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=69dc9a07cc6359e2214873ee8baf08baa08989d6a3193489db936271b6b51eb9"}
{"Ticker":"TSLA","Date":1642039454,"Headline":"Tesla Stock Is Back Above $1,100. Is the EV Leader a Buy?","Source":"Yahoo","Summary":"Tesla's (NASDAQ: TSLA) shareholders have endured some stomach-turning volatility in recent months.  Tesla's shares have clawed back most of those losses in recent weeks.  Goldman Sachs analyst Mark Delaney is bullish on Tesla's shares."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e7887e9224609cc6abedba6d1f1b6ad965f2ce20be524b11ee35fc3008a4231"}
{"Ticker":"TSLA","Date":1642034100,"Headline":"Tesla, Nio Battery Supplier CATL Retains Dominance Of Chinese Market In 2021 With 52% Share","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) and Nio Inc’s (NYSE: NIO) battery supplier CATL continued to grab a lion’s share of the Chinese power battery market last year, cnEVpost..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=359c5e8aee6b1ac459bef019fba5fb9cca4380fe0b9bfe30a2ed9bb48a79eb6a"}
{"Ticker":"TSLA","Date":1642032180,"Headline":"Li-Metal Says Pilot NY Plant Produced First Batch Of Lithium Anode; Reiterates Plans For Commercial-Scale Production By 2025","Source":"Benzinga","Summary":"Li-Metal Corp (CSE: LIM) said on Thursday it has produced the first batch of lithium anode product at its just-commissioned anode pilot plant in Rochester, New York, and..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a1bca2ec04bd1bd4a3828fe84f881e670d697a891c6ad2ce4aef86dbfb40a714"}
{"Ticker":"TSLA","Date":1642194637,"Headline":"Tesla Stock’s Future Looks Bright Thanks to Dogecoin Merch Payments","Source":"Yahoo","Summary":"Exactly one month ago, Dogecoin (CCC:DOGE-USD) prices shot up following an announcement from Elon Musk. The man hailed as the “Dogefather” confirmed that Tesla (NASDAQ:TSLA) was going to start accepting the popular meme coin as payment for company merchandise. This news sent Dogecoin price shooting up as investors pondered what the future would bring for both the original meme coin and for Tesla stock. Today, as we watch Dogecoin prices surge on the first day of Tesla accepting it, we have our a"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c0de497e641f3629d32ab81e6f0f721a7fa6a2e4f31de3d0274718d71728e84"}
{"Ticker":"TSLA","Date":1642191085,"Headline":"UPDATE 1-NHTSA evaluating potential safety concerns related to heating issue of Tesla cars","Source":"Yahoo","Summary":"The U.S. auto safety regulator said on Friday that it is discussing heating issues of some Tesla vehicles with the automaker and evaluating \"potential safety concerns.\"  A number of Tesla owners have complained that heat pumps are failing in extreme cold temperatures, according to Drive Tesla Canada.  The U.S. National Highway Traffic Safety Administration (NHTSA) said it \"is aware of the issue and is continuing to gather information, discuss the issue with Tesla and evaluate potential safety concerns.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8e15e2328447469e66c2575014a70aa08eac2a736360b6a12c264093fd01fbbd"}
{"Ticker":"TSLA","Date":1642190500,"Headline":"Stocks Fall as Bank Shares Drop and Retail Disappoints","Source":"Yahoo","Summary":"Breaking financial news from Investopedia including financial markets, retail reports, and cryptocurrencies,"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e7021c6f6fe98d12a65ef99ae8618937e51b65d84331d634edef024dad4aaa81"}
{"Ticker":"TSLA","Date":1642189428,"Headline":"NHTSA evaluating potential safety concerns related to heating issue of Tesla cars","Source":"Yahoo","Summary":"The U.S. auto safety regulator said on Friday that it is discussing the heating issues of some Tesla vehicles with the automaker and evaluating \"potential safety concerns.\"  The National Highway Traffic Safety Administration (NHTSA) said it \"is aware of the issue and is continuing to gather information, discuss the issue with Tesla and evaluate potential safety concerns.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c94a22dfa5f94a1bebe50e333a2b0b25e8e13ebc377f543ba4dcb4703bf64b0d"}
{"Ticker":"TSLA","Date":1642189363,"Headline":"TBJ Plus: Raleigh rates high for friendliness; Shortages slam Chapel Hill's Sutton's; Girl Scout cookies ahead","Source":"Yahoo","Summary":"RALEIGH RATES HIGH FOR FRIENDLINESS: If you feel like Raleigh is a friendly place to live, you're not alone.  All donated books will be provided to children in Durham and beyond through Book Harvest’s book access and literacy initiatives."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ef7dcadb8fbd6362b63f7d9953cd64180c57ac2c5a8151f257bf325310ee0a06"}
{"Ticker":"TSLA","Date":1642186845,"Headline":"Market check: Stocks fall after retail sales miss, mixed bank earnings","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down how December retail sales, consumer sentiment, and bank earnings are moving markets today."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=574b184c2776f12efbf2e82ed2817658c117afa561bac5acded0bf3d33d060b0"}
{"Ticker":"TSLA","Date":1642185496,"Headline":"Stone House Investment Management, LLC Buys iShares TIPS Bond ETF, BTC iShares MSCI EAFE Growth ...","Source":"Yahoo","Summary":"Investment company Stone House Investment Management, LLC (Current Portfolio) buys iShares TIPS Bond ETF, BTC iShares MSCI EAFE Growth ETF, iShares Fallen Angels USD Bond ETF, iShares Core MSCI Total International Stock ETF, BTC iShares MSCI USA Min Vol Factor ETF, sells iShares 1-3 Year Credit Bond ETF, iShares MSCI EM ESG Select ETF, iShares S&P 500 Growth ETF, Fidelity MSCI Financials Index ETF, iShares Core S&P Total U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=85ff5d433c6f7b3d9955c3e84778e728f0a1edeec0599ee3b9cdc4ce1dc8391e"}
{"Ticker":"TSLA","Date":1642185490,"Headline":"Avity Investment Management Inc. Buys The Walt Disney Co, Bank of America Corp, Vanguard ...","Source":"Yahoo","Summary":"Investment company Avity Investment Management Inc. (Current Portfolio) buys The Walt Disney Co, Bank of America Corp, Vanguard S&P 500 ETF, Costco Wholesale Corp, The Hartford Financial Services Group Inc, sells Activision Blizzard Inc, Corteva Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Avity Investment Management Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90a50281adceec14ea831f518b95cbd987b36a989de4413b1148456bd2a89c59"}
{"Ticker":"TSLA","Date":1642185488,"Headline":"Next Capital Management LLC Buys Globus Medical Inc, Tesla Inc, PPG Industries Inc, Sells Apple ...","Source":"Yahoo","Summary":"Investment company Next Capital Management LLC (Current Portfolio) buys Globus Medical Inc, Tesla Inc, PPG Industries Inc, CSG Systems International Inc, iShares Core MSCI Emerging Markets ETF, sells Apple Inc, Nuveen Floating Rate Income Fund, Blackrock Floating Rate Inc Stra Fd Inc, Nuveen Short Duration Credit Opps, JPMorgan Chase during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Next Capital Management LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d58e9f83ac30a53bd959ca9d558308750b8592dccbf62e4e4d03786c603898c2"}
{"Ticker":"TSLA","Date":1642185483,"Headline":"MADDEN SECURITIES Corp Buys Pinnacle West Capital Corp, Intel Corp, PayPal Holdings Inc, Sells ...","Source":"Yahoo","Summary":"Investment company MADDEN SECURITIES Corp (Current Portfolio) buys Pinnacle West Capital Corp, Intel Corp, PayPal Holdings Inc, Skyworks Solutions Inc, PROSHARES TRUST, sells Arrival, DraftKings Inc, The Trade Desk Inc, Moderna Inc, Kellogg Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, MADDEN SECURITIES Corp."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=64afa14d0526e24ffb00a411f17dc62758907682c57d089143d3e5d76553bda7"}
{"Ticker":"TSLA","Date":1642182061,"Headline":"Elon Musk’s Tunnel System Works, but the Real Test Is Still to Come","Source":"Yahoo","Summary":"(Bloomberg) -- The CES technology show in Las Vegas last week was an important milestone for Elon Musk’s Boring Co., which operates a network of underground tunnels to ferry passengers around the massive convention center in Tesla Inc. cars.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingDjokovi"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=64173e37867ac76d8f35450a3c8fa2c9fcdadb5fe16e80283f7864bcf9d4233b"}
{"Ticker":"TSLA","Date":1642181520,"Headline":"Dogecoin Jumps After Elon Musk Tweets It Can Be Used To Buy Tesla Merchandise","Source":"Nasdaq","Summary":"(RTTNews) - Cryptocurrency Dogecoin's price jumped over 15% on Friday, but later lost some of the gains, after Tesla Inc. (TSLA) CEO Elon Musk announced that the luxury car maker will start accepting the meme cryptocurrency as payment for its merchandise."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eb40ac9b1e144a9260b0605f29ecdd3bb08626dabdc6d78d2e488b0629bfea95"}
{"Ticker":"TSLA","Date":1642180625,"Headline":"The Zacks Analyst Blog Highlights: CF Industries, Exxon Mobil, Tesla, Centene Corp. and Southwest Airlines","Source":"Yahoo","Summary":"CF Industries, Exxon Mobil, Tesla, Centene Corp. and Southwest Airlines are included in this analyst blog."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c67977b495aa56c91724aff84b0e7ac618a25fda406622266be82a706667a533"}
{"Ticker":"TSLA","Date":1642179605,"Headline":"Tesla (TSLA) Upgraded to Strong Buy: Here's Why","Source":"Yahoo","Summary":"Tesla (TSLA) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #1 (Strong Buy)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e00363eee3b2dfb80140b6a70431fa88d63a29547b68a1dcc0e0e9330d6cb263"}
{"Ticker":"TSLA","Date":1642178842,"Headline":"Tesla stock volatile amid market swings, cybertruck delay, Dogecoin experiment","Source":"Yahoo","Summary":"Tesla (TSLA) shares held relatively steady amid a volatile Friday morning trading session. The electric vehicle giant's stock performance comes after a volatile week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b7a351abac1f49642c6dd24728c56e25cffd6c38ff73305d2f7ca2e9932d099e"}
{"Ticker":"TSLA","Date":1642177707,"Headline":"Musk says Tesla to accept dogecoin for merchandise","Source":"Reuters","Summary":"Tesla Inc will accept meme-based cryptocurrency dogecoin as payment for its merchandise such as the \"Giga Texas\" belt buckle and mini models of electric vehicles, Chief Executive Officer Elon Musk said in a tweet on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=68e166ccf21e85daf59c7dedd765a5ececa8a0da1dbb4807b67552d1429b6732"}
{"Ticker":"TSLA","Date":1642177620,"Headline":"A Teenager Claims He Remotely Hacked 25 Tesla Cars","Source":"Yahoo","Summary":"The hacker, who lives in Germany, said he was able to remotely start Tesla cars in different countries without the knowledge of the driver."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2f66b41ddf1503e0552eab9e70bfe6425005d90c0dc3df78abc8ea6eb63efd6"}
{"Ticker":"TSLA","Date":1642176740,"Headline":"Ford stock falls after analysts downgrade the automaker’s shares","Source":"Yahoo","Summary":"Yahoo Finance Live’s Brian Sozzi discusses the top concerns and challenges for American automaker Ford moving forward."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=554a797d136f0674e330982c67a5570c4169c80708f646e26f771f733783d453"}
{"Ticker":"TSLA","Date":1642175854,"Headline":"Stocks Mixed as Retail Sales Drop Most in 10 Months","Source":"Yahoo","Summary":"Investors are also digesting a slew of quarterly earnings reports from banks, as JPMorgan Chase & Co. (JPM) and Citigroup Inc. (C) recorded income declines, while Wells Fargo & Company (WFC) said that profit jumped.  The Dow Jones Industrial Average (DJIA) and the S&P 500 are poised to finish the week lower, while the Nasdaq may end up higher for the week.  Later this morning, the University of Michigan will release its Consumer Sentiment Index for January."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=01da6f43d2c3158b5a908d35d44d68873c0d2c7dc44932955c3cefc7228474c8"}
{"Ticker":"TSLA","Date":1642174200,"Headline":"3 Best Dividend Stocks for 2022","Source":"Yahoo","Summary":"These may not be Bill Gates' dividend stocks, but they're compounding winners in my portfolio."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00703ebbbea47acc83256aaf51e98b19cb181772afdf9a18d6dcc112f4d05bc6"}
{"Ticker":"TSLA","Date":1642174140,"Headline":"Noteworthy Friday Option Activity: TSLA, IAA, LRCX","Source":"Nasdaq","Summary":"Among the underlying components of the Russell 3000 index, we saw noteworthy options trading volume today in Tesla Inc (Symbol: TSLA), where a total of 1.5 million contracts have traded so far, representing approximately 151.6 million underlying shares.  That amounts to about 5"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=39e830dc2dd933118197c13e4caf4b174536e2a037fe798f9b3ebefa0f00d070"}
{"Ticker":"TSLA","Date":1642173180,"Headline":"Ford Stock Has Run Too Far. Why It’s Like Tesla.","Source":"Yahoo","Summary":"Ford Motor shares were downgraded by an RBC analyst Friday.  Spak praised  Ford  (ticker: F) in his report for the progress made turning around the company, but with the stock up about 60% in the past three months, he is taking some of his chips off the table.  Ford is trading at about 12 times estimated 2022 earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=957d95b9504a2115db060050f9f022a0cd744dc4dbc4a93e9a8d41202836152f"}
{"Ticker":"TSLA","Date":1642172380,"Headline":"Tesla Cybertruck delayed to 2023, Elon Musk begins accepting dogecoin for some merchandise","Source":"Yahoo","Summary":"Yahoo Finance's Julie Hyman and Brian Sozzi discuss Tesla's Cybertruck delay until 2023 and how dogecoin is surging after Elon Musk begins accepting the crypto for some merchandise."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=741fc6244b67c0100636e5212a8296e566a370f86f83b8ccae16ec830dd98016"}
{"Ticker":"TSLA","Date":1642172160,"Headline":"Tesla Stock Falls Again Because There Are More Cybertruck Questions","Source":"Yahoo","Summary":"Reuters reported that Cybertruck production would be pushed back from late 2022 to early 2023, and Tesla stock is falling again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b254e809ab5d74fb5ac0f56475b4a52ab39f0eecae3c8e7f8eb17226eb2c9c16"}
{"Ticker":"TSLA","Date":1642171095,"Headline":"McLean Asset Management Corp Buys Avantis U.S. ...","Source":"Yahoo","Summary":"Investment company McLean Asset Management Corp (Current Portfolio) buys Avantis U.S. Large Cap Value ETF, Vanguard Short-Term Government Bond ETF, Avantis U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b2768c163c49fac089006f453fdb872f7f251b8bd41fab898ee905cec55717c"}
{"Ticker":"TSLA","Date":1642171091,"Headline":"Access Financial Services, Inc. Buys BTC iShares U.S. ...","Source":"Yahoo","Summary":"Investment company Access Financial Services, Inc. (Current Portfolio) buys BTC iShares U.S. Treasury Bond ETF, Communication Services Select Sector SPDR Fund, COHEN & STEERS TAX-ADV PRD SEC AND INC, BlackRock Science and Technology Trust II, Discover Financial Services, sells iShares 3-7 Year Treasury Bond ETF, Amazon.com Inc, Vanguard Communication Services ETF, Tesla Inc, Leidos Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Acce"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04125d0faac0ba2965d6f184ed0b9629a126a50ec07861415c05d26719b30062"}
{"Ticker":"TSLA","Date":1642170929,"Headline":"Dow Jones Sells Off As Citigroup, JPMorgan Tumble On Earnings","Source":"Yahoo","Summary":"The Dow Jones Industrial Average sold off Friday after Thursday's stock market losses. Citigroup, JPMorgan and Wells Fargo report earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b16941b838802287a850c699d9981e4a03d9626fc823b37f9cfd0795272c5c82"}
{"Ticker":"TSLA","Date":1642167011,"Headline":"Ford just hit a $100 billion market cap — why its stock may crash 52%","Source":"Yahoo","Summary":"One veteran auto analyst stakes out a bearish view on the red-hot shares of Ford."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55f3c79ea327fe0ef54233a4b9b83e675d82e92dbbe5c9adcaa3c5fe87f46e60"}
{"Ticker":"TSLA","Date":1642166021,"Headline":"Dow Jones Futures Signal Market Sell-Off To Continue; JPMorgan, Wells Fargo Earnings Top","Source":"Yahoo","Summary":"JPMorgan earnings kicked off big bank results. On Thursday, Tesla and growth stocks slammed the Nasdaq and broader market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=328fb0b4eeb595aae09db3d570564f4e895a2183143e910aa75ceb7cdbdfc353"}
{"Ticker":"TSLA","Date":1642165500,"Headline":"Are Electric Vehicle Stocks Overhyped?","Source":"Yahoo","Summary":"The excitement around electric vehicle stocks is palpable.  From Rivian (NASDAQ: RIVN) at a $76 billion market cap with no revenue to Tesla (NASDAQ: TSLA) breaching a $1.1 trillion market cap when it was valued under $100 billion less than three years ago, many investors are bullish on the opportunity in electric vehicles.  The industry is growing quickly, up 26% year over year from 2020, and is going after a gigantic market opportunity in the worldwide car market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bae05dbc28699966e31e1ddefd36c237fd22be76304bff381d086eda66aa056"}
{"Ticker":"TSLA","Date":1642163880,"Headline":"Volkswagen open to giving away majority in battery division-board member","Source":"Nasdaq","Summary":"Volkswagen could end up owning a minority stake in its battery division, which could be listed in an initial public offering at some point, the carmaker's board member in charge of the business told a newspaper."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ce989ff06b9837a70a1def12674bfee77956abded22807ee8f1aa2e7c929c5af"}
{"Ticker":"TSLA","Date":1642163460,"Headline":"US STOCKS-Wall St dragged down by financials after mixed results from big banks","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4223986daabcf67d0adef3c218460e3c5c4cfac8dfd3b63e451cc3bb8296e7d6"}
{"Ticker":"TSLA","Date":1642163400,"Headline":"After Shattering Expectations, Can Tesla Meet Its Demand?","Source":"Yahoo","Summary":"In this segment of \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Fool contributor Toby Bordelon takes a look at what Tesla (NASDAQ: TSLA) needs to do to fulfill the growing demand for its cars.  Earlier this week, Tesla reported delivery numbers for the fourth quarter of last year, and they hit another record."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5fa4cec9bc13b1e7daa39bda8463ab49f6c6246ad398e5945ba23ec726524811"}
{"Ticker":"TSLA","Date":1642162778,"Headline":"Tesla starts selling things for Dogecoin","Source":"Yahoo","Summary":"Tesla is now selling merchandise in exchange for dogecoin.  Chief executive Elon Musk announced that the company would start taking the cryptocurrency – which began as a joke, but has since received public support from a number of advocates – in exchange for a variety of items.  “Tesla merch buyable with Dogecoin,” Mr Musk tweeted."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e82f47495e8b5d753e412aaf05db8bc6531085a89b7026e04eaed73edee41351"}
{"Ticker":"TSLA","Date":1642162200,"Headline":"Where Will Lucid Group Be in 10 Years?","Source":"Yahoo","Summary":"Supply chain challenges and chip shortages have also contributed to the drop in enthusiasm for these companies, many of which had been richly valued.  Investors remained optimistic about Lucid for three simple reasons.  First, Lucid's CEO and CTO Peter Rawlinson previously oversaw the development of Tesla's (NASDAQ: TSLA) Model S sedan as its chief vehicle engineer from 2009 to 2012."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5114677d2195480b860bff6ca20ae6ffcfebd886a8143bbc705c7ed8cc868009"}
{"Ticker":"TSLA","Date":1642161600,"Headline":"Wall St Week Ahead-Earnings to test growth stocks after rocky start to year","Source":"Nasdaq","Summary":"A rough start to 2022 for U.S. tech and growth stocks is raising stakes for upcoming earnings reports, as investors seek reasons to keep faith in the shares while bracing for U.S. interest rate hikes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=59b9843793f50e5cedda5f5968726a388df840e283b8d64dc8b3b3adc5766fb0"}
{"Ticker":"TSLA","Date":1642160820,"Headline":"3 Top Electric Vehicle Stocks to Buy for the Long Haul","Source":"Nasdaq","Summary":"The global transport sector is shifting from the internal combustion engine to electric vehicles (EVs). The U.S. aims for half of its new vehicle sales to be electric by 2030. That's a huge target considering that EV sales accounted for just about 4% of the total vehicle sales in"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c22709da69a506bdacdd33d3a3997516eaa71893e22eb5a5d746ecfd54c9f41"}
{"Ticker":"TSLA","Date":1642160040,"Headline":"3 Popular ESG Indexes and How to Invest in Them","Source":"Nasdaq","Summary":"Here’s a look at three ESG indexes (based on the prominent parent indexes) and the ways to invest in them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cec46e63c16bf5065a8b188d6144ec2f913ce6362f996502530a91a2783dca34"}
{"Ticker":"TSLA","Date":1642159154,"Headline":"Livent: EVs And Batteries Are Causing Soaring Lithium Demand","Source":"SeekingAlpha","Summary":"Growth has been consistent for many quarters. Operations show consistent yields and profits. Read why Livent should be on the top of every investor's watchlist."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6db6ad36e9f3a8ef82de80fd46b2dc1152daf3cf1f94bc3f8f72581f7fa40c4d"}
{"Ticker":"TSLA","Date":1642157820,"Headline":"Elon Musk Tweet Sends Dogecoin Rocketing 13% Higher","Source":"Nasdaq","Summary":"What happened\nElon Musk is at it again, boosting the value of (arguably) his favorite cryptocurrency Dogecoin  (CRYPTO: DOGE) by 13.3% as of 10 a.m. ET."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e4ce7ea4c1995a4ef2391ed14bdf24a0ad40f491c9b22d4c852c9739a9bcee06"}
{"Ticker":"TSLA","Date":1642157194,"Headline":"TINA Was Wrong, Cash Is Not Trash, And There Is An Alternative","Source":"SeekingAlpha","Summary":"Despite high rates of inflation, recent CPI readings register a 7.0% inflation rate, many stock prices have deteriorated faster than cash prices. See more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=275cbeb7c370c77bb3a0b3caa6e4e2f66d626e6ad8d9d3de4124805d99c278af"}
{"Ticker":"TSLA","Date":1642156440,"Headline":"US STOCKS-Dow, S&P 500 dragged down by financials after mixed big bank results","Source":"Nasdaq","Summary":"The Dow and the S&P 500 fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season, while the Nasdaq edged higher as some big technology stocks regained lost ground."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e23ce4228749fa9074148da7f0e488027a65a4003a84f74adbe35051f2275a31"}
{"Ticker":"TSLA","Date":1642156080,"Headline":"Elon Musk Boosts Dogecoin as Tesla Starts Accepting the Cryptocurrency for Payment","Source":"DowJones","Summary":"The move, which sparked a 10% surge in dogecoin, marks a return for the electric-vehicle maker to acceptance of digital currencies for some payments."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c316766cb09e33ca8e9af160f9ca45fd0ea8e4ebb68f2d1a5d8d012fd5a9c30b"}
{"Ticker":"TSLA","Date":1642155780,"Headline":"Dogecoin flies after Elon Musk tweets some Tesla merchandise can be bought with the meme coin","Source":"Yahoo","Summary":"\"Tesla merch buyable with Dogecoin,\" tweeted Elon Musk, the CEO of the electronic-car maker, on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=64e519a6d80d93c2920803b61afeb6620f6f9630106eed75bc03e988d4ab3a28"}
{"Ticker":"TSLA","Date":1642155543,"Headline":"Dilemma, General Motors, And The Mobility Market","Source":"SeekingAlpha","Summary":"GM is attempting to transform its business from an ICE manufacturer to a future mobility solutions company. See what this means for GM stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f640b4a606ef99fb587214cd9fc128376b7d767ef0115fa8c47e1c49b357cbf"}
{"Ticker":"TSLA","Date":1642154820,"Headline":"Bank Stocks: What’s Going on With JPM, WFC, BLK and C Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ca329a3258eb6348d098955b178b081f97084a658c4d6e92d078e9727571eb16"}
{"Ticker":"TSLA","Date":1642154580,"Headline":"2021 China Auto Market Review & 2022 Preview: 3 Stocks to Buy","Source":"Nasdaq","Summary":"Auto sales in China, the world’s largest car market, snapped a three-year slump in 2021. According to the China Association of Automobile Manufacturers (CAAM), a total of 26.28 million vehicles were sold in the country last year, marking a 3.8% increase from 2020 levels."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=76a6e69480a1a002543d5394940bfc48fc74fd479fd756375b2f607df6223602"}
{"Ticker":"TSLA","Date":1642153260,"Headline":"Dogecoin Surges as Tesla Begins Accepting the Crypto for Merchandise Purchases","Source":"Yahoo","Summary":"surged early Friday after  Tesla  began accepting the  cryptocurrency for merchandise purchases on the electric-vehicle maker’s website.  Dogecoin has risen 12.6% over the past 24 hours to $0.196167, according to CoinDesk.  Dogecoin has gained 16.6% in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9898a66331dcb52b0d44cb022675309da9f9d8d5c430b0e21dbdfab25ae3fb73"}
{"Ticker":"TSLA","Date":1642152960,"Headline":"Dogecoin, Citigroup, Novavax, Las Vegas Sands: What to Watch in the Stock Market Today","Source":"DowJones","Summary":"Tesla made some of its merchandise available for purchase with dogecoin; Major bank earnings are rolling in."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=767033c3e5a8bb137d69c53b0127fb1f45bcb0df74d19cb8d7d96b9e13749073"}
{"Ticker":"TSLA","Date":1642152725,"Headline":"TESLA : RBC remains Neutral","Source":"Finnhub","Summary":"RBC confirms his opinion on the stock and remains Neutral. The target price has been raised from USD 1005 to USD 1045. | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=24f4cea7372d3d0bf1f35ae0e11dd4114cfa234c2766c98e3ba8190e32f5a4e1"}
{"Ticker":"TSLA","Date":1642152600,"Headline":"Stock Market News for Jan 14, 2022","Source":"Nasdaq","Summary":"U.S. stocks closed sharply lower, led by a huge selloff in tech stocks as the Nasdaq snapped its three-day winning streak after rising interest rate worries once again dented investors’ spirits. All the three major indexes ended in negative territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcfdb59abe8c7eed5ab00b7aad645dd7ef4a57ef29a8f678e14318cdd0be6f84"}
{"Ticker":"TSLA","Date":1642152473,"Headline":"Elon Musk announced Tesla will accept dogecoin as payment","Source":"Yahoo","Summary":"In a late-night tweet, Musk said Tesla is accepting the cryptocurrency for some merchandise on its website."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c72e43cd5951a58639c0ab0f0b6dba66d414e3361ad3127642774d7310f07cb4"}
{"Ticker":"TSLA","Date":1642150800,"Headline":"Gen Z investors shift focus from 'meme-stocks' to the 'metaverse,' report shows","Source":"Nasdaq","Summary":"Enthusiasm around \"meme stocks\" has eased for young investors a year on from the GameStop Corp trading frenzy, with Gen Z's attention shifting to companies in areas like electric vehicles and the \"metaverse,\" according to a report released on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b33eb45265570eed50dfce1cfc6dad4bcff46371afbc9e3839b6177f6a90f2d1"}
{"Ticker":"TSLA","Date":1642150800,"Headline":"GM Stock Is a Buy. The Company Is Quickly Becoming a Major EV Player.","Source":"Yahoo","Summary":"General Motors is fast becoming one of the most exciting players in the electric-vehicle space—and Wall Street is starting to notice.  Barron’s also has its eye on the 114-year-old company: Associate editor Andrew Bary recently named  GM  (ticker: GM) one of his top stock picks for 2022.  Several factors play into the bullish case for GM—with a key part being that the automaker plans to double its revenue to about $300 billion by 2030."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75a46efefbed7865625bf2e1f70f5b856609044473263cccee5b0b08989b9e8a"}
{"Ticker":"TSLA","Date":1642150500,"Headline":"US STOCKS-Wall St set to open lower after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index were set to open lower on Friday as JPMorgan, Wells Fargo and Citigroup kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5e41ac8202a323992448e8880807bc49831cafb5c88840486f39ab24d6684c7"}
{"Ticker":"TSLA","Date":1642149240,"Headline":"Reliance, Hyundai, Mahindra bid for incentives under India's $2.4 bln battery scheme","Source":"Nasdaq","Summary":"Indian conglomerate Reliance Industries, South Korea's Hyundai Motor Co and automaker Mahindra & Mahindra are among companies that have submitted bids under the country's $2.4 billion battery scheme, two sources told Reuters."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=71a0a413b1f1f78554166c91485821b67ec981c02159c72c123b1e2798c5834a"}
{"Ticker":"TSLA","Date":1642148880,"Headline":"Pre-Market Most Active for Jan 14, 2022 :  F, SQQQ, QQQ, TQQQ, MO, WFC, JPM, C, LVS, AAPL, TSLA, LCID","Source":"Nasdaq","Summary":"The NASDAQ 100 Pre-Market Indicator is down -144.34 to 15,351.28.  The total Pre-Market volume is currently 17,924,437 shares traded.The following are the most active stocks for the pre-market session: Ford Motor Company (F) is -0.41 at $24.61, with 2,015,177 shares traded., foll"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ebdc2559de446a19a0967f78bba67ed957ec33c0d1ec8e44e9595d5d764f9fe8"}
{"Ticker":"TSLA","Date":1642147980,"Headline":"Elon Musk-Backed EV Battery Technology Rises to Dominance in China","Source":"DowJones","Summary":"Tesla and Chinese makers take lead over rivals in using less-expensive iron in place of nickel."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5a8bd7a0353df74e4638d5436eb59b38be0c487e80121841d61c8c456acd30b2"}
{"Ticker":"TSLA","Date":1642146060,"Headline":"US STOCKS-Futures slip after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index futures edged lower on Friday as big lenders including JPMorgan and Wells Fargo kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=91515945fb98c6925752ebd7554642870c8daccfd5146a79dcbf26654cda1df4"}
{"Ticker":"TSLA","Date":1642145350,"Headline":"Tesla merchandise can now be bought with Dogecoin","Source":"Finnhub","Summary":"Following Elon Musk's announcement in December, Tesla customers can now purchase some merchandise with Dogecoin starting Friday.Items that can be bought with the cryptocurrency include the Cyberquad... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=567793a5b5529b20b9c75f0280e53788ea28a3e6ada85108b99aaf4202e26a1f"}
{"Ticker":"TSLA","Date":1642145119,"Headline":"Dogecoin jumps after Musk tweets Tesla merchandise 'buyable' with the token","Source":"Yahoo","Summary":"Meme-based cryptocurrency dogecoin jumped on Friday after Tesla Inc chief Elon Musk said the electric carmaker will accept it as payment for merchandise.  \"Tesla merch buyable with Dogecoin,\" Musk tweeted.  His mid-December tweet saying such use of dogecoin will be allowed on a test basis sent the cryptocurrency up more than 20%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d7c28a1fa6e02a1578f5728c7f9f0e99d77507093c3ba43066df901e2510384"}
{"Ticker":"TSLA","Date":1642144547,"Headline":"Dogecoin jumps after Elon Musk announces that Tesla will accept the meme coin—for merch","Source":"Yahoo","Summary":"You can't buy Tesla cars with Dogecoin, but some collectible items—like a \"cyberwhistle\"—can now be bought with the cryptocurrency."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f58b771d9f089a37db4d7769a7f072d490dc1f4bbaaf9a18f92ae31085716bb1"}
{"Ticker":"TSLA","Date":1642143600,"Headline":"Bull vs. Bear: Could Tesla Be the Best-Performing S&P 500 Stock of 2022?","Source":"Nasdaq","Summary":"Tesla (NASDAQ: TSLA) and the electric vehicle (EV) industry continue to capture the spotlight as growth investors look toward industries with paradigm-shifting technology and long-term prospects. From newcomers to legacy automakers, few industries are transforming before our eyes"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fe983a03ced414ff029968dba80dae6e923073449ce0e655d6008d00d998937b"}
{"Ticker":"TSLA","Date":1642143526,"Headline":"Dogecoin Surges as Musk Says It Can Be Used to Buy Tesla Merch","Source":"Yahoo","Summary":"(Bloomberg) -- Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersShould I Be Wearing an N95 or KN95? Understanding the Evolving Advice on MasksDogecoin, the cryptocurrency with a Shiba Inu meme founded in 2013, surged on Friday after Elon Musk said on Twitter that it could be used to buy Tesla Inc"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b93af61b53fbc45394f247045e73e34477098fb8bd0862edac2752a36e43a82a"}
{"Ticker":"TSLA","Date":1642143240,"Headline":"New Strong Buy Stocks for January 14th","Source":"Nasdaq","Summary":"Here are five stocks added to the Zacks Rank #1 (Strong Buy) List today:"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e42add11ab1095ecd2345f434fc832590286f7679539522fe58bf21092f765bb"}
{"Ticker":"TSLA","Date":1642142061,"Headline":"Tesla merchandise buyable using dogecoin, Musk says in tweet","Source":"Reuters","Summary":"Tesla Inc merchandise can be bought using the digital currency dogecoin, the electric-car maker's Chief Executive Officer Elon Musk said in a tweet https:\/\/twitter.com\/elonmusk\/status\/1481873421390680065 on Friday. (Reporting by Anirudh Saligrama in Bengaluru; Editing by..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1b73f70d40ca23703186670695b04341335d034ab3c30a432b603a34763e9ee5"}
{"Ticker":"TSLA","Date":1642141200,"Headline":"Should You Invest in the Vanguard Consumer Discretionary ETF (VCR)?","Source":"Nasdaq","Summary":"Looking for broad exposure to the Consumer Discretionary - Broad segment of the equity market? You should consider the Vanguard Consumer Discretionary ETF (VCR), a passively managed exchange traded fund launched on 01\/26\/2004."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=862ce9c3d0fa0833d02d217adbb0b43f1e0693a87e17b3003aca5abfbdbc6532"}
{"Ticker":"TSLA","Date":1642140360,"Headline":"A Peek Into The Markets: US Stock Futures Higher Ahead Of JPMorgan, Citigroup Earnings","Source":"Benzinga","Summary":"Pre-open movers\nU.S. stock futures traded higher in early pre-market trade after the Nasdaq tumbled 2.5% in the previous session. Investors are awaiting earnings results from..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=711c1a187d57579c2f09b7412f9a4b7ab03068e9531885b725aea817d0e1e540"}
{"Ticker":"TSLA","Date":1642140000,"Headline":"Lucid Group Stock Is Positioned for New Highs in 2022 With Expansion Plan","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de036260d5ec419e63f41348cf3f19a6ef121acd1718546fb79ae938ddf0ff91"}
{"Ticker":"TSLA","Date":1642139820,"Headline":"Why Elon Musk Thinks German Environment Activists' Focus On Stopping Tesla 'Doesn't Make Sense'","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) CEO Elon Musk on Friday agreed to an opinion piece that alleges some German environmental activists have ulterior motives and are more focused on stalling..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6c82ab3f6f69dd68e7917151636092f14c00e2ba78d1b7919997146a1b9d915b"}
{"Ticker":"TSLA","Date":1642130580,"Headline":"AI-Driven Asset Management Startup, Catapulted To Fame By Tesla Trades, Raises $146M From SoftBank","Source":"Benzinga","Summary":"Artificial intelligence-focused fintech group Qraft Technologies Inc. said it has received a $146 million investment from Japanese conglomerate SoftBank Group Corp. (OTC: SFTBY)...."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=12e1fdde86a36b6e6a8171c808d38d2b6e7f9c1ff340a8d3115e80d0eca5fa47"}
{"Ticker":"TSLA","Date":1642117121,"Headline":"Dow Jones Futures: Tesla, Growth Stocks Lead Market Sell-Off; JPMorgan Headlines Bank Earnings","Source":"Yahoo","Summary":"Tesla and other growth stocks hammered the Nasdaq and the broader market. JPMorgan headlines big bank earnings Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fddf053736feefb93065eaf76ade0335b7746b19d130efd3de8844c97951cc43"}
{"Ticker":"TSLA","Date":1642129320,"Headline":"Elon Musk says Tesla will now accept payment for some merchandise in dogecoin","Source":"DowJones","Summary":"Tesla suspended purchases with bitcoin last year after Musk expressed concerns about high levels of fossil fuel use for its mining"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=953ab35ba26a1f01ff0d753b3e22afb092328ed3d760247469d4fb54a22da0c4"}
{"Ticker":"TSLA","Date":1642127340,"Headline":"Tesla, GM EV Battery Supplier LG Energy Poised to Price IPO At Top of Range: Report","Source":"Benzinga","Summary":"General Motors Co's (NYSE: GM) South Korean battery supplier LG Energy Solution is expected to price its shares at the top of the marketed range in the upcoming listing,..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ecd75576a89e0e6bac524b3d6ef7d77c21a17dd13a5301a3f3889ffac43e76b"}
{"Ticker":"TSLA","Date":1642126275,"Headline":"Canada opens probe into Tesla's heating system following consumer complaints","Source":"Yahoo","Summary":"Canada's auto safety regulator said on Thursday it has opened an investigation into the heating system of Tesla Model 3 and Model Y vehicles following 16 consumer complaints about its performance during cold weather.  Transport Canada said it is concerned that a malfunctioning heating and air-conditioning system \"may affect windshield defogging\/defrosting and therefore driver visibility.\"  A number of Tesla owners complained that the heat pumps are failing in extreme cold temperatures, according to Drive Tesla Canada, a Tesla news provider."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cdbf0797d628b6a2bc464f60d4ecda1feb851cd331d167dbc34866e5dff08712"}
{"Ticker":"TSLA","Date":1642126026,"Headline":"DOGECOIN LAST UP 16.8% AT $0.20 AFTER MUSK TWEETS TESLA MERCHANDISE 'BUYABLE' WITH THE TOKEN","Source":"Finnhub","Summary":"DOGECOIN LAST UP 16.8% AT $0.20 AFTER MUSK TWEETS TESLA MERCHANDISE BUYABLE WITH THE TOKEN ... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75518fcbc3e4b3648f60db762d2bcb9c05f48f5e83e827373aeb6afdf3e76d17"}
{"Ticker":"TSLA","Date":1642123352,"Headline":"TESLA CEO ELON MUSK SAYS 'TESLA MERCH BUYABLE WITH DOGECOIN' - TWEET","Source":"Finnhub","Summary":"RPT-TESLA CEO ELON MUSK SAYS TESLA MERCH BUYABLE WITH DOGECOIN - TWEET ... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d5c42b18a22dab48380cf76bc30c793165dcd578c748a17302f4b1bc753ec63d"}
{"Ticker":"TSLA","Date":1642122672,"Headline":"Exclusive: Tesla delays initial production of Cybertruck to early 2023 -source","Source":"Finnhub","Summary":"Tesla Inc aims to start initial production of its much-anticipated Cybertruck by the end of the first quarter of 2023, pushing back its plan to begin production late this year, a person familiar... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=18975fd9ac878c480f999456195dfc27dfc7fc1d164b02d3cbdd2485f11b36f7"}
{"Ticker":"TSLA","Date":1642120463,"Headline":"Dogecoin (DOGE) Bucks the Thursday Crypto Market Trend on Tesla News","Source":"Yahoo","Summary":"DOGE got a Tesla boost on Thursday. Price action for today, however, will hinge on any further news updates and sentiment across the broader market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=822616cd12bdebae27a192115b9de50bebc5fefd63a00eb5b3255f7ff90fe91a"}
{"Ticker":"TSLA","Date":1642119786,"Headline":"S.Korea's LG Energy Solution prices IPO at top of range to raise $10.8 bln -sources","Source":"Finnhub","Summary":"South Korean battery maker LGEnergy Solution has priced its initial public offering atthe top end of its indicative range, raising 12.8 trillion won, two people with direct knowledge of the... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=58d5d3f196c0ef1547e491b077b209f57c770eeaf0f5a7715cef2a5c05659bc6"}
{"Ticker":"TSLA","Date":1642287826,"Headline":"Lucid: Battery EV Venture Promising, But Still Too Young And New To Risk Buying Shares","Source":"SeekingAlpha","Summary":"Early reviews of Lucid’s first model are impressive, but long-term battery performance and safety remain unproven. Read more to see why I think LCID is a speculative buy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1b254b1704cd82b89c5081f20ca4a25c69f01f1921ab1c345cc4cbe48e8ddf44"}
{"Ticker":"TSLA","Date":1642277760,"Headline":"Tesla's Elon Musk Cuts Law Firm After It Won't Fire Lawyer in SEC Probe, Report Says","Source":"Yahoo","Summary":"A Tesla lawyer asked law firm Cooley to fire an attorney who worked on a U.S. Securities and Exchange Commission investigation of Elon Musk, according to a Wall Street Journal report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5ca7540edaa3938d972ebc190e86e619534b9233d6ad3e1f457136c737180e44"}
{"Ticker":"TSLA","Date":1642267940,"Headline":"Dogecoin Holds Steady, But Traders Hit Hard This Weekend","Source":"Yahoo","Summary":"In early Saturday trading, price fluctuations for meme token Dogecoin (CRYPTO: DOGE) took traders on a wild ride.  The price of Dogecoin dropped 2.3% over the past 24 hours, as of 11 a.m. ET.  Yesterday's massive rally, induced by a tweet from Tesla (NASDAQ: TSLA) CEO Elon Musk who announced that Dogecoin would be accepted for some types of Tesla merch, sent this meme token on its biggest rally in a month."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b586364b1d98a6d5862f2c5bc831446b86b3cfd4e659cb697721aad5302768d6"}
{"Ticker":"TSLA","Date":1642214144,"Headline":"Dow Jones Futures: Market Rally Holds Key Support; Apple, Qualcomm Lead 5 Stocks Near Buy Points","Source":"Yahoo","Summary":"The stock market rally is on the back foot, while the Nasdaq has lagged the S&P 500 for nearly a year. But Apple is holding up."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=597efc26f49f1caf5c6532cd20aae36c9c71b20256524d448ddd9a1a8e068013"}
{"Ticker":"TSLA","Date":1642257180,"Headline":"Lucid's 2030 EV Production Goals Bring It to Half Where Tesla Stands Now","Source":"Yahoo","Summary":"The electric vehicle company has a production plan that shows just how speculative its nearly $70 billion valuation is."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b46c8aa8ed8ab4c365c68d54e01d3f85944279cd66be2e9adbdcf5479cc6a90"}
{"Ticker":"TSLA","Date":1642246980,"Headline":"WSJ News Exclusive | Elon Musk’s Tesla Asked Law Firm to Fire Associate Hired From SEC","Source":"DowJones","Summary":"Long dismissive of regulators, the Tesla boss has recently aimed his ire at individuals with ties to regulatory agencies with which he has sparred."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4a4a121707d2d3533024d3c6041db963ef3c9806d8facb2a3355f5f25d37d67c"}
{"Ticker":"TSLA","Date":1642235520,"Headline":"Better Buy Now: Lucid Up 20% or Rivian Down 20%?","Source":"Nasdaq","Summary":"Electric-vehicle (EV) newcomers Lucid Group (NASDAQ: LCID) and Rivian Automotive (NASDAQ: RIVN) captured headlines in 2021 after both companies went public, began delivering vehicles, and set bold plans for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=22500cddafb1bb68230fb9c62aca4955e2965b069d0c01745dd95897f24b09df"}
{"Ticker":"TSLA","Date":1642234080,"Headline":"Wall Street Breakfast: What Moved Markets","Source":"SeekingAlpha","Summary":"Listen on the go! A daily podcast of Wall Street Breakfast will be available this morning on Seeking Alpha, iTunes, Stitcher and Spotify."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a6c9363b005d2b1bb3c8ad6ace6f173c885199ae39ec886bd26fe423e0b3de0a"}
{"Ticker":"TSLA","Date":1642220770,"Headline":"Talon Metals Secures Nickel Supply Deal With Tesla But Looks Expensive","Source":"SeekingAlpha","Summary":"The company inked a deal with Tesla that includes the supply of 75,000 tonnes of nickel concentrate over six years, which are worth $1.68 billion at today’s nickel prices."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5a61df74df54e8fb98c69f899b44e0d6868d5557fdf9b653a071a06af96ea108"}
{"Ticker":"TSLA","Date":1642206300,"Headline":"Investment Opportunity of a Lifetime","Source":"Yahoo","Summary":"Readers weigh in on commodities, Tesla’s prospects, federal government largess, Larry Fink, inflation during the Ford administration, and political leadership held hostage"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6ee99bce739db9ea2c1078c3661e6b707d45ce2a56d80d011bb40c961df268af"}
{"Ticker":"TSLA","Date":1642375763,"Headline":"Top 5 Lithium Pure Play Producers With The Biggest Expansion Plans To 2025","Source":"SeekingAlpha","Summary":"By 2025 my forecast is we will need an additional lithium supply (from 2020 levels) of just over 1m tpa, by 2030 an additional supply of just over 3m tpa."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=535b8482ed2b10d74565ece28997fa5bcbcde4cc7928ada7b201a1632afbbdba"}
{"Ticker":"TSLA","Date":1642372860,"Headline":"Tesla looks to Africa for key battery component to reduce dependence on China","Source":"Yahoo","Summary":"Tesla is turning to Mozambique for a key component in its electric car batteries in what analysts believe is a first-of-its-kind deal designed to reduce its dependence on China for graphite."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=94e509106419a0708d9a01b4cf6b6b7b1415aeed0894804d49b704c3f433362e"}
{"Ticker":"TSLA","Date":1642351767,"Headline":"Why Dogecoin Is Plummeting Today","Source":"Yahoo","Summary":"The price of Dogecoin (CRYPTO: DOGE) is sinking in Sunday's trading.  The cryptocurrency was down 5.7% over the previous 24-hour period as of 11:45 a.m. ET.  With Bitcoin and Ethereum roughly flat over the previous day of trading and the broader cryptocurrency market looking uncharacteristically stable, Dogecoin's sell-off likely stems from investors taking profits after recent gains."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e8339c74b980b8f6137e6c31a815b5fdff33da2cef23cd42c84e93395610d56d"}
{"Ticker":"TSLA","Date":1642351757,"Headline":"Trouble For Technology","Source":"SeekingAlpha","Summary":"It has been a rough start for the NASDAQ and technology so far in 2022. These challenges can be traced back as far as mid-2021."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11ddbe29f435f922afd47387dc50b8cf9a2266bc61b2967424cf24c5d3165fbd"}
{"Ticker":"TSLA","Date":1642335280,"Headline":"A First Take On Fisker","Source":"SeekingAlpha","Summary":"Fisker has one EV, Fisker Ocean, which is set to commence production in 4Q22. See why I took a small watch item position in FSV stock via covered call orders."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d2661e924dc4eb25b44428c57f877580a0b10a21f8d768561cc03a6cbb471db9"}
{"Ticker":"TSLA","Date":1642323600,"Headline":"Wall St Week Ahead-Earnings to test growth stocks after rocky start to year","Source":"Nasdaq","Summary":"A rough start to 2022 for U.S. tech and growth stocks is raising stakes for upcoming earnings reports, as investors seek reasons to keep faith in the shares while bracing for U.S. interest rate hikes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b57415f2b18adc07d4971e255695552a94724707f8ff06ea95aaa7c7d777478e"}
{"Ticker":"TSLA","Date":1642304043,"Headline":"Tesla inks deal to get key battery component outside China","Source":"Finnhub","Summary":"LONDON — Tesla is turning to Mozambique for a key component in its electric car batteries in what analysts believe is a first-of-its-kind deal designed to reduce its dependence on China for... | January 16, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcfdf91e3629b656cd47c98566c2ca287f6604d39a3c7ed326dab5ee15463a7d"}
{"Ticker":"TSLA","Date":1642461120,"Headline":"Rolls-Royce, Bentley, BMW Sales Surge as Cheaper Brands Lag Behind","Source":"Yahoo","Summary":"Luxury car brands such as Rolls-Royce, Bentley, Porsche and BMW have reported record sales, thanks to customers who have craved them and manufacturers that have directed scarce chips toward their most profitable models."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3a9533897eeb18c434023fded7be79b60f8137cc11c3a2a3810a0ee8a5926e99"}
{"Ticker":"TSLA","Date":1642460520,"Headline":"Why Alibaba And Other Tech Stocks Are Rising In Hong Kong Today","Source":"Benzinga","Summary":"Shares of U.S.-listed Chinese tech companies traded mostly higher in Hong Kong on Tuesday, leading the benchmark Hang Seng Index higher.\nWhat’s Moving: Shares of Alibaba..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a7dd9cb9a090fe52fea39bee623e102950884834de88baf3b36036e105a37483"}
{"Ticker":"TSLA","Date":1642460110,"Headline":"Tesla (TSLA) Outpaces Stock Market Gains: What You Should Know","Source":"Yahoo","Summary":"Tesla (TSLA) closed the most recent trading day at $1,049.61, moving +1.75% from the previous trading session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3b6d7a666abe1b88594c52d48d82e3baa04bd0a8d8a6e4e6319fd40353f84438"}
{"Ticker":"TSLA","Date":1642456860,"Headline":"Cathie Wood Continues Profit-Booking In Tesla, Selling Another $28M On Friday","Source":"Benzinga","Summary":"Cathie Wood’s Ark Investment Management on Friday sold more shares in Tesla Inc (NASDAQ: TSLA), continuing the months-long profit booking spree in the electric vehicle..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=158f2045184f3b520584fca525a36495aaa6af5b421c4493b30cfebff2611938"}
{"Ticker":"TSLA","Date":1642455120,"Headline":"The Exchange: Xpeng boldly goes","Source":"Nasdaq","Summary":"HONG KONG (Reuters Breakingviews) -     The Chinese electric-car maker has navigated everything from shrinking subsidies to Covid-19. Embracing new ways of working is critical, boss Brian Gu tells Katrina Hamlin. Future forays into Europe, the metav"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4be8e15db4d992fb7a981a55d30814cb5d61e14df9b4d3c3a8dd2578b103344c"}
{"Ticker":"TSLA","Date":1642453200,"Headline":"Top 10 Lithium Stocks in LIT, the World's First Lithium ETF","Source":"Yahoo","Summary":"The Lithium & Battery Tech ETF's two largest holdings are miner Albemarle and Tesla, while a Warren Buffet-owned stock ranks No. 6."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9c6a0f4e89fc40d821e7c567dbbc7972a641c1ba6edfea2e7c50fbc339d22e38"}
{"Ticker":"TSLA","Date":1642446000,"Headline":"After flying start, Stellantis must tackle Tesla and China","Source":"Nasdaq","Summary":"If playing catch up with Tesla is what everyone in the auto industry is about then Stellantis, the company formed from the merger of Fiat Chrysler and Peugeot, has had a good start – its shares have far outpaced its U.S. rival in its inaugural year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=82cb0af6c9e0b7a8d88c45df6b8bdf873302c0c86ccb1b317e50616817650fee"}
{"Ticker":"TSLA","Date":1642435363,"Headline":"Tesla: Cathie Wood Keeps Selling","Source":"SeekingAlpha","Summary":"Cathie Wood's firm Ark Invest continues to sell Tesla stock in a meaningful way. TSLA stock loses No. 1 spot in ARKW ETF. Check out my thoughts on this selling."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=303064de95a4a4e036593457dc7445bf64120d3be9158360adea689db1847649"}
{"Ticker":"TSLA","Date":1642435091,"Headline":"Bitcoin investors dig in for long haul in 'staggering' shift","Source":"Yahoo","Summary":"As bitcoin heads into 2022, a growing cohort of long-term investors is doubling down on its stashes of the cryptocurrency, hoping a December dip was merely a festive blip.  Since last July, for example, the amount of bitcoin held in digital wallets with no outflows for more than five months has been steadily increasing, according to digital currency brokerage Genesis Trading.  \"The number of bitcoins that haven't moved in over a year has been climbing since July,\" said Noelle Acheson, head of market insights at Genesis Trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4d891bb4f9f55add49cec17d9ca2767ac55afedc773c04f67c8c5d588355b054"}
{"Ticker":"TSLA","Date":1642435023,"Headline":"Arcimoto: Massive Dilution Likely Coming","Source":"SeekingAlpha","Summary":"Company announces equity sales agreement. Significant dilution will be used to fund growth. Read more."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d376c11996bab1cfc4ff2f874df25eae527f327fb4431d0223ecedfacae07926"}
{"Ticker":"TSLA","Date":1642432083,"Headline":"Designer Brands and Bed Bath & Beyond have been highlighted as Zacks Bull and Bear of the Day","Source":"Yahoo","Summary":"Designer Brands and Bed Bath & Beyond have been highlighted as Zacks Bull and Bear of the Day"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc819ab3111b59ad3ec3b44a6d442e73f41f26216798962e7e34f56ff560a66e"}
{"Ticker":"TSLA","Date":1642431712,"Headline":"10 Best Clean Energy Penny Stocks To Buy Now","Source":"Yahoo","Summary":"In this article, we discuss the 10 best clean energy penny stocks to buy now. If you want to skip our detailed analysis of these stocks, go directly to the 5 Best Clean Energy Penny Stocks To Buy Now. Renewables have been increasing their overall share in new power capacity expansion across the globe over […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4196fdbfb7202df0d75c1452ff1c233236f691fd5659f7d0a143e08fd743118"}
{"Ticker":"TSLA","Date":1642430640,"Headline":"Roku Stock Remains a Buy on Weakness Despite the Skeptics","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cf396b80ac747594870d53cec579009ab3e4ac3f55df5797e8a5806d40b11ea3"}
{"Ticker":"TSLA","Date":1642423516,"Headline":"India’s states woo Tesla after Elon Musk complains about difficulty launching in the country","Source":"Yahoo","Summary":"The Tesla boss has asked for a cut in import duties before its India launch."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9087a35142a4a9f2803fec4f448eec5ef86e2b5f1556d057567cbcf8fe49e78d"}
{"Ticker":"TSLA","Date":1642422300,"Headline":"3 Cathie Wood Stocks to Buy and Hold for 10 Years","Source":"Yahoo","Summary":"These fast-growing stocks from the ETF guru's portfolios could make investors rich over the coming decade."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=116c6cf88dd2ea32fa7ebfbd7bcdc109d227da04a96a3497e3f1ab19dfa5e759"}
{"Ticker":"TSLA","Date":1642421374,"Headline":"Musk and Bezos among world's 10 richest men who doubled their wealth in pandemic","Source":"Yahoo","Summary":"The 10 richest now have six times more wealth than the poorest 3.1 billion people, according to an Oxfam study."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23d87293fe0c8bc1181a309f067893fd58393d1def4643889bcbb296deaef3ca"}
{"Ticker":"TSLA","Date":1642417800,"Headline":"Rivian Stock Just Fell Below its IPO Price of $78 Per Share: Time to Buy?","Source":"Yahoo","Summary":"Share prices of Rivian Automotive (NASDAQ: RIVN) briefly fell to $75.13 per share on Friday before closing the session at $79.95 per share.  It was the first time Rivian stock dipped below its initial public offering (IPO) price of $78 per share.  Howard Smith: Markets aren't always efficient, and that's how investors can gain an advantage."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=570fdb66116deae86d68116f2567521543d2dbccd3337910c36c9f567ab6fd65"}
{"Ticker":"TSLA","Date":1642417680,"Headline":"7 Long-Term Stocks to Buy and Hold Until 2030","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d634dd668553849135f8ac688865e2ce117a6d0b1ab2fcd79ff0d3d3aabc69df"}
{"Ticker":"TSLA","Date":1642412700,"Headline":"Why Boston Beer Stock Lost Some of Its Buzz","Source":"Nasdaq","Summary":"The beer industry is nothing if not a marketing machine. In this clip from \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Motley Fool contributor Toby Bordelon discusses why he's not giving up hope for the future of Boston Beer (NYSE:SAM) despite a steep stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cf76ae9461a3327b5fbd191e6d99e2beb068c8b1301adf696011fc79a9ad1380"}
{"Ticker":"TSLA","Date":1642400446,"Headline":"The Capital Sponge","Source":"SeekingAlpha","Summary":"We discuss the factors that led to strong US stock market performance in recent years. Check out the factors that could cause this trend to run out of steam."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=67f4e69beb076ac6161b837b69721f6d1012cdbaf247a2d25345d772efd79abc"}
{"Ticker":"TSLA","Date":1642390080,"Headline":"Why Tesla’s Elon Musk asked a partner at a law firm to fire an associate hired from the SEC","Source":"DowJones","Summary":"At the SEC, the attorney had interviewed Musk during the agency’s investigation of the Tesla chief executive’s 2018 tweets"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a202d53d6ff1eeaf820b8b8eacbbf8779fbf25ab562ad22d316337605b03729"}
{"Ticker":"TSLA","Date":1642545492,"Headline":"Crescent Capital Consulting, LLC Buys iShares TIPS Bond ETF, Invesco BulletShares 2024 High ...","Source":"Yahoo","Summary":"Investment company Crescent Capital Consulting, LLC (Current Portfolio) buys iShares TIPS Bond ETF, Invesco BulletShares 2024 High Yield Corporate Bon, SPDR S&P Bank ETF, BTC iShares MSCI USA Min Vol Factor ETF, iShares S&P 500 Growth ETF, sells iShares MSCI ACWI Ex US Index Fund, Global X U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23cc970c907b65f0730395e99640cbba1c22ff4a4a6710852b47f5c2793ac7c2"}
{"Ticker":"TSLA","Date":1642535940,"Headline":"Tesla driver charged with vehicular manslaughter after fatal crash involving Autopilot","Source":"Yahoo","Summary":"California prosecutors have filed two counts of vehicular manslaughter against the driver of a Tesla on Autopilot who ran a red light, slammed into another car and killed two people in 2019."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c1ca8e2ab9838acde04c9bf51dde06cdfb3328d6357343b40f4c092b7547cd88"}
{"Ticker":"TSLA","Date":1642535296,"Headline":"GME, AMC slide 10% amid market sell-off, apes vow holding","Source":"Yahoo","Summary":"Shares of GameStop (GME) and AMC (AMC), the flagship 'meme-stocks' were sliding on Tuesday amid a broader market selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=31239e48ce080175df3b4ae56d888e233b9049734137e912b8857ef8e5887df8"}
{"Ticker":"TSLA","Date":1642535100,"Headline":"Goldman Sachs: 4 'buy' rated stocks with up to 60% upside","Source":"Yahoo","Summary":"2022 is off to a sluggish start. But Goldman likes this group to bounce back."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c51191b0d617651f35830de9d0fecab7209b65b86183c690b7dfab182ae8d2c6"}
{"Ticker":"TSLA","Date":1642533829,"Headline":"Tesla investors urge judge to order Musk repay $13 billion for SolarCity deal","Source":"Reuters","Summary":"Tesla Inc shareholders urged a judge on Tuesday to find Elon Musk coerced the company's board into a 2016 deal for SolarCity and asked that the chief executive be ordered to pay the electric vehicle company one of the largest judgments ever of $13 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8a948979c0124797ec3cddaae94e1acf668b2a809e81bb2347d606929bf25940"}
{"Ticker":"TSLA","Date":1642532991,"Headline":"UPDATE 1-Tesla investors urge judge to order Musk repay $13 bln for SolarCity deal","Source":"Yahoo","Summary":"Tesla Inc shareholders urged a judge on Tuesday to find Elon Musk coerced the company's board into a 2016 deal for SolarCity and asked that the chief executive be ordered to pay the electric vehicle company one of the largest judgments ever of $13 billion.  \"This case has always been about whether the acquisition of SolarCity was a rescue from financial distress, a bailout, orchestrated by Elon Musk,\" Randy Baron, an attorney for shareholders, told the Zoom hearing.  The closing arguments recounted key findings from a 10-day trial in July when Musk spent two days on the stand defending the deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0111a9962cc8c8b3f8dbaa36b730883cb1d16d822b8fb28ff05fc34d665454ed"}
{"Ticker":"TSLA","Date":1642531860,"Headline":"Elon Musks Claps Back Over FSD, Starts Another Twitter Spat","Source":"Yahoo","Summary":"King not just of Tesla  but also of clapping back on Twitter , Elon Musk called the software being used for some other electric vehicles \"a pile of trash.\"  The argument began when, on Sunday, Green Hills Software CEO Dan O'Dowd wrote that he had placed a full-page ad against Tesla's Full Self-Driving (FSD) technology in The New York Times.  \"Today I placed a full-page advertisement in the @nytimes, campaigning to ban @Tesla full self-driving from our roads,\" O'Dowd, who founded Green Hills Software in the 1980s, wrote."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d0ca954704f9a842021e351cda07525b38ef8370548d64e5d756cd0100b622e5"}
{"Ticker":"TSLA","Date":1642531227,"Headline":"Tesla: Everything You Need to Know Ahead of Earnings","Source":"Yahoo","Summary":"The words Tesla (TSLA) and EVs are synonymous these days, but Jefferies analyst Philippe Houchois thinks it’s time the conversation moved on from here; it should no longer revolve around the opportunity EVs represent – it’s already common knowledge these will replace ICE cars over the next several years. In turn, the talk should center on “how much global share Tesla will gain this year and through 2023.” As such, when the company reports 4Q21 earnings next Thursday (Jan 26), Houchois thinks the"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9a560800ba382104f07d1f687af06b272aa83ee6cd9ae129ea21430e3e372e57"}
{"Ticker":"TSLA","Date":1642531112,"Headline":"BCS Wealth Management Buys Procter & Gamble Co, Vanguard Short-Term Corporate Bond ETF, ...","Source":"Yahoo","Summary":"Investment company BCS Wealth Management (Current Portfolio) buys Procter & Gamble Co, Vanguard Short-Term Corporate Bond ETF, Kimberly-Clark Corp, Tesla Inc, IQ MacKay Municipal Insured ETF, sells Invesco BulletShares 2021 Corporate Bond ETF, Invesco BulletShares 2021 High Yield Corporate Bon, Invesco BulletShares 2021 Municipal Bond ETF, VanEck Vectors Fallen Angel High Yield Bond ETF, iShares iBonds Dec 2021 Term Muni Bond ETF during the 3-months ended 2021Q4, according to the most recent fil"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=867ed76c8d37f909851c44cd8a29395a9eedcea7fa65f726dd483f41e2b3e5d5"}
{"Ticker":"TSLA","Date":1642531105,"Headline":"First National Bank of South Miami Buys iShares Commodities Select Strategy ETF, Walmart Inc, ...","Source":"Yahoo","Summary":"Investment company First National Bank of South Miami (Current Portfolio) buys iShares Commodities Select Strategy ETF, Walmart Inc, Ford Motor Co, Kinder Morgan Inc, Flowers Foods Inc, sells iShares iBonds Dec 2021 Term Corporate ETF, BTC iShares U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9bd0765fcc7f4e6520d406cd76d2443d6317b7e855e60a0081deb7b4bb1df076"}
{"Ticker":"TSLA","Date":1642531082,"Headline":"Lowe Wealth Advisors, LLC Buys KraneShares Global Carbon Strategy ETF, Horizon Kinetics ...","Source":"Yahoo","Summary":"Investment company Lowe Wealth Advisors, LLC (Current Portfolio) buys KraneShares Global Carbon Strategy ETF, Horizon Kinetics Inflation Beneficiaries ETF, JPMorgan Equity Premium Income ETF, iShares Russell 2000 ETF, Ford Motor Co, sells Industrial Select Sector SPDR, AT&T Inc, FMC Corp, First Trust Chindia ETF, VanEck Oil Services ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Lowe Wealth Advisors, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db74d8d4ea8c385666ad86b3ff573180aa2e4db4cd4395f6fcac8a61401f5422"}
{"Ticker":"TSLA","Date":1642527028,"Headline":"Here's How Cadence Is Set To Gain Despite Competition From Tesla, Apple","Source":"Yahoo","Summary":"Cadence Design Systems Inc (NASDAQ: CDNS) is betting on growth from automakers and other chip users strapped by the global supply crisis, Reuters reports. Cadence is a microchip design software maker. The chipmakers face mounting competition from chips made by Tesla Inc (NASDAQ: TSLA) and Apple Inc (NASDAQ: AAPL). The report added that Cadence and rivals Synopsys Inc (NASDAQ: SNPS) and Siemens EDA are at the center of a microchip industry shift. Cloud computing providers, software makers, and ot"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89ffd09c1b33dc5508395c527d168b2170e32b959ac3c2fe47c86f50a596022a"}
{"Ticker":"TSLA","Date":1642526040,"Headline":"Be Ready To Take Advantage of a Dip in Lucid Stock","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7282de4c3a46e5b4daae20e389abb0a1f57ce3403f1e0a833916bc9377e0ab8b"}
{"Ticker":"TSLA","Date":1642524915,"Headline":"REFILE-Tesla investors urge judge to order Musk repay $13 bln for SolarCity deal","Source":"Yahoo","Summary":"Tesla Inc shareholders urged a judge on Tuesday to find Elon Musk coerced the company's board into a 2016 deal for SolarCity and asked that the chief executive be ordered to pay the electric vehicle company one of the largest judgments ever of $13 billion.  \"This case has always been about whether the acquisition of SolarCity was a rescue from financial distress, a bailout, orchestrated by Elon Musk,\" said Randy Baron, an attorney for shareholders, at the start of his closing arguments.  The closing arguments recounted key findings from a 10-day trial in July when Musk spent two days on the stand defending the deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=222ee1dbd6fce803b575ea417f05f1661fb6ef2f8d1f8fea3baf457572d290ac"}
{"Ticker":"TSLA","Date":1642524480,"Headline":"Nio Stock Is One of the Best EV Stocks to Start the New Year","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6e0b3c1e9fccb480b3af7b5ba97ffc1cc40467772fdf787424236c3134a3d0c8"}
{"Ticker":"TSLA","Date":1642523520,"Headline":"FOCUS-Cadence Design Systems aims to cash in on new custom-chip era","Source":"Nasdaq","Summary":"Microchip design software maker Cadence Design Systems Inc is betting on growth from automakers and other chip users strapped by global supply shortages who face mounting competition from rivals such as Tesla Inc and Apple Inc that design their own chips."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d72a876fc3da4387a4499c5e99f0de22a7c2cc1511ad37efdcd4578366ad5b7"}
{"Ticker":"TSLA","Date":1642523247,"Headline":"Why Tesla Stock Dropped, Then Popped Today","Source":"Yahoo","Summary":"Tesla (NASDAQ: TSLA) stock is bouncing around like an electric car on a long gravel road this morning.  Down 3.1% as of 9:40 a.m. ET, Tesla soon recovered all its losses, and even began marching toward a 2% gain -- before slipping back toward zero again.  Down again, up again, where will Tesla stock end the day?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0a1ecd510cec0aff9d60f06a0bd13189e73184d78a3b4602e13fd12d285728e"}
{"Ticker":"TSLA","Date":1642522500,"Headline":"Tesla Stock Has Texas-Sized Gains Right Around the Corner","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9ea1489565ffe1713363baaf5fe1f26d3176fbd35d76b801a885b230dd29e322"}
{"Ticker":"TSLA","Date":1642520641,"Headline":"Market check: 10-year Treasury yield climbs to 2-year high, Dow falls 500+ points","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre breaks down how the stock and bond markets are performing in early trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e8ff053b63d1a33d90257e0ea8b8c41d36b2654665a02b4ad4942db341e6067"}
{"Ticker":"TSLA","Date":1642520535,"Headline":"11 Good And 4 Bad Reasons To Keep Holding ARK Invest","Source":"SeekingAlpha","Summary":"The few who bought ARKK before its rise should hold. The majority who bought at the 02\/2021 peak risk long-term losses. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23bcddbc25c54143d05baa8072462efc36f978882b3d87ab2cc834af4ac9fa0c"}
{"Ticker":"TSLA","Date":1642520340,"Headline":"7 Nickel Stocks to Buy if You Missed Out on Talon Metals’ Takeoff","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8de39661c3c6bca0fd91195192649110c16ce8c6f6e4b3b1383915ec9a14f92d"}
{"Ticker":"TSLA","Date":1642519440,"Headline":"GGPI Stock Still Looks Very Cheap","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a28035e4862fd6ba008086c8a537690811cf1d6671b8e8829f422635cf47a65"}
{"Ticker":"TSLA","Date":1642519020,"Headline":"Tech Stocks Alert: Why TSLA, NVDA, FB, AMZN, UBER Stocks Are Down Today","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3f9afdbd0654a20034f61291361999a0d0057b625f12876db5ff7001125f2134"}
{"Ticker":"TSLA","Date":1642517820,"Headline":"3 New ETFs to Put on Your January Buy List","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0a636f053516673f405166f75f48f6dceed44e238ff088d151c44496a5ae43d7"}
{"Ticker":"TSLA","Date":1642517480,"Headline":"Dow Jones Dives As Yields Surge To Two-Year Highs; Apple, Tesla Skid","Source":"Yahoo","Summary":"The Dow Jones Industrial Average sold off 300 points Tuesday, as the 10-year Treasury yield surged to a two-year high. Tesla stock skidded."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ce347d4df7e48a1a79bb0947ea88dbef01189578e0a0b40991b193e9efe05129"}
{"Ticker":"TSLA","Date":1642517410,"Headline":"Tesla Accepts Dogecoin for Some Merchandise Sales","Source":"Yahoo","Summary":"Electric carmaker Tesla (TSLA) has begun accepting the Dogecoin cryptocurrency for purchases of some merchandise on its website."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=28072ccd608bc8e2549d9eddd8ada611b30163acfb9bdeefddb0010896cb7236"}
{"Ticker":"TSLA","Date":1642514940,"Headline":"Tesla investors urge judge to order Musk repay $13 bln for SolarCity deal","Source":"Nasdaq","Summary":"Tesla Inc shareholders urged a judge on Tuesday to find Elon Musk coerced the company's board into a 2016 deal for SolarCity and asked that the chief executive be ordered to pay the electric vehicle company one of the largest judgments ever of $13 billion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0af4040a2a38c2d0fbdd3f3d07065810462413979c6cf842d80abdd463ec05d3"}
{"Ticker":"TSLA","Date":1642513860,"Headline":"Polestar Will Continue to Deliver for Gores Guggenheim’s Shareholders","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d8a29d8c013da95ec4911ce35e82ab18a53bf005d72502321356ad04300e1bbb"}
{"Ticker":"TSLA","Date":1642512960,"Headline":"Be Prepared For a Volatile Ride With Fisker Stock","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89d864e2a01af6501d6e910884e676a6f02c74740c290451e47a9e4b503d0b13"}
{"Ticker":"TSLA","Date":1642512480,"Headline":"6 Sustainable Crypto Mining Stocks Vying for Kevin O’Leary’s ‘Wonderful’ Money","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3a988320ad891bfb2efab96dd633d25e237bc3b44503708f9eb474e3983ee9c"}
{"Ticker":"TSLA","Date":1642506915,"Headline":"Telsa investors urge judge to order Musk repay $13 bln for SolarCity deal","Source":"Finnhub","Summary":"Tesla Incshareholders urged a judge on Tuesday to find Elon Musk coercedthe company's board into a 2016 deal for SolarCity and askedthat the chief executive be ordered to pay the electric... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=62cd3c0ad282ab6478f9f93442bd88728fb73b777f897ff7b990f64270756923"}
{"Ticker":"TSLA","Date":1642502940,"Headline":"VTI, MSFT, TSLA, GOOGL: ETF Inflow Alert","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Vanguard Total Stock Market ETF (Symbol: VTI) where we have detected an approximate $4.9 billion dollar inflow -- that's a 1.7% increase week over w"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e71b33535da36cda57cfcb86ab78458d3090b55d90f0f50938c99e8d4d660019"}
{"Ticker":"TSLA","Date":1642501511,"Headline":"Microsoft's $68.7 billion deal for Activision once again shows big tech's dominance over legacy media","Source":"CNBC","Summary":"Microsoft takes big $68.7 billion swing on video game company Activision Blizzard while legacy media stays on sidelines"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a5205c04e8f94f2b43d56a1755255b55dd0f87260fc875c098ba3919100852df"}
{"Ticker":"TSLA","Date":1642501440,"Headline":"Ford (F) Inks 5-Year Deal With Stripe to Boost Digital Commerce","Source":"Nasdaq","Summary":"Ford Motor Co. F recently signed a five-year deal with online payment processor, Stripe, to bolster its e-commerce strategy.Per the agreement, Stripe will look after the transactions for consumer vehicle orders and reservations, as well as bundled financing options for Fo"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c7af8897cdd644133eb25265734312f8c7857f4ef2594fab0ac53a84eb5b78ae"}
{"Ticker":"TSLA","Date":1642501080,"Headline":"Volkswagen, Bosch team up to equip battery cell gigafactories","Source":"Nasdaq","Summary":"Volkswagen and Bosch have signed a deal to set up a joint venture by the end of this year to equip battery cell factories and help make Europe self-sufficient in battery production, Volkswagen said on Tuesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6097ce1d115c0ce4e56c70826a1a7f6e417d0096f16617683e5c795bde37ab8d"}
{"Ticker":"TSLA","Date":1642500720,"Headline":"US STOCKS-Wall St falls on tech drag; GS results trigger more bank declines","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as big technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17208323599ef5fd4929cb459d94f9b9378823d1ddc75fbf51c769ad93bf9290"}
{"Ticker":"TSLA","Date":1642500120,"Headline":"If You Invested $1000 In This Stock 10 Years Ago, Here's How Much You Would Have Today","Source":"Benzinga","Summary":"Tesla (NASDAQ:TSLA) has outperformed the market over the past 10 years by 55.54% on an annualized basis. \nBuying $1,000 In TSLA: 10 years ago, an investor could have purchased 186..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=723a26525ca11f5387d97755de82541f3a8460a5640e806b610240d0756e025a"}
{"Ticker":"TSLA","Date":1642498934,"Headline":"TESLA : Gets a Neutral rating from UBS","Source":"Finnhub","Summary":"In a research note, UBS analyst Patrick Hummel has maintained his recommendation on the stock with a Neutral rating. The target price continues to be set at USD 1000. | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2bfe98667ec88f52d09b0554f79c0661261af3525df0d92bb28be3e07668d008"}
{"Ticker":"TSLA","Date":1642498680,"Headline":"Activision, Apple, Tesla, Goldman Sachs: What to Watch When the Stock Market Opens Today","Source":"DowJones","Summary":"Activision Blizzard shares soared on a deal with Microsoft; Goldman Sachs reported a profit drop."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b50371d5c8f11c3e6763b5f3a1dcea2391196f90682d10be5f50975ac1d86dd"}
{"Ticker":"TSLA","Date":1642498142,"Headline":"Bitcoin investors dig in for long haul in 'staggering' shift","Source":"Finnhub","Summary":"As bitcoin heads into 2022, a growing cohort of long-term investors is doubling down on its stashes of the cryptocurrency, hoping a December dip was merely a festive blip.... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f89e20bb38de478e95e3b483a2e33853b2f326a89d2599f4a9708aa8508971d7"}
{"Ticker":"TSLA","Date":1642497360,"Headline":"Still Waiting for the Right Entry Point? Buy NIO Now","Source":"Nasdaq","Summary":"NIO Inc. NIO has had an unimpressive run on the bourses in 2021, with shares underperforming the industry (-35% vs +2.6%). The China-based electric vehicle (EV) maker took a beating owing to the global chip crisis, equity offerings by the firm and regulatory concerns in C"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3e90654ea6904ed3580cc0fb242e06d5a3465da212c012e276af19ff377988e6"}
{"Ticker":"TSLA","Date":1642494300,"Headline":"EV Roundup: TSLA-Talon Deal, NIO-Baosteel Pact & More","Source":"Nasdaq","Summary":"Electric vehicle (EV) popularity and adoption are soaring with each passing day. Last week, 2021 sales data of new energy vehicles (NEVs) in China was released. According to data compiled by the China Passenger Car Association, full-year deliveries of NEVs (including all"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1072a5e6605c592b518ee4d7a7bc13a966a896645c2462dbb6d7b1a329b4404"}
{"Ticker":"TSLA","Date":1642491420,"Headline":"Tesla (TSLA) Deploys FSD Beta V10.9, Plans Expansion in Canada","Source":"Nasdaq","Summary":"Tesla TSLA recently began rolling out a new version of its Full Self-Driving (FSD) Beta software – version 10.9 – featuring a number of incremental changes to enhance its real-world performance substantially.The electric vehicle (EV) giant has been gradually pushing out i"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d60ca2069063889e5d7414cac2c1d78222c1e979a63a6b84395c736feb37c80"}
{"Ticker":"TSLA","Date":1642491360,"Headline":"DéJà Vu All Over Again","Source":"SeekingAlpha","Summary":"The financial markets will consistently behave similarly to whatever they have done in the past under nearly-matching conditions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=18f5ae3f874f5eedaff045422fb3ffc90aa06175d73fc3cf1cf5bdab17c64ad6"}
{"Ticker":"TSLA","Date":1642490225,"Headline":"TESLA : Credit Suisse sticks Neutral","Source":"Finnhub","Summary":"In a research note published by Dan Levy, Credit Suisse gives a Neutral rating to the stock. The target price is increased from USD 830 to USD 1025. | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2d0b3470e35b7db03626ed39d86d7f60c346608b592742306523508676aba60b"}
{"Ticker":"TSLA","Date":1642484580,"Headline":"2 Signs Shiba Inu's Crash Will Continue in 2022","Source":"Nasdaq","Summary":"Soaring a jaw-dropping 60,00,000% by its peak in late October, Shiba Inu (CRYPTO: SHIB) was one of the top-performing assets in 2021. But now it is crashing, and the pain looks likely to continue in the new year. Let's explore two big reasons investors should sell this dog of a c"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=981e94bb4fcfe3dd4a25bbfca94251561d87e9227700b889db5f8126daa6d090"}
{"Ticker":"TSLA","Date":1642481220,"Headline":"China's CATL launches battery swap service for electric cars","Source":"Nasdaq","Summary":"China's Contemporary Amperex Technology Co Ltd on Tuesday launched a battery swap service for electric vehicles (EV) called EVOGO, which it said would allow drivers to change car batteries in one minute."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2ae3c7cfea08c475acfe23b44af3b689b277c6d4f8f7583e7a0a6d92abe568f0"}
{"Ticker":"TSLA","Date":1642476059,"Headline":"Tesla CEO Elon Musk to visit Berlin factory in mid February","Source":"Finnhub","Summary":"Elon Musk will visit Tesla'sfactory in Berlin in mid-February, the chief executivetweeted on Tuesday, following speculation on Twitter that hewould be in Germany this month. I obv... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f3fd5b21f173db77ab5177120f170b1b75f0b80b6f7e729d27ecbe7fd3c1658a"}
{"Ticker":"TSLA","Date":1642464001,"Headline":"After flying start, Stellantis must tackle Tesla and China","Source":"Yahoo","Summary":"If playing catch up with Tesla is what everyone in the auto industry is about then Stellantis, the company formed from the merger of Fiat Chrysler and Peugeot, has had a good start – its shares have far outpaced its U.S. rival in its inaugural year.  Fixing its business in China and overcapacity in Europe are just two areas where analysts want to see Stellantis making progress when Chief Executive Carlos Tavares unveils his detailed business plan on March 1."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1354e40777ed26c10e455a426aba3889cf2134b3e16ead313f23184523184a58"}
{"Ticker":"TSLA","Date":1642622009,"Headline":"An 'EV tipping point' is approaching, but that's not good news for Tesla: B. of A.","Source":"Yahoo","Summary":"With several electric vehicles coming to the market by legacy and new auto makers soon, analysts at B. of A. Securities expect that a \"tipping point\" for EVs will happen this year, although higher prices would remain a constraint. The year 2022 \"marks the start of commercialization for electric vehicles ... with many of start-up EV automakers launching\/ramping new product and many of the incumbent automakers also beginning their product launch onslaught,\" the analysts said in a note Wednesday. B"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0033455b87ae028680e7238194bb0c23e1f362f2e6f79440931133788823a1ab"}
{"Ticker":"TSLA","Date":1642619097,"Headline":"Tesla dealership, service center coming to Miami Gardens","Source":"Yahoo","Summary":"Tesla will open a dealership and service center in Miami Gardens following a renovation.  This will be the fifth service center in South Florida for the Austin, Texas-based electric carmaker (Nasdaq: TSLA), and its second in Miami-Dade County.  Its other area service centers are in Coral Gables, Fort Lauderdale, Delray Beach and West Palm Beach."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=03ce3e23626440fbfaeb39e97ba53f729f8ce9995e5bf97c0625fee7addac156"}
{"Ticker":"TSLA","Date":1642618958,"Headline":"Toyota stock sinks as supply chain issues hit production","Source":"Yahoo","Summary":"Jeff Schuster, LMC Automotive President of Americas Operations and Global Vehicle Forecasts, joins Yahoo Finance Live to examine Toyota's production miss due to chip shortages, the supply chain for automakers, challenges when buying cars, Tesla investing in chip suppliers, automotive sales in the U.S. and Asian markets, and the EV space."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=99bf71f0ffd1b03d3e3b600a99e92e86697dcf0a8256e107573a04f3427d0086"}
{"Ticker":"TSLA","Date":1642618080,"Headline":"Tesla earnings: News about the Cybertruck and new factories could set the tone for 2022","Source":"Yahoo","Summary":"Tesla Inc. is scheduled to report fourth-quarter earnings next Wednesday, as investors expect a return of Chief Executive Elon Musk to the post-results call and brace for what could be worrying news for the Cybertruck and supply-chain snags."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=52e89e66107ecdda67dbf6a8429ba5a7da8b2d8f2720fc631838807d3f916d72"}
{"Ticker":"TSLA","Date":1642618020,"Headline":"Tesla CEO Elon Musk Could Face a Bill Even Bigger Than His Taxes","Source":"Yahoo","Summary":"Plaintiffs in a lawsuit about Tesla's Solar City acquisition want Musk to pay $13 billion. Investors don't seem worried he could have to sell stock to raise the money."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90f975c23d6aa3055fc20d25492c401c69e9c312dfec732b652f9dd1eb3fa340"}
{"Ticker":"TSLA","Date":1642617585,"Headline":"Meme stocks: 'A lot of people will lose a lot of money,' Interactive Brokers founder says","Source":"Yahoo","Summary":"It's been about a year since GameStop overtook headlines and the 'meme stock' phenomenon was born. However speculative assets have been under pressure recently amid expectations of a more hawkish Federal Reserve to combat inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f3728cf3abbbece83b5f47355fd2cf42848758cf47d7042874ccad178a398626"}
{"Ticker":"TSLA","Date":1642617493,"Headline":"Newbridge Financial Services Group, Inc. Buys Apple Inc, NVIDIA Corp, NXP Semiconductors NV, ...","Source":"Yahoo","Summary":"Investment company Newbridge Financial Services Group, Inc. (Current Portfolio) buys Apple Inc, NVIDIA Corp, NXP Semiconductors NV, Microsoft Corp, Tesla Inc, sells NIO Inc, Lemonade Inc, Alibaba Group Holding, Carnival Corp, Blackstone Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Newbridge Financial Services Group, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5f5aeb19afc80c073833a32488caaac29e6912afb4da8c2c1af9f76746f74a9"}
{"Ticker":"TSLA","Date":1642613890,"Headline":"India's Maharashtra state bats for Tesla over import tax on EVs","Source":"Reuters","Summary":"India's western Maharashtra state on Wednesday urged the federal government to lower tax rates on imported cars in the budget on Feb. 1, following calls by electric carmakers like Tesla."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=662905d6a6e031ee280eb55c3df37f1d42ddba006d1e4b184b0ee5ff6b248aa4"}
{"Ticker":"TSLA","Date":1642613820,"Headline":"It's the Earnings, Stupid - Part 2","Source":"Benzinga","Summary":"Last October—which feels like decades ago—I wrote a contrarian piece targeting those warning of a stock market crash of Depression-era proportions.  So long..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4a6f7ea0d5806d333d15eb655823d638bc2aa093b27f9a80e672af1a06cc48a"}
{"Ticker":"TSLA","Date":1642613580,"Headline":"LA Court Files Lawsuit Against 2019 Tesla That Killed 2","Source":"Nasdaq","Summary":"(RTTNews) - The United States judicial system launches its first manslaughter charges against AI-assisted driving as it charged Kevin George Aziz Riad, whose Tesla Inc.'s (TSLA) Model S collided with another car causing two fatalities back in 2019. With General Motors Company (GM"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8bf8fe0e9a459d2bdcf15fc76b94c3bca45edef54cbf7b1077ccc117e6697e19"}
{"Ticker":"TSLA","Date":1642613316,"Headline":"Elon Musk responds to ‘tragic’ Tesla self-driving ad","Source":"Yahoo","Summary":"Full-page newspaper ad warned people not to be ‘crash test dummies’ in Tesla vehicles equipped with Full Self-Driving software"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9f51407935e895fb83c37ecf951f5368bf9d757e162926151a6923b069ba2729"}
{"Ticker":"TSLA","Date":1642613117,"Headline":"Why Tesla Stock Fell on Wednesday","Source":"Yahoo","Summary":"Along with many other growth stocks, the electric car maker's shares have had a rough start to 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17ff03fd6cab85da70c062df028147691108df1a8fef71dd7f32676ef96fb35d"}
{"Ticker":"TSLA","Date":1642611300,"Headline":"US STOCKS-Wall Street sell-off deepens, Nasdaq confirms correction","Source":"Nasdaq","Summary":"Wall Street's main indexes ended sharply lower on Wednesday, with the tech-heavy Nasdaq confirming it was in a correction, after a diverse set of corporate earnings and as investors continued to worry about higher U.S. Treasury yields and the Federal Reserve tightening monetary policy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9b078482a37b025dca72b76db11fd9fc603523d2c4b999536095181fb5ec9778"}
{"Ticker":"TSLA","Date":1642611300,"Headline":"Wall Street sell-off deepens, Nasdaq confirms correction","Source":"Finnhub","Summary":"Wall Street's main indexes ended sharplylower on Wednesday, with the tech-heavy Nasdaq confirming it wasin a correction, after a diverse set of corporate earnings andas investors continued to worry... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=07c7a29a86f8335cf51e047fc362f039893e439101a31ad2d2b0f1c4602bd98d"}
{"Ticker":"TSLA","Date":1642610580,"Headline":"The Forever Battery That Promises to Change the EV Industry","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d265e2a95a4439f0126ef8276deba778c4db09d78d2f88a3e605ed117ba19fa9"}
{"Ticker":"TSLA","Date":1642610055,"Headline":"Why Lucid Stock Got a Lift Today","Source":"Yahoo","Summary":"Loosey-goosey Lucid Group (NASDAQ: LCID) stock is wandering higher in Wednesday-morning trading, rising 5.8% through 11:05 a.m. ET.  Apple may not love Lucid -- but Jay Leno does.  Reminding viewers that Lucid's Air was just named Motor Trend's 2022 car of the year, Leno explained that he didn't want to run a segment on the Air until it was actually available for sale."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=903dee83d5fe214a442bd3e14fd3ca43cfe8d27ef463bdc114040b1366a61a69"}
{"Ticker":"TSLA","Date":1642609740,"Headline":"Nasdaq confirms fourth correction since pandemic hit","Source":"Nasdaq","Summary":"The Nasdaq's loss on Wednesday left it down nearly 11% from its November record high close, marking the fourth time in the nearly two years since the coronavirus pandemic shook global markets that the tech-heavy index has found itself in a correction."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a14da25ec31fbe9edbc80daf6804b869ffc8fa3a82792f192491e94147be2e78"}
{"Ticker":"TSLA","Date":1642607400,"Headline":"Watch for a Buy Point in Advanced Micro Devices","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e760f763733314f29a44111eb6652fb1a4b9839023913cf05c380e7139e4505e"}
{"Ticker":"TSLA","Date":1642606260,"Headline":"7 Memorable Times Elon Musk Moved Stocks and Crypto in 2021","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=da009801d3d9ef70985304c1d956c2da5996f081ba113681cd24df95c7e02440"}
{"Ticker":"TSLA","Date":1642606020,"Headline":"Tesla Earnings Estimates Are Rising, but the Stock Is Down. What’s Behind the Paradox.","Source":"Yahoo","Summary":"Analysts are lifting earnings estimates on EV giant Tesla, but shares have been caught up in something bigger than just one stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ddb87930b0ecec2dc8fea2337a1a83d14b987061fe60dff516a81a114b87ebd9"}
{"Ticker":"TSLA","Date":1642605003,"Headline":"General Motors (GM) to Boost Foothold in EV and E-Commerce Space","Source":"Yahoo","Summary":"General Motors (GM) is launching an online parts marketplace, advancing its e-commerce capabilities. Meanwhile, GM partners with Blink Charging for the deployment of EV Chargers in North America."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bc8b9453bcc1cb161fbc45e0aa90817383629e56dc1313e942d3cb4d19c6c6cc"}
{"Ticker":"TSLA","Date":1642604949,"Headline":"Tesla China: As Good As It Gets?","Source":"SeekingAlpha","Summary":"For Tesla's CY2021 sales in China, the headlines are good. But the story is not as rosy when I dive into the numbers. Read more about TSLA's Chinese sales here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d75abe83b5b0c9d95c1e016fff827a136a206bdefa86a027ff107a2184e17533"}
{"Ticker":"TSLA","Date":1642604460,"Headline":"Tesla (TSLA) Reports Next Week: Wall Street Expects Earnings Growth","Source":"Nasdaq","Summary":"The market expects Tesla (TSLA) to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended December 2021. This widely-known consensus outlook is important in assessing the company's earnings picture, but a powerful fa"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8da568755e2b3aaed1a77b5334eec996533c8b8a2342f6d7e4f7d8a894396c29"}
{"Ticker":"TSLA","Date":1642603110,"Headline":"Joel Isaacson & Co., LLC Buys Farfetch, 1stdibs. ...","Source":"Yahoo","Summary":"New York, NY, based Investment company Joel Isaacson & Co., LLC (Current Portfolio) buys Farfetch, 1stdibs.com Inc, SoFi Technologies Inc, SoFi Technologies Inc, iShares MSCI USA ESG Optimized ETF, sells Apollo Global Management Inc, Arvinas Inc, Federal Realty Investment Trust, Moderna Inc, iShares New York Muni Bond ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Joel Isaacson & Co., LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50c2b607ec0c816c5690d508bf3d01b15cd958ea4d710895809e5ce515974a42"}
{"Ticker":"TSLA","Date":1642603103,"Headline":"Beech Hill Advisors, Inc. Buys Block Inc, The Walt Disney Co, Activision Blizzard Inc, Sells ...","Source":"Yahoo","Summary":"New York, NY, based Investment company Beech Hill Advisors, Inc. (Current Portfolio) buys Block Inc, The Walt Disney Co, Activision Blizzard Inc, Crown Castle International Corp, Gilead Sciences Inc, sells Delta Air Lines Inc, Broadcom Inc, L3Harris Technologies Inc, Exact Sciences Corp, Chewy Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Beech Hill Advisors, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ba746205c66c889964fb56f8c289707b304cd5021b3075174d7dd2463b4e6b57"}
{"Ticker":"TSLA","Date":1642603099,"Headline":"Cerro Pacific Wealth Advisors LLC Buys JPMorgan Short Duration Core Plus ETF, Simon Property ...","Source":"Yahoo","Summary":"Investment company Cerro Pacific Wealth Advisors LLC (Current Portfolio) buys JPMorgan Short Duration Core Plus ETF, Simon Property Group Inc, Pioneer Natural Resources Co, Duke Energy Corp, Prudential Financial Inc, sells American Tower Corp, Eversource Energy, Valero Energy Corp, Global Payments Inc, Linde PLC during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Cerro Pacific Wealth Advisors LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e297656fdec823138fbd30e41a55147fcaed708863259e7009fa7852bd006550"}
{"Ticker":"TSLA","Date":1642603096,"Headline":"Signature Wealth Management Partners, LLC Buys Verizon Communications Inc, Lumen Technologies ...","Source":"Yahoo","Summary":"Investment company Signature Wealth Management Partners, LLC (Current Portfolio) buys Verizon Communications Inc, Lumen Technologies Inc, ETFMG Alternative Harvest ETF, FIRST TR ETF VI, Cognizant Technology Solutions Corp, sells AT&T Inc, TransMedics Group Inc, Splunk Inc, Biogen Inc, ConocoPhillips during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Signature Wealth Management Partners, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=060eb05ab763be290811e6e42e4ddc9a6961a9ee6aa4a3636223083998c8fb3f"}
{"Ticker":"TSLA","Date":1642603096,"Headline":"TruWealth Advisors, LLC Buys Accenture PLC, iShares Core MSCI Total International Stock ETF, ...","Source":"Yahoo","Summary":"Investment company TruWealth Advisors, LLC (Current Portfolio) buys Accenture PLC, iShares Core MSCI Total International Stock ETF, PowerShares QQQ Trust Ser 1, Broadcom Inc, Blackstone Inc, sells Walmart Inc, Industrial Select Sector SPDR, PowerShares NASDAQ Internet Portfolio, Owl Rock Capital Corp, Atmos Energy Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, TruWealth Advisors, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2da56f57873f7d4f8b437e31a638e670a2468d7f4547e7600067d017266194bb"}
{"Ticker":"TSLA","Date":1642600680,"Headline":"Funds Added To TSLA Positions","Source":"Nasdaq","Summary":"At Holdings Channel, we have reviewed 483 13F filings for the 12\/31\/2021 reporting period, and looked at the various S&P 500 components held by each of these reporting hedge funds and other 13F filers.  For each component, we totaled the number of shares held across all of th"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0a9377a04a2a81a630cdb95871f493f10d172f8fd6b6714a9916fa8ee512bb72"}
{"Ticker":"TSLA","Date":1642596960,"Headline":"7 Stocks That Could Join Apple in the $3 Trillion-Dollar Club by 2030","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d150b3b703f56cae6db02e43a9eb0d4603fe514fdce336b21ea659f75bb51ca3"}
{"Ticker":"TSLA","Date":1642589640,"Headline":"Virgin Galactic Stock Needs Its Fans Back in Order to Climb High Again","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=739da1c458fe749a900dd89b07ed7cd1b6553ad1cb5508bf46684dec0c2212ea"}
{"Ticker":"TSLA","Date":1642588200,"Headline":"This Rental Car Stock's 1-Year Return Laps Tesla, Nio, GE, Plug Power","Source":"Benzinga","Summary":"Avis Budget Group Inc. (NASDAQ: CAR) gets you where you need to go, and over the past year, portfolios a ride of a lifetime.\nSince January 2021, Avis stock’s one-year..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e9fc5ff4acc3f858a17fb315cf9556ce7e940f468fd8b0d76050f87429c4a72b"}
{"Ticker":"TSLA","Date":1642586460,"Headline":"US STOCKS-Wall St rises on earnings boost; Big Tech bounces back","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after upbeat results from a host of companies partially offset a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53e439dc5abfb7833501baa5c86042f25e164db55d1e5189bad5d214a62cf424"}
{"Ticker":"TSLA","Date":1642583640,"Headline":"4 Top-Ranked Liquid Stocks to Boost Portfolio Returns in 2022","Source":"Nasdaq","Summary":"Investors seeking healthy returns can benefit by adding stocks with favorable liquidity levels to their portfolios. Liquidity levels are a good indicator of a company’s financial health.Liquidity measures the company’s ability to meet short-term debt obligations by conver"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dce99b1a05cd1c856989f0adc9fd3aabc94e5de6e4634c52b1d2d5f470cc2a94"}
{"Ticker":"TSLA","Date":1642583640,"Headline":"Why Tesla Is the One Stock I'd Avoid in 2022","Source":"Nasdaq","Summary":"Tesla's (NASDAQ: TSLA) stock performance over the last decade has been nothing short of exceptional. Shares are up almost 23,000% in the last 10 years alone, making it one of the top-performing stocks in the market during that timespan. The company has scaled out its electric veh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2bc87b9a20665201043c8597be902ed5bc14252b45325f7bbbcb48bade6a0172"}
{"Ticker":"TSLA","Date":1642583460,"Headline":"US STOCKS-Wall St set to open higher on earnings boost, Big Tech bounces back","Source":"Nasdaq","Summary":"Upbeat results from a host of companies nudged U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=960db6dced7e6e3a9f40e57920b7ea9208fccea69702e24c66361d9fcb936877"}
{"Ticker":"TSLA","Date":1642583340,"Headline":"Retail investors show signs of fatigue after last year's trading frenzy - report","Source":"Nasdaq","Summary":"Retail investors were less enthusiastic about buying the dip in U.S. stocks on Tuesday, the latest sign of a possible fatigue after last year's tech-fueled trading frenzy, Vanda Research analysts said in a weekly note."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2e551d28d520da68f3ebc651ca3cad5cd022d98e8fe41874866004748f75bb9c"}
{"Ticker":"TSLA","Date":1642582800,"Headline":"Looking for Auto, Tires and Trucks Stocks? The Zacks Rank Can Help You Find Winners","Source":"Nasdaq","Summary":"It doesn't matter if you're a growth, value, income, or momentum-focused investor -- building a successful investment portfolio takes skill, research, and a little bit of luck."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c132e281f9bfb43ed32d47a56c2f51ba052f3eb9f18d5a0e12f1dc8670d6dee4"}
{"Ticker":"TSLA","Date":1642578300,"Headline":"Ford (F) & ADT to Bolster Car Security With Canopy Venture","Source":"Nasdaq","Summary":"Ford F recently announced that it will team up with the security company ADT Inc. to form a new joint venture (“JV”) named Canopy, which will offer vehicle security systems as an aftermarket product.Ford and ADT’s investment in the JV is subject to certain conditions. Ini"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=05c03c9e2e1ffa91de379af5b252bbd6c0c695a53a79d68b09407941e9948b8a"}
{"Ticker":"TSLA","Date":1642577520,"Headline":"US STOCKS-Futures gain as UnitedHealth, BofA rise on results","Source":"Nasdaq","Summary":"Upbeat results from UnitedHealth and Bank of America pushed U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter earnings reporting season, while Big Tech stocks also looked set to make a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f4ddefc523927360e8aa74d4ef6bbe5b1ef2b73fed6ff2f9c06f5bd34261922"}
{"Ticker":"TSLA","Date":1642575600,"Headline":"Will 2022 Be Another Great Year for AMD?","Source":"Nasdaq","Summary":"In this video, I will be talking about Advanced Micro Devices (NASDAQ: AMD), the recent analyst upgrades, its partnerships with Big Tech, and its third-quarter financials. You can find the video below but here are the highlights."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f4199c74aeabd523dbbeaf1547e4b5bbc36436850c8303ed968299347f7f8e3"}
{"Ticker":"TSLA","Date":1642573200,"Headline":"Is Invesco S&P 500 Equal Weight ETF (RSP) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"Designed to provide broad exposure to the Style Box - Large Cap Blend category of the market, the Invesco S&P 500 Equal Weight ETF (RSP) is a smart beta exchange traded fund launched on 04\/24\/2003."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9f03453acb2435e5732073fa69d46ad1d7f5e50ba90a0fce879bd99f0a9ffa5b"}
{"Ticker":"TSLA","Date":1642572180,"Headline":"5 Charts to Remember if the Stock Market Crashes in 2022","Source":"Nasdaq","Summary":"The stock market has reached extremes several times during its long journey upward. And it has made a mockery of those who attempt to predict when it has reached a peak or valley. Still, it's hard not to see the parallels with one euphoric period of the recent past."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a24555a148b24358ccc23a0138a8005879d9e680415bd25f1343f25ca1c9ec8b"}
{"Ticker":"TSLA","Date":1642572120,"Headline":"Is Now the Time to Buy Electric Vehicle Stocks?","Source":"Nasdaq","Summary":"Investments in the electric vehicle (EV) sector should be made with a multi-year, if not decades, time horizon. Even in regions leading the world in EV adoption, penetration remains low. It will take years for EVs to become a majority in transportation modes, even in the leading"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5ae0250c7b150161e51cbd5989f542ce6cee55f145f9f7207889f2a0531bc8c8"}
{"Ticker":"TSLA","Date":1642572000,"Headline":"8 Best and Worst Cathie Wood Stock Calls of 2021 ","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0969d77b0776dc3143b251b8b5451edbfa06cc0b1f7d63815d7e328998ae716e"}
{"Ticker":"TSLA","Date":1642571700,"Headline":"Why Shiba Inu's Robinhood Rumors Are a Bigger Deal Than Dogecoin's Tesla News","Source":"Nasdaq","Summary":"Both Shiba Inu (CRYPTO: SHIB) and Dogecoin (CRYPTO: DOGE) gave investors something to smile about last week. On Wednesday, rumors of a potential listing on Robinhood (NASDAQ: HOOD) sent Shiba Inu's price soaring at least 13% higher. Two days later, Elon Musk's tweet that Tesla (N"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f23ce12e1ca93285ae8400262e6b2dd0d29c913f194cf93d0ca8f3ce271bd61c"}
{"Ticker":"TSLA","Date":1642568640,"Headline":"S.Korea's LG Energy Solution sees record retail demand for IPO","Source":"Nasdaq","Summary":"Retail investors bid for a record 114 trillion won ($96 billion) worth of shares in the IPO of South Korean battery maker LG Energy Solution (LGES), adding to the frenzy for a piece of the biggest public offering in the country."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d0e99688a13f0c4f64499df589aabcbc4f42a1fca0ab4a3d0597caf1cd59649"}
{"Ticker":"TSLA","Date":1642568580,"Headline":"2 Unstoppable Stocks That Could Turn $200,000 Into $1 Million by 2030","Source":"Nasdaq","Summary":"The new year has just begun, but the best investment strategy in 2022 won't differ all that much from the best plan in 2021: Focus on the long term. Recent stock market volatility, especially in technology stocks, can tempt investors to make short-sighted decisions -- but this sh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f65212f3bfd265a317ba037ffe27636ccd4f3df14534f920f85170abd06ae54"}
{"Ticker":"TSLA","Date":1642567620,"Headline":"Tesla Rival Nio To Begin ET7 Production In March: Report","Source":"Benzinga","Summary":"U.S. listed Chinese electric vehicle company Nio Inc (NYSE: NIO) will begin production of its electric sedan ET7 beginning March 11, cnEVpost reported on Wednesday, citing the..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6c959d2f71d96dea43f069167e4787a46abb48ae81f87e0b5d7d6fae6e20d3c8"}
{"Ticker":"TSLA","Date":1642566120,"Headline":"In A First, Tesla Model S Driver Charged With Vehicular Manslaughter Over Fatal 2019 Crash Involving Autopilot","Source":"Benzinga","Summary":"A Tesla Inc (NASDAQ: TSLA) driver involved in a fatal wreck over two years ago is the first to be charged on two counts of vehicular manslaughter involving the electric vehicle..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36cc1513b8cdee32653db94fd9891de86412ca702ca21307b5b584713c78b43b"}
{"Ticker":"TSLA","Date":1642565580,"Headline":"S.Korea's LG Energy's $10.8 bln IPO draws record demand from retail investors","Source":"Nasdaq","Summary":"South Korean battery maker LG Energy Solution has set a new record for IPO demand with retail investors bidding for shares worth about 114 trillion won ($95.62 billion),adding to the frenzy for a piece of the biggest public offering in the country."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec30dfad0cca2bf8ac56e3b3fae938520b08b5eb4c30afb86fd4e1c86524d1ce"}
{"Ticker":"TSLA","Date":1642565465,"Headline":"TopNewsGuide: Oil Prices Drive Interest in Diversified Green Renewable Viking Energy (OTCMKTS:VKIN)","Source":"Finnhub","Summary":"Oil prices continue to rise, global demand for energy grows at a faster rate. Major climate events occur more rapidly and carbon emissions come into focus for governing bodies. We are caught in an... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=475e677799306ce4ee2d6569d0804b887c9ddfd62acce9eb868b603e82f0cd19"}
{"Ticker":"TSLA","Date":1642564500,"Headline":"EV Battery Research Startup SES Enters JV With Honda Ahead Of Going Public In SPAC Merger: What You Need To Know","Source":"Benzinga","Summary":"Japan’s Honda Motor Co (NYSE: HMC) said on Tuesday it has signed a joint venture agreement with the U.S. based battery research startup SES Holdings to launch higher density..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6e2758feae46705b2a62bc3e72db1b0001c9ef1b5d1fa7459ec7c49ff3ef04a1"}
{"Ticker":"TSLA","Date":1642564020,"Headline":"GM Secures $1.3B Tax Break For Orion EV Assembly Plant Expansion","Source":"Benzinga","Summary":"General Motors Co (NYSE: GM) has secured a tax break on its proposed $1.3 billion investment to expand the Orion assembly plant for building electric vehicles, the Detroit Free..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c4d05b5a3aaf9e736af234ca08b62738bf56b6907d8b5c8eca5fa8684b042d1"}
{"Ticker":"TSLA","Date":1642560180,"Headline":"Elon Musk's SpaceX Sends Another 49 Starlink Satellites To Space, Reusable Falcon 9 Lands Back On Earth","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) CEO Elon Musk-owned SpaceX on Tuesday successfully launched 49 more Starlink satellites to earth’s low orbit from NASA's Kennedy Space Center in..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6cf0eee394325b07644c0cf9d190caecb3a90eaab4b177df0bae3f0f03bd56ac"}
{"Ticker":"TSLA","Date":1642559885,"Headline":"WC Walker & Associates, Inc. Buys iShares Russell 1000 ETF, iShares TIPS Bond ETF, Agilon ...","Source":"Yahoo","Summary":"Investment company WC Walker & Associates, Inc. (Current Portfolio) buys iShares Russell 1000 ETF, iShares TIPS Bond ETF, Agilon Health Inc, Invesco NASDAQ 100 ETF, Vanguard Total Stock Market ETF, sells ARK Innovation ETF, Zoom Video Communications Inc, PayPal Holdings Inc, Laboratory Corp of America Holdings, Shopify Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, WC Walker & Associates, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=82eab638d49f37f701b4ec110e792508356f3ee9a4457a1bf76844739222e03e"}
{"Ticker":"TSLA","Date":1642555268,"Headline":"Is there more to Elon Musk's crypto obsession than meets the eye?","Source":"Finnhub","Summary":"and when it comes to Purchase Intent, scores are twice those of the wider nation .It is the same story with Index scores: for Britons overall, they sit at 6.6; among the group who think... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9cecb173f729bd2f475c8562c58dffa3d8984bd6f87e9088804bb6a22c3ef12"}
{"Ticker":"TSLA","Date":1642554300,"Headline":"Elon Musk Reiterates Warning About 'Population Collapse:' There Aren't Enough People For Earth, Let Alone Mars","Source":"Benzinga","Summary":"Tesla Inc. (NASDAQ: TSLA) CEO Elon Musk has again warned that the world should be worried about a “population collapse.”\nWhat Happened: In a series of tweets, Musk..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ba67057c0d8e6577452af1b4dadae86e51f68e723a78ddcf10a2fc186ca0656c"}
{"Ticker":"TSLA","Date":1642551060,"Headline":"Elon Musk Says Don't Underestimate Value Of Autonomous Vehicles As Tesla Raises FSD Price To $12,000","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) CEO Elon Musk on Tuesday touted the worthiness of autonomous vehicles just hours after the electric vehicle maker raised the price of its full self-..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=40f87e28b0356744bd5050d61a9cf1a9508bdb1f5d83a64b8c2648a49b4a1132"}
{"Ticker":"TSLA","Date":1642703313,"Headline":"UPDATE 1-U.S. lawmakers call Tesla expansion in Xinjiang 'misguided'","Source":"Reuters","Summary":"The chairmen of two congressional panels on oversight and trade on Thursday assailed Tesla's expansion in China's far-western Xinjiang region, where detention camps have drawn heavy criticism, and asked the electric car maker about its Chinese product sourcing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=333f558db074a6a1fb9442b609319b22e6e63fbb6ef1d1773a2fe89a0bec2db5"}
{"Ticker":"TSLA","Date":1642696209,"Headline":"New vehicles to be rated on how they make drivers stay alert","Source":"Finnhub","Summary":"DETROIT — Two organizations that influence many Americans’ automobile buying decisions will begin rating vehicles on how well they track behavior of motorists who use partially automated... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db0578a1e1e313b416f98ea32c2f8c73bab520af47e3238ffa89c5eaf6224aa7"}
{"Ticker":"TSLA","Date":1642691100,"Headline":"Self-driving sensor maker Luminar shares rally on Mercedes-Benz tie-up","Source":"Nasdaq","Summary":"Luxury carmaker Mercedes-Benz will partner with self-driving sensor maker Luminar Technologies Inc to enable fully automated driving on highways for its next-generation vehicles, Luminar's founder said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ff00dc2e2a747271b05c1e39a5ff8228fa94afc94e0f40edab40eed3a69d62f"}
{"Ticker":"TSLA","Date":1642689668,"Headline":"It's Time To Go To Cash For The Next 7 Years - 1-Year Update","Source":"SeekingAlpha","Summary":"The stock market and bond market remain historically overvalued today, however, the almost all-encompassing bubble has started to break. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7c2ddd23e18619f5b895cfc30f95c30a25f601db8acf53fd3e1919c72fc2523"}
{"Ticker":"TSLA","Date":1642687980,"Headline":"US STOCKS-Bargain-hunting buoys Wall Street after Nasdaq correction","Source":"Nasdaq","Summary":"Wall Street's main indexes rebounded on Thursday with solid gains for technology and growth shares as Treasury yields steadied and investors sought bargains a day after the Nasdaq fell into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=781d9f2652389d725ae45adec42ce830ea9137f7d679806abf0852e9690769ac"}
{"Ticker":"TSLA","Date":1642686660,"Headline":"Why Tesla Stock Jumped on Thursday","Source":"Nasdaq","Summary":"What happened\nShares of Tesla (NASDAQ: TSLA) jumped higher on Thursday. The stock rose as much as 4.6% but is up 3.8% as of 12:55 p.m. ET."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d08ea431ba34be9086aa9e40b188f0b16a8fd4ce6340455d2c4912b7596a3fee"}
{"Ticker":"TSLA","Date":1642685494,"Headline":"Is Now A Good Time To Consider Low-Volatility ETFs?","Source":"SeekingAlpha","Summary":"Low Volatility ETFs may seem like a good way to protect yourself against an oncoming bear market. Find out if now is a good time to consider buying them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be4dbc0c5a17348d2d3b9d2b7474880991858db3f923dc00411a2d1fa6e6128d"}
{"Ticker":"TSLA","Date":1642685280,"Headline":"U.S. lawmakers call Tesla expansion in Xinjiang 'misguided'","Source":"Nasdaq","Summary":"The chairmen of two congressional panels on oversight and trade on Thursday assailed Tesla's expansion in China's far-western Xinjiang region, where detention camps have drawn heavy criticism, and asked the electric car maker about its Chinese product sourcing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9dc534ff5edf3ebe32483f639c46cc2f82bae05706bf95edce08d2ac7cb1293c"}
{"Ticker":"TSLA","Date":1642681565,"Headline":"Tesla Berlin factory to elect works council on Feb 28","Source":"Reuters","Summary":"Tesla's Berlin factory will elect its first works council on Feb. 28, Germany's largest union IG Metall said on Thursday, expressing concern that it was too soon for the election to result in a truly representative body."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=967ea1c11c220dbb51264f429800650676e6e8f467c273a436b1a9ec74774dac"}
{"Ticker":"TSLA","Date":1642679700,"Headline":"US STOCKS-Growth bargains, upbeat earnings boost Wall Street","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5cbb94ebc90fc84341b332954bcc75455705511ae34a9e44acfe08b2545a80b3"}
{"Ticker":"TSLA","Date":1642676340,"Headline":"How PACCAR (PCAR) is Placed Ahead of Q4 Earnings Release","Source":"Nasdaq","Summary":"PACCAR Inc. PCAR is slated to release fourth-quarter 2021 results on Jan 25, before the opening bell. The Zacks Consensus Estimate for the quarter’s earnings and revenues is pegged at $1.31 per share and $5.38 billion, respectively."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8633027180462c533883ecdd9c851f3a97da468188331597fcebb286fd9d1725"}
{"Ticker":"TSLA","Date":1642675860,"Headline":"Why We Expect Tesla (TSLA) to Deliver Q4 Earnings Beat","Source":"Nasdaq","Summary":"Tesla TSLA is set to release fourth-quarter 2021 results on Jan 26, after the closing bell. The Zacks Consensus Estimate for the to-be-reported quarter’s earnings and revenues is pegged at $2.02 per share and $15.93 billion, respectively."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec8f9b4487cff1158ff7f4e22eca9b1eabe531a38dd752ef64cdfc9edca4a814"}
{"Ticker":"TSLA","Date":1642673160,"Headline":"US STOCKS-Growth bargains, upbeat earnings take Wall Street higher","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41723a364b6f65901d1188fa99ea089f3e6c418d338aa4e513ef01d51f3bc4af"}
{"Ticker":"TSLA","Date":1642671960,"Headline":"If You Invested $10,000 in Ford in 2021, This Is How Much You Would Have Today","Source":"Nasdaq","Summary":"Value-focused investors have long been finding it difficult to wrap their head around the valuations of electric vehicle (EV) stocks. In 2021, Ford Motor Company (NYSE: F) stock joined this list of EV companies whose stocks seem to be defying gravity. Its stock price has risen to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=32ec81ad846fe96f943822f9c92edff596ff2e9cede54cffac6e30635e549f14"}
{"Ticker":"TSLA","Date":1642671000,"Headline":"Will Lower Aggregate Revenues Hurt Verizon's (VZ) Q4 Earnings?","Source":"Nasdaq","Summary":"Verizon Communications Inc. VZ is scheduled to report fourth-quarter 2021 results on Jan 25, before the opening bell. In the last reported quarter, the telecom giant beat the Zacks Consensus Estimate by 5 cents, delivering a surprise of 3.7%.The company is expected to hav"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9205a4fc2654bfa9a8873de20013e81a73f73bed8579e3466906053bdf9c50f5"}
{"Ticker":"TSLA","Date":1642669740,"Headline":"US STOCKS-Wall Street set to open higher after upbeat earnings","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday as upbeat results from American Airlines and Travelers kept the positive momentum going for the fourth-quarter earnings season, a day after the tech-heavy Nasdaq index plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c1cbf1b5be1f96e95e8c74681e0a3e48312870513789e9f5a923ffdb311558f"}
{"Ticker":"TSLA","Date":1642669500,"Headline":"General Motors (GM) Expands Fuel Cell Projects Beyond Vehicles","Source":"Nasdaq","Summary":"General Motors GM, in its strive to accelerate its growth as a platform innovator, recently launched new commercial applications of its Hydrotec fuel cell technology. Hydrotec projects, which are currently in development, from heavy-duty trucks to aerospace and locomotive"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2d8415b7be00e6400740e58f173c3d5670f81f494139356cdd74928abb07c7c9"}
{"Ticker":"TSLA","Date":1642669200,"Headline":"Mercedes-Benz teams up with Luminar on self-driving tech","Source":"Nasdaq","Summary":"Luxury carmaker Mercedes-Benz will partner with self-driving sensor maker Luminar Technologies Inc to enable fully automated driving on highways for its next-generation vehicles, Luminar's founder said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=60726d0c476fdecf06857a5689f38427aefcd76d1786a1fc91448e4148169709"}
{"Ticker":"TSLA","Date":1642668480,"Headline":"2 Top Tech Stocks Ready for a Bull Run","Source":"Nasdaq","Summary":"Since the end of the Great Recession in 2009, growth stocks have been a driving force on Wall Street. Historically low lending rates and the Federal Reserve's ongoing quantitative easing measures have created a pool of abundant cheap capital that fast-paced businesses have used t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00c14d26b8c91e3b76520b5544173c4ecb66634cf7dbb2b106f8a2f570f70dbe"}
{"Ticker":"TSLA","Date":1642667040,"Headline":"Ford (F) Recalls 200K Vehicles Over Defective Brake Lights","Source":"Nasdaq","Summary":"Ford F recently recalled nearly 200,000 cars in the United States to repair a problem obstructing the brake lights from turning off.The affected vehicles include certain 2014 and 2015 Ford Fusion and Lincoln MKZ midsize models as well as some 2015 Ford Mustang convertible"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9b39eaa63e7033c4ed69239e05ac63ebce74ee3dd1d4a8c2b34f4c30d7e1a0d2"}
{"Ticker":"TSLA","Date":1642666080,"Headline":"GLOBAL MARKETS-Wall Street headed higher as tech investors lick their wounds","Source":"Nasdaq","Summary":"Wall Street was headed higher on Thursday, pulling European shares back into the black as investors in Big Tech licked their wounds after Nasdaq's slide into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a55c88092289c8e8f74effd7c53a10b3d0383abc2014203a228128481fd606c2"}
{"Ticker":"TSLA","Date":1642664940,"Headline":"U.S. stock futures rise on earnings after Nasdaq enters correction territory","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday on a string of strong earnings led by American Airlines and insurer Travelers, a day after the tech-heavy Nasdaq plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bdbded73dae2ec0cd25707914357b80a3e3e1c932e4f63e807c26c94f979f350"}
{"Ticker":"TSLA","Date":1642664425,"Headline":"India, Tesla in 'weird stalemate' on tax cut demands with no investment pledge-sources","Source":"Reuters","Summary":"Talks between India and Tesla Inc over potential tax benefits are deadlocked as the government is not keen to give the company any breaks without a commitment to manufacture locally, people familiar with the discussions told Reuters."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=816cffc864b93b26cc10f051e0bcf0cc60a2643ac31d0ea15548e84ad09a0b6b"}
{"Ticker":"TSLA","Date":1642662780,"Headline":"Former SpaceX Engineers' Electric Railroad Startup Raises $49.5M In Series A Funding","Source":"Benzinga","Summary":"Parallel Systems, an electric railroad startup, said on Wednesday it has raised $49.55 million in Series A funding to build autonomous battery-electric rail vehicles to move..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2ec84e4f4b1841881364d55530a8c7a67581c6d5cfe6cf4a46688f09d9ba71e0"}
{"Ticker":"TSLA","Date":1642661280,"Headline":"Zacks.com featured highlights include: Alkermes, Tesla, Nucor Corp. and GoPro","Source":"Nasdaq","Summary":"For Immediate ReleaseChicago, IL – January 20, 2022 – Stocks in this week’s article are Alkermes ALKS, Tesla TSLA, Nucor Corp. NUE and GoPro GPRO."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c502f9bc6ce9d1353d440aca4ccfa577cf0236ab2d626ffd3eb9156fd5ebcf1c"}
{"Ticker":"TSLA","Date":1642661100,"Headline":"Can Extreme Leverage Crash the Crypto Market in 2022?","Source":"Nasdaq","Summary":"Leverage can be both a good and a bad thing. In the Jan. 5 episode of \"The Crypto Show\" on Backstage Pass, Fool.com editor Eric Bleeker and contributor Chris MacDonald discuss how leverage could impact the outlook for major cryptocurrencies in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f39ee1803fdf96a523eaacc99243c0b70e1b2bf516af859f419fcc647a84ed84"}
{"Ticker":"TSLA","Date":1642659840,"Headline":"Wall Street Breakfast: Tech Correction","Source":"SeekingAlpha","Summary":"Listen on the go! A daily podcast of Wall Street Breakfast will be available by 8:00 a.m. on Seeking Alpha, iTunes, Stitcher and Spotify."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8ffb9541165602f59f1894f373280fac875c29cd1b131cad35aaac8eb6d891e7"}
{"Ticker":"TSLA","Date":1642659600,"Headline":"Is SPDR NYSE Technology ETF (XNTK) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"Launched on 09\/25\/2000, the SPDR NYSE Technology ETF (XNTK) is a smart beta exchange traded fund offering broad exposure to the Technology ETFs category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d1bf5ba03847d343101738c806c2d12418f58565690a0b616f858cb0022ac00"}
{"Ticker":"TSLA","Date":1642656060,"Headline":"A Peek Into The Markets: US Stock Futures Gain Ahead Of Jobless Claims Data","Source":"Benzinga","Summary":"Pre-open movers\nU.S. stock futures traded higher in early pre-market trade after the Dow Jones fell around 1% in the previous session. Investors are awaiting earnings results from..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=340c59c441351a9a0ec0cd8352ec10764eeb8d8e0f1624fefac0d28c963c6c0f"}
{"Ticker":"TSLA","Date":1642652580,"Headline":"Tesla Was Ordered To Pay Up $137M In Racism Lawsuit — Now, A Judge Says That's 'Too High'","Source":"Benzinga","Summary":"U.S. District Judge William Orrick said on Wednesday that the order to pay $137 million in damages by a federal jury for subjecting a former black Tesla Inc (NASDAQ: TSLA)..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bf510943ab5c9d465dc7c9e0f6d4cce3d3d5b653f5c2e19285df8d3b118bb71"}
{"Ticker":"TSLA","Date":1642650120,"Headline":"IIHS Flags Past Concerns With Tesla And Other Automakers' Self-Driving Systems As It Launches Automation-Focused Safety Scores","Source":"Benzinga","Summary":"The Insurance Institute for Highway Safety (IIHS) said on Thursday it is rolling out a new rating program this year that is aimed at measuring partial automation systems..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be320dc51039e077779530041c70f40dafb4fef34c72ca372678c6ba4c2ba784"}
{"Ticker":"TSLA","Date":1642648860,"Headline":"Tesla Said To Hit Stalemate With Indian Government Over Tax Relief But 6 States Rush To Invite EV Maker To Set Up Base","Source":"Benzinga","Summary":"Tesla Inc (NASDAQ: TSLA) CEO Elon Musk has been invited by at least six Indian state governments to set up a manufacturing plant with them, The Indian Express reported on..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11ea02384a4a5e62b816c0378b12a13a667e9894fa35b043fb940ae73a23d4d0"}
{"Ticker":"TSLA","Date":1642637760,"Headline":"Why Alibaba, Xpeng And Other Stocks Are Rising In Hong Kong Today","Source":"Benzinga","Summary":"Shares of U.S.-listed Chinese tech companies traded mostly higher in Hong Kong on Thursday, lifting the benchmark Hang Seng Index to its highest level in almost two months.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3f40ee776f9dd6c106ef9ae9f64332286571e2c023945cf97dcf9b3961f4127d"}
{"Ticker":"TSLA","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"TSLA","Date":1642757524,"Headline":"Thinking about trading options or stock in Intel Corp, Tesla, Microsoft, Meta Platforms, or Advanced Micro Devices?","Source":"Finnhub","Summary":"NEW YORK, Jan. 21, 2022 \/PRNewswire\/ -- InvestorsObserver issues critical PriceWatch Alerts for INTC, TSLA, MSFT, FB, and AMD. ... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=add3382b0d1d2512147efb0b6435d338b7a1ba9d76e26106c0511b8fd18a7039"}
{"Ticker":"TSLA","Date":1642757190,"Headline":"ARKK, Cathie Wood, And The Bursting Bubble","Source":"SeekingAlpha","Summary":"ARK Innovation's macro calls have not come true so far. Rising rates are a huge headwind for expensive growth stocks. Read more about ARKK here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f835f25116df1fb52c848167a6cd30a36edf92076fdc27fcd55dfac4bf08227d"}
{"Ticker":"TSLA","Date":1642756200,"Headline":"Should You Invest in Dogecoin in 2022?","Source":"Nasdaq","Summary":"Thanks to the meme-stock mania that took over the market last year, Dogecoin (CRYPTO: DOGE) was a star. The popular token, created as a fun competitor to Bitcoin (CRYPTO: BTC), skyrocketed almost 12,000% from the start of 2021 to its all-time high on May 8. Since then, however, D"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11fcdcdc3fc0aef157b4b873c2077efac944a207a300af1a046bc9ccb4e42315"}
{"Ticker":"TSLA","Date":1642756148,"Headline":"Better Late Than Ever: New Ruling For Electric Vehicle Charging Stations In Turkey","Source":"Finnhub","Summary":"Article by Sahin Ardiyok, Busra Nazli Yaldir and Nadide AkdagIt is beyond doubt that there is a positive correlation between the number of electric vehicles and the availability of charging... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=117504363d88af3d4ecd31c502275ded69560c64ac848a9e3a9ae7a7f5e88abe"}
{"Ticker":"TSLA","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"TSLA","Date":1642754700,"Headline":"Where to Invest in 2022 If You're Worried About Inflation","Source":"Nasdaq","Summary":"There's probably no other topic garnering more attention right now than inflation. In categories ranging from used cars to housing and gas to food, soaring prices are everywhere. And these increases are hurting many consumers, particularly those at the lower end of the socioecono"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bd3968236fc621da98607c75bb22179c233c3f2ecc321c9dc907b137ad69016"}
{"Ticker":"TSLA","Date":1642751400,"Headline":"Should You Invest in Ford in 2022?","Source":"Nasdaq","Summary":"U.S. automaker Ford Motor Company (NYSE: F) has been viewed as a dinosaur by the growth investing crowd for many years, and the stock price reflected that attitude for most of the decade. But the share price has soared by more than 140% over the past year. With such an elevated v"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fb82e5523b8c2eb0f43324e45999290b4c25e9e00959cf01e10f574732c1e69a"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Why Lucid's Moat Isn't As Wide as Tesla's Was a Decade Ago","Source":"Nasdaq","Summary":"Motley Fool contributor Brian Feroldi invested in Tesla (NASDAQ: TSLA) not long after the electric vehicle company held its initial public offering. That has ended up being the most successful investment he's ever made. So when Lucid Motors (NASDAQ: LCID) recently came public via"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bd4bd2c4047ef2e575398de985f323dfdb902ba17556d6252c3f78f269e2fe2"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Here's Why Teladoc Is Like Tesla in 2019","Source":"Nasdaq","Summary":"In this video, I will be talking about Teladoc Health (NYSE: TDOC) and why I believe it's a screaming buy at these levels. Teladoc is the No. 2 position of Cathie Wood at ARK Invest. The stock is down 75% from its all-time highs but the underlying business has been getting better"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7fb36494d9bffbdebb03eb1b5654f92bac9c1d5a69fac8b5134f71511b27c00"}
{"Ticker":"TSLA","Date":1642747800,"Headline":"6 Must-Buy Large-Cap Stocks Ahead of Q4 Earnings Next Week","Source":"Nasdaq","Summary":"Wall Street is facing severe volatility in this week as market participants are keeping their fingers crossed for a hawkish Fed in the near term. However, the fourth-quarter 2021 earnings season is gathering pace with better-than-expected results so far. Earnings results"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bd2ee915324f65d0831285b50ebd408a737097f6e63502e321fd817c240adf9"}
{"Ticker":"TSLA","Date":1642732683,"Headline":"Tesla's India entry hits speed bump after talks impasse with government","Source":"Finnhub","Summary":"By Hugo BarciaNew Delhi, Jan 21 .- The much-awaited launch of electric vehicles firm Tesla has hit a speed bump in India as talks appear to have stalemated between the government and the billionaire... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b71d790ff8053c83cc46ddeebdb8f0044e71db642f25a055b4643560890dc44d"}
{"Ticker":"TSLA","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"TSLA","Date":1642757524,"Headline":"Thinking about trading options or stock in Intel Corp, Tesla, Microsoft, Meta Platforms, or Advanced Micro Devices?","Source":"Finnhub","Summary":"NEW YORK, Jan. 21, 2022 \/PRNewswire\/ -- InvestorsObserver issues critical PriceWatch Alerts for INTC, TSLA, MSFT, FB, and AMD. ... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=add3382b0d1d2512147efb0b6435d338b7a1ba9d76e26106c0511b8fd18a7039"}
{"Ticker":"TSLA","Date":1642757190,"Headline":"ARKK, Cathie Wood, And The Bursting Bubble","Source":"SeekingAlpha","Summary":"ARK Innovation's macro calls have not come true so far. Rising rates are a huge headwind for expensive growth stocks. Read more about ARKK here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f835f25116df1fb52c848167a6cd30a36edf92076fdc27fcd55dfac4bf08227d"}
{"Ticker":"TSLA","Date":1642756200,"Headline":"Should You Invest in Dogecoin in 2022?","Source":"Nasdaq","Summary":"Thanks to the meme-stock mania that took over the market last year, Dogecoin (CRYPTO: DOGE) was a star. The popular token, created as a fun competitor to Bitcoin (CRYPTO: BTC), skyrocketed almost 12,000% from the start of 2021 to its all-time high on May 8. Since then, however, D"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11fcdcdc3fc0aef157b4b873c2077efac944a207a300af1a046bc9ccb4e42315"}
{"Ticker":"TSLA","Date":1642756148,"Headline":"Better Late Than Ever: New Ruling For Electric Vehicle Charging Stations In Turkey","Source":"Finnhub","Summary":"Article by Sahin Ardiyok, Busra Nazli Yaldir and Nadide AkdagIt is beyond doubt that there is a positive correlation between the number of electric vehicles and the availability of charging... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=117504363d88af3d4ecd31c502275ded69560c64ac848a9e3a9ae7a7f5e88abe"}
{"Ticker":"TSLA","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"TSLA","Date":1642754700,"Headline":"Where to Invest in 2022 If You're Worried About Inflation","Source":"Nasdaq","Summary":"There's probably no other topic garnering more attention right now than inflation. In categories ranging from used cars to housing and gas to food, soaring prices are everywhere. And these increases are hurting many consumers, particularly those at the lower end of the socioecono"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bd3968236fc621da98607c75bb22179c233c3f2ecc321c9dc907b137ad69016"}
{"Ticker":"TSLA","Date":1642751400,"Headline":"Should You Invest in Ford in 2022?","Source":"Nasdaq","Summary":"U.S. automaker Ford Motor Company (NYSE: F) has been viewed as a dinosaur by the growth investing crowd for many years, and the stock price reflected that attitude for most of the decade. But the share price has soared by more than 140% over the past year. With such an elevated v"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fb82e5523b8c2eb0f43324e45999290b4c25e9e00959cf01e10f574732c1e69a"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Why Lucid's Moat Isn't As Wide as Tesla's Was a Decade Ago","Source":"Nasdaq","Summary":"Motley Fool contributor Brian Feroldi invested in Tesla (NASDAQ: TSLA) not long after the electric vehicle company held its initial public offering. That has ended up being the most successful investment he's ever made. So when Lucid Motors (NASDAQ: LCID) recently came public via"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bd4bd2c4047ef2e575398de985f323dfdb902ba17556d6252c3f78f269e2fe2"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Here's Why Teladoc Is Like Tesla in 2019","Source":"Nasdaq","Summary":"In this video, I will be talking about Teladoc Health (NYSE: TDOC) and why I believe it's a screaming buy at these levels. Teladoc is the No. 2 position of Cathie Wood at ARK Invest. The stock is down 75% from its all-time highs but the underlying business has been getting better"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7fb36494d9bffbdebb03eb1b5654f92bac9c1d5a69fac8b5134f71511b27c00"}
{"Ticker":"TSLA","Date":1642747800,"Headline":"6 Must-Buy Large-Cap Stocks Ahead of Q4 Earnings Next Week","Source":"Nasdaq","Summary":"Wall Street is facing severe volatility in this week as market participants are keeping their fingers crossed for a hawkish Fed in the near term. However, the fourth-quarter 2021 earnings season is gathering pace with better-than-expected results so far. Earnings results"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bd2ee915324f65d0831285b50ebd408a737097f6e63502e321fd817c240adf9"}
{"Ticker":"TSLA","Date":1642732683,"Headline":"Tesla's India entry hits speed bump after talks impasse with government","Source":"Finnhub","Summary":"By Hugo BarciaNew Delhi, Jan 21 .- The much-awaited launch of electric vehicles firm Tesla has hit a speed bump in India as talks appear to have stalemated between the government and the billionaire... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b71d790ff8053c83cc46ddeebdb8f0044e71db642f25a055b4643560890dc44d"}
{"Ticker":"TSLA","Date":1642726768,"Headline":"Wolfspeed: Potential High-Growth Disruptor In The Semiconductor Industry","Source":"SeekingAlpha","Summary":"Increase in losses forced Wolfspeed to divest its Cree-LED business. Read to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d307b250d66904ece0a52b3dee1af7a65a31923e40fde21a5c04bb99195d30c5"}
{"Ticker":"TSLA","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"TSLA","Date":1642757524,"Headline":"Thinking about trading options or stock in Intel Corp, Tesla, Microsoft, Meta Platforms, or Advanced Micro Devices?","Source":"Finnhub","Summary":"NEW YORK, Jan. 21, 2022 \/PRNewswire\/ -- InvestorsObserver issues critical PriceWatch Alerts for INTC, TSLA, MSFT, FB, and AMD. ... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=add3382b0d1d2512147efb0b6435d338b7a1ba9d76e26106c0511b8fd18a7039"}
{"Ticker":"TSLA","Date":1642757190,"Headline":"ARKK, Cathie Wood, And The Bursting Bubble","Source":"SeekingAlpha","Summary":"ARK Innovation's macro calls have not come true so far. Rising rates are a huge headwind for expensive growth stocks. Read more about ARKK here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f835f25116df1fb52c848167a6cd30a36edf92076fdc27fcd55dfac4bf08227d"}
{"Ticker":"TSLA","Date":1642756200,"Headline":"Should You Invest in Dogecoin in 2022?","Source":"Nasdaq","Summary":"Thanks to the meme-stock mania that took over the market last year, Dogecoin (CRYPTO: DOGE) was a star. The popular token, created as a fun competitor to Bitcoin (CRYPTO: BTC), skyrocketed almost 12,000% from the start of 2021 to its all-time high on May 8. Since then, however, D"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11fcdcdc3fc0aef157b4b873c2077efac944a207a300af1a046bc9ccb4e42315"}
{"Ticker":"TSLA","Date":1642756148,"Headline":"Better Late Than Ever: New Ruling For Electric Vehicle Charging Stations In Turkey","Source":"Finnhub","Summary":"Article by Sahin Ardiyok, Busra Nazli Yaldir and Nadide AkdagIt is beyond doubt that there is a positive correlation between the number of electric vehicles and the availability of charging... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=117504363d88af3d4ecd31c502275ded69560c64ac848a9e3a9ae7a7f5e88abe"}
{"Ticker":"TSLA","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"TSLA","Date":1642754700,"Headline":"Where to Invest in 2022 If You're Worried About Inflation","Source":"Nasdaq","Summary":"There's probably no other topic garnering more attention right now than inflation. In categories ranging from used cars to housing and gas to food, soaring prices are everywhere. And these increases are hurting many consumers, particularly those at the lower end of the socioecono"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bd3968236fc621da98607c75bb22179c233c3f2ecc321c9dc907b137ad69016"}
{"Ticker":"TSLA","Date":1642751400,"Headline":"Should You Invest in Ford in 2022?","Source":"Nasdaq","Summary":"U.S. automaker Ford Motor Company (NYSE: F) has been viewed as a dinosaur by the growth investing crowd for many years, and the stock price reflected that attitude for most of the decade. But the share price has soared by more than 140% over the past year. With such an elevated v"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fb82e5523b8c2eb0f43324e45999290b4c25e9e00959cf01e10f574732c1e69a"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Why Lucid's Moat Isn't As Wide as Tesla's Was a Decade Ago","Source":"Nasdaq","Summary":"Motley Fool contributor Brian Feroldi invested in Tesla (NASDAQ: TSLA) not long after the electric vehicle company held its initial public offering. That has ended up being the most successful investment he's ever made. So when Lucid Motors (NASDAQ: LCID) recently came public via"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bd4bd2c4047ef2e575398de985f323dfdb902ba17556d6252c3f78f269e2fe2"}
{"Ticker":"TSLA","Date":1642748400,"Headline":"Here's Why Teladoc Is Like Tesla in 2019","Source":"Nasdaq","Summary":"In this video, I will be talking about Teladoc Health (NYSE: TDOC) and why I believe it's a screaming buy at these levels. Teladoc is the No. 2 position of Cathie Wood at ARK Invest. The stock is down 75% from its all-time highs but the underlying business has been getting better"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7fb36494d9bffbdebb03eb1b5654f92bac9c1d5a69fac8b5134f71511b27c00"}
{"Ticker":"TSLA","Date":1642747800,"Headline":"6 Must-Buy Large-Cap Stocks Ahead of Q4 Earnings Next Week","Source":"Nasdaq","Summary":"Wall Street is facing severe volatility in this week as market participants are keeping their fingers crossed for a hawkish Fed in the near term. However, the fourth-quarter 2021 earnings season is gathering pace with better-than-expected results so far. Earnings results"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bd2ee915324f65d0831285b50ebd408a737097f6e63502e321fd817c240adf9"}
{"Ticker":"TSLA","Date":1642732683,"Headline":"Tesla's India entry hits speed bump after talks impasse with government","Source":"Finnhub","Summary":"By Hugo BarciaNew Delhi, Jan 21 .- The much-awaited launch of electric vehicles firm Tesla has hit a speed bump in India as talks appear to have stalemated between the government and the billionaire... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b71d790ff8053c83cc46ddeebdb8f0044e71db642f25a055b4643560890dc44d"}
{"Ticker":"TSLA","Date":1642726768,"Headline":"Wolfspeed: Potential High-Growth Disruptor In The Semiconductor Industry","Source":"SeekingAlpha","Summary":"Increase in losses forced Wolfspeed to divest its Cree-LED business. Read to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d307b250d66904ece0a52b3dee1af7a65a31923e40fde21a5c04bb99195d30c5"}
