{"Ticker":"AMZN","Date":1641854710,"Headline":"Amazon (AMZN) Dips More Than Broader Markets: What You Should Know","Source":"Yahoo","Summary":"In the latest trading session, Amazon (AMZN) closed at $3,229.72, marking a -0.66% move from the previous day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54cfe6fd607cc97afc64d7e5c836eff00ed21a7087ce05b628de17aac9b7441a"}
{"Ticker":"AMZN","Date":1641854540,"Headline":"Rivian’s Stock Slide Deepens as Operating Chief Steps Down","Source":"Yahoo","Summary":"(Bloomberg) -- Rivian Automotive Inc.’s chief operating officer stepped down, extending a tumultuous stretch for the electric-vehicle maker. The shares fell in late trading.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameSingapore Breaks Down Covid Deaths by Vaccine, With Moderna Seeing Lowest RateDip Buyers Drive U.S. Stock Rebound After Selloff: Markets WrapCyprus Finds Covid-19 Infections That Com"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5fbfce532496366bc19fa2df1bf5846e6c84e91da5dfcd55f8f64f49dca679fa"}
{"Ticker":"AMZN","Date":1641852840,"Headline":"Worried About the Global Supply Chain Crisis? These 2 Stocks Can Keep Winning","Source":"Nasdaq","Summary":"Global supply chain challenges continue to disrupt the operations of companies of all sizes and across nearly all industries. In this segment of Backstage Pass, recorded on Dec. 15, Fool contributors Rachel Warren, Connor Allen, and Danny Vena discuss two stocks that can keep win"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e81ae186c482e0d6f2a0cb3f03aa2b3db309f87a4e7f5c426aa3e2439e02a638"}
{"Ticker":"AMZN","Date":1641852202,"Headline":"Nasdaq 100 Rebounds to Snap Rout Even With Big Tech Divided","Source":"Yahoo","Summary":"(Bloomberg) -- Shares of technology and internet stocks staged a comeback on Monday, with the Nasdaq 100 Index closing up 0.1% after dropping as much as 2.7% earlier as investors continue to monitor rising Treasury yields.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameCyprus Finds Covid-19 Infections That Combine Delta and OmicronDip Buyers Drive U.S. Stock Rebound After Selloff: Markets WrapT Cells"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=93cd67708bdfc3705e89cad59e1832b7c35adc3a2d1e5bb5d65040d46e116e24"}
{"Ticker":"AMZN","Date":1641850991,"Headline":"The top 50 stocks by market cap in the S&P 500","Source":"Yahoo","Summary":"Jared Blikre dives in the most valuable S&P stocks by market cap."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d3cf4f3bdb88e90c8e28f8953db1e260be088191334c12b0922cdee75efabbea"}
{"Ticker":"AMZN","Date":1641849393,"Headline":"IMAX CEO: Streaming exclusives ‘became some of the most pirated movies ever’","Source":"Yahoo","Summary":"IMAX CEO Richard Gelfond joins Yahoo Finance Live to discuss 2021 box office earnings, film trends, theater releases, and streaming partnerships."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b81ee3e5e3d491687696503f4e49dce8ddb9e1f05745864a60d5d218e392f2ae"}
{"Ticker":"AMZN","Date":1641849086,"Headline":"Will This Company Be The Top Performing FANG Stock Of 2022?","Source":"Yahoo","Summary":"Amazon stock is expected to outperform the other FANG stocks in 2021, says an equity analyst in a research note on Monday"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b4c0be1f8aacb87889c78d6523f1136b7ee5c73c0678f9ef3326d196fa86e332"}
{"Ticker":"AMZN","Date":1641847440,"Headline":"Why Amazon Is the FAANG Stock With the Most Bite","Source":"Yahoo","Summary":"After underperforming in 2021, Amazon.com stock is a top pick among megacap internet stocks, says BofA analyst Justin Post."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0095709b0b09c54104dc8c0532481cc7cf5474a83e874e9f831631ff7ed90a59"}
{"Ticker":"AMZN","Date":1641826806,"Headline":"Amazon Is Focus of Push to Curb ‘Rank-and-Yank’ Worker Ratings","Source":"Yahoo","Summary":"(Bloomberg) -- For years, white-collar employees at Amazon.com Inc. have accused the company of using opaque “rank-and-yank” performance reviews to periodically cull its workforce. Now a proposed law in Amazon’s home state of Washington could make it harder for companies to terminate workers without explaining why. Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameCyprus Finds Covid-19 Infections That"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7986b24172723636e02368b5960e31f384f97c4c4536d84aa8eabe3f15fe9deb"}
{"Ticker":"AMZN","Date":1641846713,"Headline":"Stocks are still ‘a great buy,’ Momentum Advisors CIO says","Source":"Yahoo","Summary":"Momentum Advisors Chief Investment Officer Allan Boomer joins Yahoo Finance Live to discuss the Fed's policy moves in 2022 and why stocks are still favored over bonds."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b01823605cfb9ad9960db6147655a159ab08b997bdf2dc3c04a8d82b404230e6"}
{"Ticker":"AMZN","Date":1641845962,"Headline":"Why Affirm Holdings Plummeted 20.6% in December","Source":"Yahoo","Summary":"A big factor that caused its decline was the announcement of a CFPB inquiry into buy now, pay later companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7fe136d5c0ff1423542d7db8330777c43c6b024d4616d58a1cc91b6ee9913ce3"}
{"Ticker":"AMZN","Date":1641844323,"Headline":"What Investors Should Consider Before Investing in Meta Platforms","Source":"Yahoo","Summary":"A group of investors are pressuring Mark Zuckerberg to shake up the company's board with a new independent chairman. But the solution to what plagues Facebook may not be so simple."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=66404f4a15119e5d5631bde1b12e0eedd969ab77dfafb9169017859c529c4611"}
{"Ticker":"AMZN","Date":1641843680,"Headline":"Market outlook for 2022: 'Focus on things that have real earnings value right now'","Source":"Yahoo","Summary":"Brent Schutte, Chief Investment Strategist at Northwestern Mutual Wealth Management, joins Yahoo Finance Live to compare the worth of growth and value stocks, where to find value as stocks in sectors like technology begin to slide, and large and small-cap growth."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=342c5b8c88877841b3715daa1fd9c75cb57aaf2d6131e73ba366106df62c4357"}
{"Ticker":"AMZN","Date":1641841282,"Headline":"Will Microsoft (MSFT) Stock Deliver Growth in 2022?","Source":"Yahoo","Summary":"Microsoft stock has had a spectacular run in the past couple of years. Will 2022 be a repeat, or will it capitulate to shifting investor preferences?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5825cef687a714be1490cef4e3053e5a0e1b56bddfcb728066fde107e00cb7f"}
{"Ticker":"AMZN","Date":1641841080,"Headline":"Rivian manufactured 1,015 vehicles in 2021, says COO retired","Source":"Nasdaq","Summary":"Rivian Automotive Inc produced 1,015 vehicles by the end of 2021, the Amazon-backed electric pickup truck maker reported in a filing on Monday, in line with its lowered expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88932855ac8c843d7757d21b45d7d3a3d92be3c0f24adce9931047b497ae8fc3"}
{"Ticker":"AMZN","Date":1641838562,"Headline":"How Do Investors Know When It's Time to Rebalance Their Portfolio?","Source":"Yahoo","Summary":"In this segment of Backstage Pass, recorded on Dec. 13, 2021, Fool contributors Jason Hall, Rachel Warren, and Toby Bordelon discuss.  Jason Hall: I look at this as an example, and I want to be clear here, I'm not calling out Microsoft as a company that I necessarily think is overvalued, but today Microsoft trades for almost 15 times sales.  Its operating margin has also largely gone up over the same period."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1aab67bf80bff966f14b11b935fb6a77878cccc1c71a0cd87a4fe49aac15b71b"}
{"Ticker":"AMZN","Date":1641837766,"Headline":"22 No-Brainer Blue-Chip Buys For 2022","Source":"SeekingAlpha","Summary":"2021 was a freakish year of soaring markets and low volatility. 2022 is likely to be the opposite with lower returns. Read more to see 22 blue-chip buys."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=67cceec78ba6a73202bee911aed4616685209eaff13ef9ba1ffff9df44cdfd5d"}
{"Ticker":"AMZN","Date":1641836508,"Headline":"Walmart: Reaching for the Top Grocery Delivery Spot","Source":"Yahoo","Summary":"Investors thrilled by aggressive delivery business growth strategy"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=726dcdf12d8b1c3d8b87584e600d3136929b262847bdd47971f0955e19a13ec1"}
{"Ticker":"AMZN","Date":1641834790,"Headline":"Jana Partners' fund gains 30% as bets such as Vonage, LabCorp pay off","Source":"Finnhub","Summary":"Jana Partners LLC, the activist investor that successfully pushed for big changes including sales at portfolio companies, told investors that its JSI Benchmark A portfolio returned 30% after fees... | January 10, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f126511b36f9ad695eb84b7554e523af65340c89c81cd9183f52b65867396d8a"}
{"Ticker":"AMZN","Date":1641831374,"Headline":"My Nifty 50 Stock Portfolio","Source":"SeekingAlpha","Summary":"I'm sharing my 50-stock portfolio update with the world. The portfolio consists of 83.13% equity, 12.68% cash, 4.19% fixed income. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a84acf6f73cfeaf57a1bb37f355d9f6c7c7a2e2cbcb448bc6b8a609469a8ce13"}
{"Ticker":"AMZN","Date":1641830841,"Headline":"Joe Manchin's former aides gain influential lobbying clients as their ex-boss battles Biden's agenda","Source":"CNBC","Summary":"Former aides to Sen. Joe Manchin who are now lobbyists are scoring big clients as their ex-boss battles President Biden's agenda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=13c03f30005f651331f2a34931690b9b040475aa5d00ff462ba2e15d7e764365"}
{"Ticker":"AMZN","Date":1641819141,"Headline":"GameStop: With Competition Stronger Than Ever, Management Will Need More Than NFTs And Cryptos","Source":"SeekingAlpha","Summary":"The extreme rise of competition that we are seeing in the gaming sector is here to stay and will impact GameStop's future. See why I'm bearish on GME stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=403a01e1337302600eecab558d6ca489ad3fb8f25aa0e552f48dae202252a8e9"}
{"Ticker":"AMZN","Date":1641818940,"Headline":"US STOCKS-Wall Street tumbles as tech stocks extend slide","Source":"Nasdaq","Summary":"Wall Street's main indexes tumbled on Monday, as heavyweight technology stocks dropped on expectations of a sooner-than-expected rate hike that pushed U.S. Treasury yields to fresh two-year highs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=802be25075e94eb1c00c704f83e2898755d0d860138e7c9df8e2278f026f752c"}
{"Ticker":"AMZN","Date":1641814680,"Headline":"Why Digital World Acquisition Was Trumpeting a 24% Gain in December","Source":"Nasdaq","Summary":"What happened\nPresident Trump is planning to return to social media in a big way, but not through the platforms offered by Big Tech. Because they summarily banned him from their sites following the 2020 elections, he is making an end run around them by launching his own platform"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eed1ebae9333dc18c4ab4bd97757e9e3f5fa2176a9614f3b407b0c65da25787f"}
{"Ticker":"AMZN","Date":1641814200,"Headline":"Analysis: Does The Untelevised Golden Globes Have Any Impact On Movies And Television?","Source":"Benzinga","Summary":"The 79th Annual Golden Globe Awards were presented Sunday night in a ceremony that could be described as the ultimate antithesis of a Hollywood awards show: No celebrities were in..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5dd7322ed19773a1fd63c71bc1ebab7a24bb9154e6c1ac10b4c5fe9bfe70c7d"}
{"Ticker":"AMZN","Date":1641814020,"Headline":"This Pizza Stock Has A Better 1-Year Return Than Amazon, Snap, Plug Power And Starbucks","Source":"Benzinga","Summary":"It’s no secret traders and investors supported tech companies in droves in 2021. So perhaps overlooked is a certain Louisville, Kentucky-based pizza chain that has delivered..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b27487e7be4f6b7c97e62471b1d476c847d52d6c05457e1be94e83b5b688ebd"}
{"Ticker":"AMZN","Date":1641813060,"Headline":"Why Amazon Stock Sorely Lagged the Broader Market in 2021","Source":"Nasdaq","Summary":"What happened\nFor investors in many of the companies that posted outsized growth during the pandemic's first year, 2021 was somewhat of a letdown. For example, e-commerce giant Amazon (NASDAQ: AMZN) delivered a mere 2% gain in 2021, according to data provided by S&P Global Ma"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6da32a0a14282eb066a8fd8645b3266795b19680aa4f9a260224346d9e92261"}
{"Ticker":"AMZN","Date":1641812820,"Headline":"Why Amazon Shares Are Sliding Today","Source":"Benzinga","Summary":"Amazon.com Inc (NASDAQ: AMZN) is trading lower Monday amid overall market weakness as a rise in yields and anticipated tapering concerns in 2022 weigh on stocks.\nThe..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=70af8b90545815f4c12264e16f03f0317637a5392bc8e1840a4f974963bdf90d"}
{"Ticker":"AMZN","Date":1641812820,"Headline":"Amazon: Long Growth Runway Provides Meaningful Upside Potential","Source":"Nasdaq","Summary":"Amazon (AMZN) is one of the top five companies in the United States that is working in the information technology industry. The company focuses on e-commerce, AI, digital streaming, and cloud computing. Headquartered in Seattle, Washington, the company was founded in 1994, and since then, its team has grown marginally. \n\n\n\nIn 2020, the multinational company had 1,298,000 employees working in either full-time or part-time capacity. In the same year, Amazon also reported total net revenue of $386 billion. Its offices are located in 36 different countries, with the total number of locations reaching 235.\n\n\n\nI am bullish on Amazon as it has strong growth potential, a wide moat, a discounted valuation, unanimous Wall Street bullishness, and substantial upside relative to its one-year price target.\n\n\n\nStrengths\n\n\n\nAmazon has tapped into three different but equally vast industries, including retail, internet, and consumer electronics industries. It has a significant global footprint, with Amazon Marketplace serving 17 countries in total. \n\n\n\nBetween 2018 and 2019, the company saw a massive increase in its revenues and profits, a 20.5% and 15% increase, respectively. Its low price structures, significant number of third-party sellers, and the largest merchandise selection have earned it the rightful place in the market. \n\n\n\nIt has created unrivaled synergies between four different marketplaces through the various businesses it runs, including Marketplace, Prime, Web Services, and Subscription services. The technological advancements have allowed the company to cope with larger capacities and enhance customer satisfaction at a fraction of the costs.\n\n\n\nRecent Results\n\n\n\nAmazon’s net sales reached $386 billion in the year ended December 31, 2020. In 2019, the net sales were at $280.5 billion, which means the total year-over-year growth percentage for 2020 was approximately 38%. \n\n\n\nNet income increased from $11.59 billion in 2019 to $21.33 billion in 2020. Additionally, the cash and cash equivalents at the end of the year also increased from $36.1 billion to $42.27 billion in 2020.\n\n\n\nThe basic earnings per share and diluted earnings per share reached $42.64 and $41.83, respectively. The year before that, these numbers stood at $23.46 and $23.01, respectively\n\n\n\nValuation Metrics\n\n\n\nAMZN stock looks attractively valued at the moment. It currently trades at a 22.3x forward enterprise value-to-EBITDA ratio, which looks quite reasonable compared to its historical average of 23.1x. Furthermore, its forward price-to-normalized-earnings ratio of 83.3x is well below its historical average of 100.5x. \n\n\n\nMeanwhile, growth is expected to be strong in the coming years, with EBITDA expected to grow by 23% in 2022 and normalized earnings-per-share expected to grow by 28.9% in 2022.\n\n\n\nWall Street’s Take\n\n\n\nAccording to Wall Street analysts, AMZN earns a Strong Buy consensus rating based on 30 Buy ratings and no Hold or Sell ratings assigned in the past three months. Additionally, the average Amazon price target of $4,137.5 puts the upside potential at 31.7%.\n\n\n\n\n\n\n\nSummary and Conclusions\n\n\n\nAmazon is a leader across many industries, including e-commerce, cloud computing, and artificial intelligence. It has a wide moat with a vaunted logistics infrastructure underpinning its dominant online presence. Given that it operates in innovative and disruptive industries, it has a lengthy growth runway that makes its current valuation multiples look very reasonable.\n\n\n\nOn top of that, Wall Street is unanimously bullish on the stock, and the average price target implies substantial upside for the share price over the next year. As a result, it looks like it might be a good time to add shares.\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRead full Disclaimer & Disclosure"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c35fe3aa6d7541cc0a6bd5d7a3016b05b492de167ae96f5be0d13d23c87b39e"}
{"Ticker":"AMZN","Date":1641812400,"Headline":"Down 60%, Is This ARK Invest Favorite a Buy Now?","Source":"Nasdaq","Summary":"In this video, I will be talking about one of Cathie Wood's favorite stocks, Roku (NASDAQ: ROKU). The stock is down 61% since its all-time highs, and the business has gone through some turbulent times. You can find the video below, but here are some highlights."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bfc41052f462e39347fd5d39ddbd259313e1bbd9db7352bc5ca009f52490f8d6"}
{"Ticker":"AMZN","Date":1641811560,"Headline":"Flux Crypto Turns Up Web 3.0 Development With Nvidia Partnership","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c138af860790b0ad35a36f9061d8477cda5647ac8744b0b5d82ed1b88de26499"}
{"Ticker":"AMZN","Date":1641810904,"Headline":"Amazon files new legal challenges in dispute with Future Group-sources","Source":"Reuters","Summary":"Amazon.com Inc has filed fresh legal challenges in its long-running dispute with Indian retailer Future Group after the national antitrust agency suspended a 2019 deal between the two sides, leading to a halt in their arbitration, four sources told Reuters on Sunday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bc05e351c1271f0d9743cfab7a30bc867da894d651ca465c9cc1d985325565f3"}
{"Ticker":"AMZN","Date":1641808800,"Headline":"Market Crash 2022? Why Long-Term Growth Stocks Work","Source":"Nasdaq","Summary":"Will the market crash in 2022? Inflation and interest rates have investors on edge, and many believe we are in an economic bubble. Stock market predictions will always have bears and bulls battling, but as a long-term investor for over 20 years, I would like to share my thoughts."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c87f101fa6d7976d50d447c1342100671ae12f3b7d2bd130a6aa42ba70af851d"}
{"Ticker":"AMZN","Date":1641808800,"Headline":"3 Reasons Why Austin is a Homebuyer's Dream in 2022","Source":"Nasdaq","Summary":"Austin, Texas, fell from the No. 1 spot in 2021 to No. 10 in 2022 on Zillow's list of hottest housing markets in America. Tampa, Florida, has assumed the top spot, but Austin is still a very robust market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=14aeb2dbe08e2af639c8281878779151fc56efb1078af62e6ead5a281658e98d"}
{"Ticker":"AMZN","Date":1641807317,"Headline":"Tech Has Fallen: An Analysis Of Global-E Stock","Source":"SeekingAlpha","Summary":"Global-e Online has delivered triple-digit returns in its brief lifetime as a public company. Read an analysis of valuation and future of GLBE stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ce3daa3247c852f412a7654b1e4e83b26933e43636fa294e9b9bec59e6c6af1"}
{"Ticker":"AMZN","Date":1641807180,"Headline":"Benzinga Asks: Which Company Could Join The $1-Trillion Market Cap Club Next? Did NVDA, TSM, BRKA Or TCEHY Win?","Source":"Benzinga","Summary":"Several of the largest technology companies made headlines in 2021 for hitting significant market capitalization milestones.\nMicrosoft Corp (NASDAQ: MSFT) hit a $2-trillion market..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36cdad239316c49c6bfaa7654643f204a7a793f32f002d0246509d9c824c7132"}
{"Ticker":"AMZN","Date":1641804900,"Headline":"US STOCKS-Nasdaq set to open lower as tech stocks extend declines","Source":"Nasdaq","Summary":"Nasdaq futures fell 1% on Monday as heavyweight technology stocks dropped on expectations of a high interest rate environment, while big banks extended gains after U.S. Treasury yields climbed to new two-year highs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bbd884c9bd9bff06bc494d0c2aaf5e001c0a338c6e5a0825724eb17c5949923"}
{"Ticker":"AMZN","Date":1641804000,"Headline":"How to Beat the S&P 500 in 2022","Source":"Nasdaq","Summary":"Famous investor Warren Buffett is famous for (among other things) winning a bet that money parked in an S&P 500 (SNPINDEX: ^GSPC) index fund would outperform professional money managers over 10 years. It's not easy to consistently beat a collection of the world's largest and most"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afadb65b82cea7ebda29107f534ec77be0814d7da41c125b1196569864ae78a3"}
{"Ticker":"AMZN","Date":1641801600,"Headline":"Microsoft Is Hitting Home Runs, With The Metaverse On Deck","Source":"Nasdaq","Summary":"The metaverse could be an $800 billion addressable market by 2024, according to Bloomberg. This is a massive opportunity for any tech company able to gain significant market share, and there's one company with the history and inside track to gobble up a gigantic portion of it."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db221ce7ecf4d80212e63970fe380af311f51752249666b2d29897dd075902ff"}
{"Ticker":"AMZN","Date":1641799800,"Headline":"Want $1 Million? 2 Monster Stocks to Buy and Hold for the Next Decade","Source":"Nasdaq","Summary":"In Warren Buffett's 1993 shareholder letter, the legendary value investor cited this quote: \"In the short run, the market is a voting machine [...] but in the long run, the market is a weighing machine.\" In other words, volatility is unavoidable. At times, great companies may los"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04686d8cf97f03481e94b74c5660db6ee1b6e45270246ea1cf345e7948e839aa"}
{"Ticker":"AMZN","Date":1641799020,"Headline":"US STOCKS-Futures muted, banks extend gains on high yields","Source":"Nasdaq","Summary":"U.S. stock index futures were subdued on Monday after posting losses for their first week of the new year, while big banks extended gains as U.S. Treasury yields climbed a new two-year high."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fbaf705ddec99045c91229fe29ee515c25961b116b4da8da29b168da0528d771"}
{"Ticker":"AMZN","Date":1641795060,"Headline":"My 3 Biggest Stock Market Predictions for January","Source":"Nasdaq","Summary":"Most of the time, most investors' focus should be on the long term That's not to say, however, that long-term investors should simply ignore any and all real-time developments. Important long-term changes can happen in an instant. You have to be ready and willing to respond, if m"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9d846dac0dd5008c8bd143675dc5f47d8c8b3b4944fbd61c0882f04f6c83779b"}
{"Ticker":"AMZN","Date":1641794844,"Headline":"Japan’s Panasonic Joins Global Trend Toward Four-Day Week","Source":"Yahoo","Summary":"(Bloomberg) -- Panasonic Corp. is introducing an optional four-day work week, one of a small but growing number of Japanese companies joining the global trend to encourage a good work-life balance.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorCyprus Finds Covid-19 Infections That Combine Delta and OmicronWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameAlexandria Ocasio-Cortez Tests Positive for Covid-19Omicron Study in South Africa Points to End"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8d739ce3421e5ae62314734baae7fd02929e3c5781685b6ac88902b267c372eb"}
{"Ticker":"AMZN","Date":1641794760,"Headline":"Investing in This ETF Right Now Could Make You a Millionaire Retiree","Source":"Nasdaq","Summary":"So you want to amass a million dollars by retirement, and you'd like to get there by investing in an exchange-traded fund (ETF) -- a fund that trades like a stock. That's a fine plan (though some people might want to aim for more than a million dollars).There are more than 2,500"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=020f5e840ab6a7914f0fb69aba36c67c9a03fb7568c333c55ae5828580564a89"}
{"Ticker":"AMZN","Date":1641794400,"Headline":"Down 17% in First Week of 2022, Rivian Stock Looks Extremely Undervalued","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=52c6bf1cebeb602f99fca72fd6d7d43dbd27028209ad2cde3295ab76c39662ec"}
{"Ticker":"AMZN","Date":1641794400,"Headline":"FOCUS-Forget shareholder resolutions, fund manager says: hire better directors","Source":"Nasdaq","Summary":"A Texas-based fund manager is not jumping on the bandwagon of peers backing shareholder resolutions that call on companies to take stronger action on climate change. Dimensional Fund Advisors argues it would be more effective to just replace corporate directors who fail to address the issue."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f52c7ad2086e021d516237921ffe7dc704ed1ce3f844dca2aa27da8dd77fb91c"}
{"Ticker":"AMZN","Date":1641794100,"Headline":"Big Tech Stocks: What’s in Store for 2022?","Source":"Nasdaq","Summary":"Big tech stocks have witnessed a fair amount of selling over the past month. Valuation concerns and uncertainty regarding the COVID-19 pandemic led to a selloff in tech stocks. The chart below shows that big tech companies are trading in the red, while Apple (NASDAQ:AAPL) and Meta Platform (NASDAQ:FB) barely managed to stay in the green over the past month. \n\n\n\n\n\n\n\nWith tech stocks currently under pressure, let’s look at each of these tech giants to ascertain what the future holds for them in 2022.\n\n\n\nApple \n\n\n\nDespite supply-chain concerns, Apple delivered a solid financial performance in FY21. Strong sales across all product categories and strength across all of its geographies drove Apple’s financials, and in turn, its stock, which outperformed the benchmark index in 2021. \n\n\n\nLooking ahead, demand for Apple products is likely to outpace supply, as noted by Wedbush analyst Daniel Ives. The analyst is bullish on Apple stock. He sees higher demand and the easing of supply-chain issues in the first half of 2022 as a tailwind for Apple stock. Moreover, Ives noted that higher average selling prices provide a multi-year growth opportunity. \n\n\n\nBesides robust demand and higher selling prices, Ives expects Apple to gain from its growing market share in China. \n\n\n\nOverall, the majority of analysts are bullish on Apple stock. Its Strong Buy consensus rating is based on 21 Buys, 3 Holds, and 1 Sell. However, hedge funds have been selling Apple stock. TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 4 million Apple shares over the past three months. \n\n\n\nAmazon \n\n\n\nTough comparisons, cost inflation, and supply-chain disruptions weighed on Amazon’s (NASDAQ:AMZN) financial performance in 2021, and in turn, its stock price. Amazon stock underperformed the Nasdaq 100 Index by a wide margin in 2021. \n\n\n\nGiven the near-term challenges, investors and hedge funds have a negative outlook on Amazon stock. TipRanks’ Stock Investors tool shows that about 1.3% of investors holding portfolios on TipRanks have sold AMZN stock in the last 30 days. Meanwhile, hedge funds have lowered their holdings by 576.2K shares in three months. \n\n\n\nNevertheless, Monness analyst Brian White is bullish on Amazon for 2022. He expects Amazon’s growth to accelerate in the 2H22. Further, White noted that AWS’ (Amazon Web Services) revenue growth has accelerated over the past three quarters, while Amazon is well-positioned to benefit from an “accelerated digital transformation.” \n\n\n\nAlong with White, most Wall Street analysts maintain a bullish outlook on Amazon stock. AMZN has received 30 positive analyst reviews for a unanimous Strong Buy consensus rating. \n\n\n\nAlphabet\n\n\n\nAlphabet (NASDAQ:GOOGL) stock delivered strong returns in 2021 and outperformed its peers, thanks to the stellar recovery in ad sales and the strength of its cloud business. \n\n\n\nLooking ahead, Alphabet could benefit from higher advertising revenues and growth in the cloud segment. Further, its balance sheet and cash flows remain strong. \n\n\n\nTaking note of its strong cash flows, Ivan Feinseth of Tigress Financial stated that Alphabet would continue to boost shareholders’ returns through share buybacks and fund its growth initiatives on the back of its robust cash flows. \n\n\n\nFeinseth sees Alphabet benefiting from secular tech trends, including video sharing, cloud computing, growing mobile engagement, and the ongoing shift to digital advertising, among others. \n\n\n\nOn TipRanks, Alphabet stock sports a Strong Buy consensus rating based on 26 Buy and 2 Hold recommendations. Furthermore, 1.9% of the investors holding portfolios on TipRanks have increased their exposure to GOOGL stock over the last 30 days. \n\n\n\nMicrosoft \n\n\n\nThanks to the strength in its cloud business, Microsoft (NASDAQ:MSFT) stock increased over 49% in one year and outperformed the benchmark index. Despite the appreciation in its share price, Jefferies analyst Brent Thill is upbeat about Microsoft’s prospects and maintains a bullish outlook on the stock. Thill increased his price target on Microsoft to $400 from $375. \n\n\n\nThill sees Microsoft as the “safest largecap investment option” with multiple growth vectors. The analyst expects Microsoft to continue to enhance shareholder value on the back of its strong profitability and free cash flows. However, he expects Microsoft’s top-line growth to moderate a bit in the coming quarters. \n\n\n\nOverall, on TipRanks, Microsoft stock has received 24 Buys and 1 Hold for a Strong Buy consensus rating. Furthermore, it scores a 9 out of 10 on TipRanks’ Smart Score system, indicating that MSFT stock could outperform the market averages.\n\n\n\nMeta Platforms \n\n\n\nFacebook changed its name to Meta Platforms to better reflect a metaverse company. However, investors and hedge funds continue to dump their stock. \n\n\n\nTipRanks’ Stock Investors tool shows that about 0.7% of investors holding portfolios on TipRanks have sold FB stock in the last 30 days. Meanwhile, TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 1.7 million Meta Platforms shares over the past three months. \n\n\n\nMonness analyst Brian White noted, “The longer-term journey for Facebook became more intriguing in the later part of 2021 with the company introducing its vision for the metaverse, followed by a name change to Meta Platforms.” \n\n\n\nHowever, he expects Apple’s app tracking transparency to continue to hurt Meta Platforms in the future. \n\n\n\nNevertheless, he maintains a Buy rating on Meta Platforms and expects it to benefit from favorable digital ad trends and digital transformation opportunities. Meanwhile, on TipRanks, FB stock has a Strong Buy consensus rating based on 28 Buys and 5 Holds. \n\n\n\nDownload the TipRanks mobile app now\n\n\n\nDisclosure: On the date of publication, Amit Singh had no position in any of the companies discussed in this article.\n\n\n\nDisclaimer: The information contained in this article represents the views and opinion of the writer only, and not the views or opinion of TipRanks or its affiliates  Read full disclaimer >"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ad7ecad6f79af73a490aeb5d07b2c44237170a1621ad933f89c841e7c8d7063"}
{"Ticker":"AMZN","Date":1641785760,"Headline":"Sector Themes In Play In The Markets For 2022","Source":"SeekingAlpha","Summary":"Dips will continue to be bought unless something significant changes. Click here for more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6d62d8f286b6960b7a4db16d3b514067ec4d996e1556715b87302038aa4bdd9"}
{"Ticker":"AMZN","Date":1641785460,"Headline":"What’s Happening With Baidu’s Stock?","Source":"Nasdaq","Summary":"Baidu’s stock (NASDAQ: BIDU) declined by 3.1% in the last ten trading days. In comparison, the broader S&P500 index rose by 0.05% over the same period. The company last week held its annual developers’ event in the virtual world of its metaverse app, XiRang"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d95b33a2e88a3ccf845619139620e2902ff9a4dd29eab7b614c71903b02cadd"}
{"Ticker":"AMZN","Date":1641783960,"Headline":"BMW Reveals Car That Changes Color","Source":"Benzinga","Summary":"German automaker BMW (OTC: BMWYY) revealed a concept vehicle at the recently-held Consumer Electronics Show in Las Vegas that can change color.\nWhat Happened: The concept was..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa3bb215fff6b7be1140082de3212c1c594ef8ad196d26ff98dc8cedd3c68377"}
{"Ticker":"AMZN","Date":1641774821,"Headline":"'Dump Stocks That Don't Make Money' We Hear, I Say Poppycock! Also My Trades","Source":"SeekingAlpha","Summary":"The market is suffering from a lack of visibility, and opportunists hoping to sell value stocks are trying to scare people out of tech names. I would rather they take the long view."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a1b3c19426fdcf6e894f2b747866f9b1519357870b882d1fb86f094009f27b88"}
{"Ticker":"AMZN","Date":1641939488,"Headline":"U.S. labor board sets dates for union vote at Amazon warehouse in Alabama","Source":"Reuters","Summary":"The U.S. National Labor Relations Board said on Tuesday that it will send unionization ballots to workers at an Amazon.com Inc warehouse in Bessemer, Alabama, on Feb. 4, setting the stage for the next labor contest facing the online retailer."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e002bcd34782d1c8de3b144f4410f19c968a3f87fdbdebf9a93876e20caae3f"}
{"Ticker":"AMZN","Date":1641938040,"Headline":"Why PayPal Stock Plunged 19% in 2021","Source":"Nasdaq","Summary":"What happened\nShares of digital payments behemoth PayPal Holdings (NASDAQ: PYPL) ended 2021 down 19%, according to data provided by S&P Global Market Intelligence. This performance lagged behind the S&P 500, which produced a superb return of 27% for the year. Two straight"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ba1e0dba816c70eecb9cc2ef7c4de30aa7efe74b94c975b17a13ab1452b83e9f"}
{"Ticker":"AMZN","Date":1641936980,"Headline":"Walgreens, CVS cut paid sick leave for workers in line with CDC guidance","Source":"Finnhub","Summary":"Walgreens Boots Alliance and CVS Health Corp have cut paid sick leave for workers who test positive for COVID-19, aligning their policies to a change in U.S. health guidance, the companies said on... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=85351421790990a2c5a329b294616f51c9d0afed0aa9e39424078b3a6cb5f912"}
{"Ticker":"AMZN","Date":1641936537,"Headline":"Market check: Nasdaq stocks stage comeback, Dow and S&P 500 close near all-time highs","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down a market chart comparing Nasdaq stock returns."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc781f9dc0d816a54852aa527687fb106d56cc0af2eba684a6ae26075650023f"}
{"Ticker":"AMZN","Date":1641936039,"Headline":"Inflation ‘will help us drive subscribers,’ fuboTV CEO says","Source":"Yahoo","Summary":"fuboTV CEO and Co-Founder David Gandler joins Yahoo Finance Live to discuss the future for live sports streaming."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c3a980bc76e17d11ef8c65640107d0c94bd81a07a14f03a702a05f5aa6aa25c6"}
{"Ticker":"AMZN","Date":1641932582,"Headline":"Amazon Staff in Alabama Will Vote Again on Unionizing Next Month","Source":"Yahoo","Summary":"(Bloomberg) -- Amazon.com Inc. employees in Bessemer, Alabama, will vote by mail next month in a re-run election on whether to unionize, the National Labor Relations Board announced Tuesday. Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorEurope Slowly Starts to Consider Treating Covid Like the FluStocks Halt Five-Day Rout After Powell’s Remarks: Markets WrapSingapore Breaks Down Covid Deaths by Vaccine, With Moderna Seeing Lowest RateRepeat Booster Shots Spur E"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b0313a969cebbd499996b15ac77b03ba003ecb87f16680846cb833a45645dba9"}
{"Ticker":"AMZN","Date":1641932288,"Headline":"Amazon (AMZN) Boosts AWS Portfolio with New EC2 Instances","Source":"Yahoo","Summary":"Amazon's (AMZN) AWS announces the general availability of purpose-built Amazon EC2 instances, Hpc6a, which are designed for HPC workloads."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02ca621e7981391ef637e5661418b066caa2ea1544dc2fa607053d36fd71647b"}
{"Ticker":"AMZN","Date":1641930736,"Headline":"Why Amazon, Sea Limited, and MercadoLibre All Surged on Tuesday","Source":"Yahoo","Summary":"After days of declines, a large number of e-commerce and technology stocks staged a wide-ranging relief rally on Tuesday.  Investors focused on a broader range of economic issues, allowing high-growth stocks to stage a comeback.  E-commerce platforms have taken it on the chin recently, as investors bet that massive gains resulting from the pandemic would eventually fade."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=58ccb75e1d81b691d2be4b1920a716241ca9326c98933f88aeb605114d57c335"}
{"Ticker":"AMZN","Date":1641929399,"Headline":"Market strategist: The issue with tech stocks is ‘simply one of valuation’","Source":"Yahoo","Summary":"Simeon Hyman, ProShares Global Investment Strategist, joins Yahoo Finance Live to discuss how the market and investors may be expected to react to Fed Chair Powell's confirmation hearing, inflation pressures, interest rates, the tech sector, and the market growth outlook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=157d122d4facee31f8fcf81e926af8bbac0341b48817889348ec80ae4e5a33e1"}
{"Ticker":"AMZN","Date":1641929177,"Headline":"Triangle firms beware: Amazon beefs up local tech jobs","Source":"Yahoo","Summary":"As Triangle employers battle to fill open tech positions, the mega company is stepping up its hiring game in the region."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e57b431879cd0c44850429988ef4eacc7ac99a7ea640f6a757ba89f9c80d0e63"}
{"Ticker":"AMZN","Date":1641926287,"Headline":"Linden Rose Investment LLC Buys Apple Inc, Alphabet Inc, Amazon. ...","Source":"Yahoo","Summary":"Investment company Linden Rose Investment LLC (Current Portfolio) buys Apple Inc, Alphabet Inc, Amazon.com Inc, Berkshire Hathaway Inc, sells Sea, Pinduoduo Inc, Shopify Inc, Fiverr International, Tencent Holdings during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Linden Rose Investment LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ea1004d44bc1b750997aef7ed9326b3148d9b2b4c1ba0dea29e078f0782664f7"}
{"Ticker":"AMZN","Date":1641925285,"Headline":"Why Micro Focus Stock Jumped on Tuesday","Source":"Yahoo","Summary":"Shares of enterprise software company Micro Focus (NYSE: MFGP) jumped on Tuesday, following an analyst's move to upgrade his rating on the stock.  Jefferies analyst Charles Brennan upgraded his rating on the stock from hold to buy, noting that organizations' digital transformations are not decelerating, leading to significant investment around the world in enterprise software.  \"The product investments and operational changes we are making are beginning to deliver performance improvements, and our value propositions are resonating with customers and partners,\" said Micro Focus CEO Stephen Murdoch in the company's update last summer."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=84ffe786b1a15ce948a7c3ff6bb9b4c26ef6ab4e726cb75077dea7c5bb21faa6"}
{"Ticker":"AMZN","Date":1641924384,"Headline":"Why JD.com Stock Was Climbing Today","Source":"Yahoo","Summary":"Shares of JD.com (NASDAQ: JD), the Chinese e-commerce giant, were moving higher today on several news items, the biggest of which was a bullish analyst rating.  Atlantic Equities initiated coverage on JD stock with a buy rating and a price target of $100, which represents 44% upside from the stock's closing price yesterday.  It represents the company's first brick-and-mortar foray into Europe, opening up a huge market for JD."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ef0e826a77140f470f35bbfa948293cc2139b0ac604c05ac9effdd2d753dacf6"}
{"Ticker":"AMZN","Date":1641923854,"Headline":"Here's Why Dropbox Stock Rose 10% in 2021","Source":"Yahoo","Summary":"Solid growth drove Dropbox higher last year -- until November, when investors generally started to lose their enthusiasm for work-from-home stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9b6f92ddf47522eb2aa6c1d0445ab8d4f15a7e7344aca7faabb5a862cd7d33ef"}
{"Ticker":"AMZN","Date":1641920658,"Headline":"PayPal Stablecoin Could Be Coming Soon. Should You Buy?","Source":"Yahoo","Summary":"PayPal Holdings Inc. has publicly confirmed its intentions to launch its own cryptocurrency stablecoin as first reported by Bloomberg.  PayPal confirmed the announcement, responding to our inquiry for comment.  \"We are exploring a stablecoin; if and when we seek to move forward, we will of course, work closely with relevant regulators,\" per PayPal's official statement via email to The Ascent by The Motley Fool."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fed302c794b9b8e0578145fce50a7eaa228ef888cb2d9a0159bfe513bdbf2a49"}
{"Ticker":"AMZN","Date":1641920280,"Headline":"Stock Market Today: Tech Leads on Turnaround Tuesday","Source":"Nasdaq","Summary":"Markets opened Tuesday in the red, suggesting another day of selling on Wall Street ahead, but bounced off their mid-morning lows to blaze a trail higher into the close."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=84024443dda8c286f0ede4ce73dac09c8072f49e9da83423bf9c08c6babfbe0f"}
{"Ticker":"AMZN","Date":1641920220,"Headline":"Will Amazon Hit $4,000 in 2022?","Source":"Yahoo","Summary":"It's with this momentum that Amazon (NASDAQ: AMZN), one of the largest players in the industry, started 2021.  Second, Amazon's iconic founder, Jeff Bezos, stepped down from his role as the CEO of the company in the third quarter, leaving his deputy Andy Jassy in charge.  Will these factors continue to weigh on Amazon's stock performance, or can the company get back to its market-beating ways?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a31240d896c21b4d06c25e0ff2d0d94a6da72a61f3ec39224098a00e5611c1f5"}
{"Ticker":"AMZN","Date":1641920121,"Headline":"Apple's Tim Cook made $98M in 2021 — how that compares to other tech CEOs","Source":"Yahoo","Summary":"Apple CEO Tim Cook made $98 million in 2021. Here's how that compares to other major tech CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=83476b2936ed1a93f5564b75ba25716a7699a7dfff77a5269b17b69a7bb2a643"}
{"Ticker":"AMZN","Date":1641919175,"Headline":"Amazon FANG, Netflix Q4, GM Used Cars: 3 Things to Watch","Source":"Yahoo","Summary":"Stocks reversed yet again on Tuesday after Federal Reserve Chair Jerome Powell wasn’t as aggressive about monetary policy as people thought he would be.  Technology stocks jumped after Powell said the central bank didn’t aim to undermine strong employment trends.  The Fed will begin removing some of the massive stimulus it unleashed on the economy to support it for the duration of the pandemic."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3e66a5d14e9c6677db2c22ff8dd910d3cc43ea8785a1929fbf6735fedb1d3bf8"}
{"Ticker":"AMZN","Date":1641918988,"Headline":"Two of Sen. Kyrsten Sinema's former aides have lobbied for corporate giants looking to influence Joe Biden's agenda","Source":"CNBC","Summary":"Two of Sen. Kyrsten Sinema's former aides have become key aides for corporate giants looking to impact President Joe Biden's agenda. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=111d6e9729960e1e46abdebcd8343a198181d97fb8199a6e39514c548ccced61"}
{"Ticker":"AMZN","Date":1641918784,"Headline":"2 Stocks to Buy if the Market Crashes in 2022","Source":"Yahoo","Summary":"Growth investors have endured significant market volatility in recent months, and the macroeconomic environment suggests that things may get worse before they get better.  The omicron variant of the coronavirus threatens to throw a wrench into global supply chains, while the Federal Reserve is expected to raise interest rates three times this year to curb rampant inflation.  Collectively, those headwinds have translated into turbulence -- and anytime there is turbulence in the market, people start to worry about a market crash."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=57129c2f905d11cbe727f661c2cd29efbbfa02aa7ec063fc87e6cd864c046f19"}
{"Ticker":"AMZN","Date":1641918177,"Headline":"1 Green Flag for Roku in 2022, and 1 Red Flag","Source":"Yahoo","Summary":"Roku's (NASDAQ: ROKU) stock was cut in half over the past 12 months as investors fretted over the decelerating usage of its streaming media devices in a post-lockdown world.  Supply chain disruptions also throttled its sales of new hardware players and crushed the segment's gross margins, while rising interest rates -- which sparked a rotation away from pricier growth stocks like Roku -- exacerbated the pain.  Last month, I said investors might be too bearish on the stock, for four reasons: It had just settled a lengthy dispute with YouTube, it was rolling out fresh original content for the Roku Channel, it was gradually expanding overseas, and Cathie Wood's ARK exchange-traded funds (ETFs) continued to accumulate more shares of Roku as it tumbled."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2a8462d5702db58e6c9075d4b03811933b70cc7ba6564052bfb4d303693fd00"}
{"Ticker":"AMZN","Date":1641917700,"Headline":"Can HBO Maintain Its Success in 2022?","Source":"Yahoo","Summary":"AT&T (NYSE: T) shared some details about its HBO Max business ahead of an investor conference earlier this month.  The numbers indicate HBO added about 4.4 million subscribers in the fourth quarter.  When AT&T reports its fourth-quarter results later this month, investors will want to see a turnaround in domestic subscribers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bd0c017fe2917f9c3f217a21e875d1ab36f304897b138d67e6ea173b41ef92ba"}
{"Ticker":"AMZN","Date":1641917436,"Headline":"Amazon Top FANG Stock For 2022","Source":"Yahoo","Summary":"By Sam Boughedda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=564d2b2b4d598fdbe843effae37df64a4bae7dffde06ae149db476a15e4255b8"}
{"Ticker":"AMZN","Date":1641916800,"Headline":"Is Amazon the Best FAANG Stock to Buy in 2022?","Source":"Yahoo","Summary":"In this video, I will be talking about what is arguably the best FAANG stock to buy in 2022, Amazon (NASDAQ: AMZN).  Unlike other megacap companies, Amazon has remained fairly flat.  Two potential catalysts for 2022 would be a spinoff of Amazon Web Services (AWS) and a long-awaited stock split."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=51a2bcaa719882844a090466681ffbe67d38e6680a45258faa91721972cd290e"}
{"Ticker":"AMZN","Date":1641913680,"Headline":"Amazon Warehouse Workers in Alabama to Hold Second Union Vote ","Source":"DowJones","Summary":"The new vote, to be held by mail, follows a finding by a regional National Labor Relations Board director that Amazon violated labor laws during the first election."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9652dfdc187ae447822d7003b58725ae116f23222bd6d30007ba1e1c236e6df6"}
{"Ticker":"AMZN","Date":1641911220,"Headline":"Noteworthy Tuesday Option Activity: AMZN, CMG, GOOGL","Source":"Nasdaq","Summary":"Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Amazon.com Inc (Symbol: AMZN), where a total of 201,757 contracts have traded so far, representing approximately 20.2 million underlying shares.  That amounts to about 69"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88a05101f7418ab3218c777be96dac7c25adc30dfe92028aeb4c46c52ca5c3c6"}
{"Ticker":"AMZN","Date":1641911100,"Headline":"US STOCKS-Wall Street bounces as Powell's testimony brings some relief","Source":"Nasdaq","Summary":"U.S. stock indexes were gaining ground on Tuesday with Nasdaq leading the advance as investors appeared relieved that Federal Reserve Chair Jerome Powell's testimony to Congress did not include any major surprises."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=37885c8ffd70c4a6d91865cae05e890c782dae300d11afff542d92dccab250b1"}
{"Ticker":"AMZN","Date":1641909000,"Headline":"How The Economy Has Changed Since Georgia's Last College Football National Championship","Source":"Benzinga","Summary":"The Georgia Bulldogs defeated the Alabama Crimson Tide 33-18 on Monday night to win their first NCAA football championship in 41 years.\nThe last time the Bulldogs won a national..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9495a1263a26677585b3f25e7a2926f945cffe793d5544f1aa287717ea1bbb0"}
{"Ticker":"AMZN","Date":1641905760,"Headline":"US STOCKS-Wall St bounces as tech stocks rise after Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock indexes reversed course on Tuesday as technology stocks recovered, with investors taking comfort in Federal Reserve Chair Jerome Powell's testimony to Congress not delivering any major surprises."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c8b3a5decaf5683ba65a677c1d00fb7722c1ff94e35f4b3537de2a4c2efddcc8"}
{"Ticker":"AMZN","Date":1641905520,"Headline":"RBC's Top 30 Global Stock Investments for 2022","Source":"Nasdaq","Summary":"It will be tough to top the S&P 500's whopper of a performance in 2021. But investors can still look forward to \"solid\" if more \"moderate\" returns in the year ahead, says RBC Capital Markets – and perhaps even better with the right stock investments."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=07faea6b434dca776b4bb6a5c4f4f456def240cc546e693b405a30121dfc681b"}
{"Ticker":"AMZN","Date":1641905244,"Headline":"U.S. labor regulator sets dates for union vote at Amazon warehouse in Alabama","Source":"Finnhub","Summary":"The U.S. National Labor Relations Board said on Tuesday that it will send unionization ballots to workers at an Amazon warehouse in Bessemer, Alabama on February 4. ... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=99a4d395ea300ae40cd3ec2eb605347ffc71f8159e426a8aacba915e83eeca18"}
{"Ticker":"AMZN","Date":1641902412,"Headline":"Corporate America revamps back-to-office plans on Omicron threat","Source":"Finnhub","Summary":"Companies across the United States are revising their back-to-office plans, driven by rising uncertainty around the Omicron COVID-19 variant that has pushed up infections to record levels in the... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d383e8ab61add40857ab07c1437d321fdca7bff69f243d558d055e1006612c0c"}
{"Ticker":"AMZN","Date":1641901749,"Headline":"Factbox-Corporate America revamps back-to-office plans on Omicron threat","Source":"Finnhub","Summary":"Companies across the United States are revising their back-to-office plans, driven by rising uncertainty around the Omicron COVID-19 variant that has pushed up infections to record levels in the... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=712ed4705ce466edd38c20913c56441cfdcffbcfd6b6510030b1870a8c3af4d0"}
{"Ticker":"AMZN","Date":1641900978,"Headline":"Triple Threat","Source":"SeekingAlpha","Summary":"Stocks, bonds, and gold have all stumbled out of the gates in 2022. Read more about three sectors that show signs of strength amid stock market weakness."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0e9030025eba0d9ee73fba827c22a7cba6f2d65e48ab01c4eaefbbe895d4016"}
{"Ticker":"AMZN","Date":1641899400,"Headline":"Is A Rivian Electric Bike On The Horizon? What Investors Should Know About New Trademark","Source":"Benzinga","Summary":"Rivian Automotive (NASDAQ: RIVN) has a focus on electric pickups and electric delivery vehicles, and it might have another mode of transportation in its sights. \nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=188b7679828eb4b89b2dddb76bc09ba849f4eea4307943d870174d41b2cc93ab"}
{"Ticker":"AMZN","Date":1641898150,"Headline":"Alibaba Stock Forecast: Has The Price Reached A Floor Or Will Trends Continue?","Source":"SeekingAlpha","Summary":"Recent crackdowns in the fintech and internet sector seemed to be favoring Alibaba Group. Read more to see the forecast for BABA stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2e181da7406cfe0b1429cc020296b79bd68ee708ba94579c9632802c9c843e4"}
{"Ticker":"AMZN","Date":1641896740,"Headline":"How DigitalOcean Stock Could Grow 10x In 10 Years","Source":"SeekingAlpha","Summary":"DigitalOcean is a relatively small company with a huge opportunity in the fast growing SMB IaaS\/PaaS space. Learn more about DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c8a649792836873cf4452789b960902aeadbcb2c468ff9010d215a6c4542420"}
{"Ticker":"AMZN","Date":1641895800,"Headline":"3 Top Tech Stocks Under $20 Per Share","Source":"Nasdaq","Summary":"You don't need to have thousands of dollars to begin investing. If you have only $20, you can still buy shares of high-quality stocks. Your future self might thank you for investing that $20 instead of buying pizza tonight -- because investing $100 or even $20 can help you build"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=273f335370a49ff4d6981b68b275d9bf1700cdc38417caa366b87ecfc99b6d9f"}
{"Ticker":"AMZN","Date":1641894720,"Headline":"US STOCKS-Wall Street down ahead of Powell testimony","Source":"Nasdaq","Summary":"U.S. stock indexes fell on Tuesday ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3852dafdf7e4fc27ce1f94b948ff9679cd09df66ac9618d12cd238b554dd03f0"}
{"Ticker":"AMZN","Date":1641893880,"Headline":"Paying Up Precedes Spectacular Repricing Cycles","Source":"SeekingAlpha","Summary":"The negative start to 2022 is a step in the mean reversion needed - but much more is yet to come. Click here to know more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=530b56a3b30a850794ddf95cfa01567bd80920bbc98150dd469db15c7063ccf3"}
{"Ticker":"AMZN","Date":1641893400,"Headline":"Amazon One: The Future Of Contactless Payments","Source":"SeekingAlpha","Summary":"In 2020, Amazon introduced Amazon One, a convenient & secure way for somebody to pay or be identified with the palm of their hand. Read more on AMZN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5f7a14b0f6031a9bb4fd43132b0a2976c753b158f81821df966142d1a8408518"}
{"Ticker":"AMZN","Date":1641892450,"Headline":"Explainer-How Amazon's battle with Reliance for India retail supremacy became a legal jungle","Source":"Reuters","Summary":"For more than a year, Amazon.com Inc and India's Future Group have been locked in a complex legal stand-off that has stalled Future's $3.4 billion sale of assets to the U.S. firm's rival Reliance Industries - with no end in sight."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2fc09885a6b85ab01eabae106c57f77e590359b945448d119676b87f7fe47a76"}
{"Ticker":"AMZN","Date":1641891540,"Headline":"US STOCKS-Wall Street set to open higher ahead of Powell testimony","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Tuesday as investors picked up beaten-down stocks ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=661b5672aaec12bc7439b855c925a0ca07786aca2d4395a40e6f61014b337c38"}
{"Ticker":"AMZN","Date":1641889200,"Headline":"RIVN Stock Alert: Why Is Rivian Under Pressure Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55a68accc53d16b5d76344b25392b4aea579793b158ca09d9cda39cd283779be"}
{"Ticker":"AMZN","Date":1641888360,"Headline":"Federal Judge Steps Aside From High-Profile Amazon Case, Citing Financial Conflict ","Source":"DowJones","Summary":"U.S. District Judge Liam O’Grady had ruled in Amazon’s favor during the 20 months he oversaw a civil case involving the online retailer. He is among 136 judges for whom the WSJ has identified stock conflicts."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c1dbf25dba6dc29dd0a0a5b05505dfd3fed91be452b56ab0b036091a44ad7d9f"}
{"Ticker":"AMZN","Date":1641886980,"Headline":"Investing in This REIT Could Make You a Millionaire Retiree","Source":"Nasdaq","Summary":"All it takes is one advantageous investment to retire a millionaire thanks to the power of time and compounding interest. It's how investors who put $10,000 into Amazon a little less than 25 years ago would be sitting on over $21 million today."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1cc3b9c7b1a19704b497b9a2076e7071154713841693d1aea2f72f9ad7c843a"}
{"Ticker":"AMZN","Date":1641885540,"Headline":"US STOCKS-Futures rise ahead of Fed Chair Powell's testimony","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Tuesday as investors picked up beaten-down stocks ahead of Federal Reserve Chair Jerome Powell's testimony that may offer fresh insight on policy tightening and the central bank's plans to tackle inflation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d920ab73002864d9e1a50d729fa83281ea23cee41cfd2079072477bc2a7eaf5d"}
{"Ticker":"AMZN","Date":1641885000,"Headline":"Does Venmo's Amazon Partnership Make PayPal Unstoppable?","Source":"Nasdaq","Summary":"Digital payments behemoth PayPal Holdings (NASDAQ: PYPL) just inked a new partnership that can meaningfully propel the business going forward. Starting this year, Amazon (NASDAQ: AMZN) customers in the U.S. will be able to use Venmo at checkout. Having recently parted ways with e"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=553c03411eb9d36258f65175b29e2f638fd5f4a4a7fddf3506d12b639581b96e"}
{"Ticker":"AMZN","Date":1641884400,"Headline":"3 Unstoppable Stocks With More Potential Than Any Cryptocurrency","Source":"Nasdaq","Summary":"Many technology stocks have been hammered at the beginning of 2022, but the business is performing stronger than ever. Cryptocurrencies have also had a rough past few months, with Bitcoin (CRYPTO: BTC) falling more than 35% from its all-time high. With bargains popping up left an"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dd8ad298a587ff0bf75964eeb4fe55418e81ec466cc8bcf49960f0ce7b5f249"}
{"Ticker":"AMZN","Date":1641881700,"Headline":"Will Investors See a Tech Sector Market Top in 2022?","Source":"Nasdaq","Summary":"The tech sector is extremely broad. It is filled with trillion-dollar behemoths like Microsoft (NASDAQ: MSFT), legacy providers like IBM (NYSE: IBM), and fast-growing upstarts like Crowdstrike (NASDAQ: CRWD). It spans hardware, software, cybersecurity, financial technology, and m"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aadf7928707d36b2da8a985b1e48a1022a2a724fa7844604ab2b066147c246a2"}
{"Ticker":"AMZN","Date":1641870840,"Headline":"Worried About the Global Supply Chain Crisis? These 2 Stocks Can Keep Winning","Source":"Yahoo","Summary":"Global supply chain challenges continue to disrupt the operations of companies of all sizes and across nearly all industries.  In this segment of Backstage Pass, recorded on Dec. 15, Fool contributors Rachel Warren, Connor Allen, and Danny Vena discuss two stocks that can keep winning for investors in spite of the supply chain crisis.  Rachel Warren: CNN reported yesterday that much to my surprise, I don't know how you guys felt, but despite ongoing supply chain bottlenecks and shortages, holiday packages are actually moving on time."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f6d07d88638052f7f319d6c0d008af91554747c8a6be440649a23affe0e8a60b"}
{"Ticker":"AMZN","Date":1641870600,"Headline":"10 Things Will Define The Digital Transformation In 2022","Source":"SeekingAlpha","Summary":"Consumers are shopping more online for retail products – some 30 percent of them, according to the latest PYMNTS study."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dea48832fe876dfa054ba255ece49c55d1bcc8d013133b853fb061cef663ec54"}
{"Ticker":"AMZN","Date":1641863506,"Headline":"How Amazon's battle with Reliance for India retail supremacy became a legal jungle","Source":"Finnhub","Summary":"For more than a year,Amazon.com Inc and India's Future Group have beenlocked in a complex legal stand-off that has stalled Future's$3.4 billion sale of assets to the U.S. firm's rival... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a9da4a9a0c5347c92d37d109092a4c22d909a22788a3d07c74231bc4e7911e9a"}
{"Ticker":"AMZN","Date":1641862800,"Headline":"AWS Announces General Availability of Amazon EC2 Hpc6a Instances","Source":"Yahoo","Summary":"SEATTLE, January 11, 2022--New Amazon EC2 Hpc6a instances powered by AMD EPYC processors are purpose-built for HPC workloads and deliver up to 65% better price performance"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36399688b5bc22bc3d46496b7d133fe439c92479a5ca53f086dfbaf20216d053"}
{"Ticker":"AMZN","Date":1641862800,"Headline":"TPG, Goldman, Thoma Bravo Bet on Project44 at $2.4 Billion Value","Source":"Yahoo","Summary":"(Bloomberg) -- Project44, a startup that enables the world’s largest companies to track shipments across the global supply chain, reached a $2.4 billion valuation after raising $240 million in equity funding from an investor group led by TPG, Thoma Bravo and Goldman Sachs Group Inc.’s asset-management arm.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameDip Buyers Drive U.S. Stock Rebound After Sellof"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a30d288a4db54daaa72228dbd7eb6e76e38c4ceef940c61d89c95effb96cac4e"}
{"Ticker":"AMZN","Date":1641859800,"Headline":"Why Alibaba Is Falling In Hong Kong Today Even As Wider Market Is Up","Source":"Benzinga","Summary":"Shares of U.S.-listed Chinese tech companies traded mostly lower in Hong Kong on Tuesday, even as the benchmark Hang Seng Index recovered after a weak start.\nWhat’s Moving:..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d26c2a5a7e4a1412cad255ae47124491aff0be6c0ea1e4a790b8f67403e8f836"}
{"Ticker":"AMZN","Date":1641859371,"Headline":"Rivian manufactured 1,015 vehicles in 2021, says COO retired","Source":"Reuters","Summary":"Rivian Automotive Inc produced 1,015 vehicles by the end of 2021, the Amazon-backed electric pickup truck maker reported in a filing on Monday, in line with its lowered expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=13605a630757445ffec09bc6af2568f9f75440ba80c2bc1d224d275e4c490541"}
{"Ticker":"AMZN","Date":1642027095,"Headline":"Bridge Creek Capital Management LLC Buys Amazon. ...","Source":"Yahoo","Summary":"Investment company Bridge Creek Capital Management LLC (Current Portfolio) buys Amazon.com Inc, Teleflex Inc, Walmart Inc, Tesla Inc, The Hershey Co, sells Bank of New York Mellon Corp, Sylvamo Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Bridge Creek Capital Management LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4c713c235d8bd2423354605c31de3334fa7191aa361e4659bffef1b02f9e4087"}
{"Ticker":"AMZN","Date":1642027036,"Headline":"Amazon elevates cloud division cybersecurity chief to elite 'S-team'","Source":"Yahoo","Summary":"Amazon is consolidating its cybersecurity teams under one executive who will report directly to CEO Andy Jassy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55486814e19171b19bcdbeba9246ccd6382980e65663bf58ae8555f7a199a8ec"}
{"Ticker":"AMZN","Date":1642024320,"Headline":"Here's What Investors Need to Know About Amazon's Acquisition of MGM Studios","Source":"Yahoo","Summary":"With Amazon (NASDAQ: AMZN) set to close its acquisition of MGM Studios some time this year, how should investors respond to this latest of a long line of deals the tech\/entertainment\/e-commerce giant has made?  In this segment of Backstage Pass, recorded on Dec. 17, Fool.com contributors Rachel Warren, Toby Bordelon, and Jason Hall discuss.  Rachel Warren: This deal really excited me."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5439ec1f1651d9f318036dab3687c1a5134431ec986a1f073e8e154933e0429c"}
{"Ticker":"AMZN","Date":1642023507,"Headline":"‘This year you could see equity market vigilantes reining in the Fed’: Comerica CIO","Source":"Yahoo","Summary":"Comerica Wealth Management Chief Investment Officer John Lynch and Caravel Concepts CEO Michael Jones join Yahoo Finance Live to discuss the 2022 outlook for the market, the Fed, inflation, and interest rate hikes."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b7bc42785e8d1a5bdd2abe5e95c0977527e73f7001b4314f7e81cc035c61d6f8"}
{"Ticker":"AMZN","Date":1642021160,"Headline":"Retailers' digital transformations are moving from ‘scrappy to scale,' Salesforce VP explains","Source":"Yahoo","Summary":"Salesforce VP and GM of Retail Rob Garf joins Yahoo Finance Live to discuss the rise in buy now, pay later and how retailers are continuing to transform their business models with online and omnichannel offerings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7fe21de88457109b22303ffd3f2273ff5474236fb4ddbc95ca681e83ee74f1c2"}
{"Ticker":"AMZN","Date":1642016954,"Headline":"Microsoft Hires Key Apple Engineer to Work on Custom Chips","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp. lured away a veteran semiconductor designer from Apple Inc. as it looks to expand its own server-chips efforts, according to people with knowledge of the matter. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Starts to Consider Treating Covid Like the FluJ&J Vaccine Gets Additional Warning on Bleeding Side"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49cfd6e269330830547c952747668e3fa8be73f87bb84f880e8818cff8945227"}
{"Ticker":"AMZN","Date":1642016520,"Headline":"Why HubSpot Gained 66.3% in 2021","Source":"Nasdaq","Summary":"What happened\nShares of HubSpot (NYSE: HUBS) rose 66.3% during 2021, according to data from S&P Global Market Intelligence."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b4df45d5bb077a7fef288dcc2c474fc98060929024cd72f780d58f3da66dc3fa"}
{"Ticker":"AMZN","Date":1623173638,"Headline":"The Best Drone Stocks For Today — And The Future","Source":"Yahoo","Summary":"Drone stocks are on the rise as the military and commercial providers like Google’s parent Alphabet and Amazon invest in the rapidly expanding technology."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a8e98f95d4c79712303e5b52c7480cdd4c0a7c58bc59409ffbad66f247eca6a"}
{"Ticker":"AMZN","Date":1642014840,"Headline":"These Stocks Would Make Great Gifts","Source":"Nasdaq","Summary":"Whether for the holidays, a birthday, or another special occasion, stocks are increasingly being seen by investors of all ages as great and thoughtful gifts. In this segment of Backstage Pass, recorded on Dec. 17, Fool contributors Rachel Warren, Jason Hall, and Toby Bordelon dis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=198840ae0c5aac66f574a6cdd05dd6b931456962defdb5e10cb83498c4d28493"}
{"Ticker":"AMZN","Date":1642014165,"Headline":"3 Blue-Chip Bargains I Just Bought For My 401(k) And So Should You","Source":"SeekingAlpha","Summary":"Maxing out your retirement accounts is one of the smartest and most tax-efficient strategies you can use to retire in safety and splendor."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2cd5c9b1d5e04d35073adc08d7bf217dab78d83ab275b2ccb7cdb486e8cb2cd5"}
{"Ticker":"AMZN","Date":1642014060,"Headline":"Blue Whale’s Stephen Yiu ditches Amazon holding","Source":"DowJones","Summary":"Stephen Yiu, manager of the Blue Whale Growth fund, had held Amazon stock for four years"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a2b086a620a4df2e7d049beb9d9751718ea714b0848ad49054274cb02f8e951"}
{"Ticker":"AMZN","Date":1642012694,"Headline":"Town & Country Bank & Trust CO dba First Bankers T Buys Danaher Corp, iShares Core 1-5 ...","Source":"Yahoo","Summary":"Investment company Town & Country Bank & Trust CO dba First Bankers T (Current Portfolio) buys Danaher Corp, iShares Core 1-5 Year USD Bond ETF, American Tower Corp, Nike Inc, Pioneer Natural Resources Co, sells Starbucks Corp, Sempra Energy, Unilever PLC, VF Corp, International Business Machines Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Town & Country Bank & Trust CO dba First Bankers T."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8ec733614c94282a5a22251fb7f60435457ab61402d10feb83c2bf2d6c80171"}
{"Ticker":"AMZN","Date":1642012692,"Headline":"Heartwood Wealth Advisors LLC Buys SPDR Portfolio S&P 500 High Dividend ETF, iShares MSCI ...","Source":"Yahoo","Summary":"Investment company Heartwood Wealth Advisors LLC (Current Portfolio) buys SPDR Portfolio S&P 500 High Dividend ETF, iShares MSCI Brazil Small-Cap ETF, Truist Financial Corp, Evoqua Water Technologies Corp, Costco Wholesale Corp, sells Invesco S&P Ultra Dividend Revenue ETF, Invesco BulletShares 2021 Corporate Bond ETF, iShares MSCI Brazil ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Heartwood Wealth Advisors LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c4249935289e5a2081603637954b21d368be6681f953ee3f103d57452dad4e8"}
{"Ticker":"AMZN","Date":1642011253,"Headline":"Amazon must improve this if it wants the stock price to go up: analyst","Source":"Yahoo","Summary":"Amazon needs to be more transparent, says one long-time Wall Street analyst."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=619eb1e62a3cad9b99f16366c6d4478cd9d38aae3fe695cb2a9110027c5e643c"}
{"Ticker":"AMZN","Date":1642008708,"Headline":"Amazon com : Fresh debuts on annual list of top U.S. grocery stores","Source":"Finnhub","Summary":"The Retailer Preference Index also includes Amazon as the No. 1 grocery retailer for the second year in a row. For the second year in a row, the Retailer Preference... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8b573a6c878c3be04ff11f02dc1b8f33ec6ee5b9d82e4d360f99633a886cc9b2"}
{"Ticker":"AMZN","Date":1642002911,"Headline":"Shark Tank’s Kevin O’Leary thinks 2022 is the year of NFTs","Source":"Yahoo","Summary":"Shark Tank investor and crypto-convert Kevin O’Leary believes non fungible tokens will be bigger than bitcoin."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0213279793ff92a8b0006f9d3a0b0b48e2cf5fc319f197eb83e8cd5f84f02fef"}
{"Ticker":"AMZN","Date":1642001220,"Headline":"Coupang May Be Out of Favor, but It Isn’t Out for Long","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ec22b5df8142bff177d476fa17a2a702388d11fcfc78b53d1fe32ba4326d251"}
{"Ticker":"AMZN","Date":1642001101,"Headline":"Why grocery stores are struggling to fill empty shelves","Source":"Yahoo","Summary":"Yahoo Finance's Julie Hyman and Brian Sozzi discuss retailers' difficulty in getting food and supplies from warehouses due to a spike in Omicron cases and wintry weather in the Northeast."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7e5a8948ccd68e944e60d6f04fed0185e97aa5110da3b5fa170c5c9829638272"}
{"Ticker":"AMZN","Date":1642000097,"Headline":"Inflation: The U.S. has ‘one or two more months’ of high prints, economist says","Source":"Yahoo","Summary":"Tendayi Kapfidze, U.S. Bank chief economist, appears on Yahoo Finance Live to discuss a recent rise in inflation and rising prices for food, gasoline, and housing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c03b599b01cb032167a8f60c98b16b2cfd14b6b37f1af5b6841c59eca9417387"}
{"Ticker":"AMZN","Date":1641999600,"Headline":"Why C3.ai Is a Top Tech Stock to Watch in 2022","Source":"Yahoo","Summary":"CE.ai (NYSE: AI) is doing exciting things in the fast-growing artificial intelligence space, but its dependence on its biggest customer is a cause for concern.  In this Backstage Pass clip from \"The AI\/ML Show\" recorded on Jan. 5, Motley Fool contributors Toby Bordelon, Danny Vena, and Jose Najarro discuss why this risky play is one to watch.  Enterprise AI software right here, software so AI-as-a-service, I think that's the easiest, quickest way to think about them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f2b4f9c6ab18495430c15f740b8ce7131f7223109e62e1370ebaf413fc53a1bb"}
{"Ticker":"AMZN","Date":1641998286,"Headline":"Kohmann Bosshard Financial Services, LLC Buys Global X U.S. ...","Source":"Yahoo","Summary":"Investment company Kohmann Bosshard Financial Services, LLC (Current Portfolio) buys Global X U.S. Preferred ETF, SPDR Portfolio High Yield Bond ETF, Vanguard FTSE Developed Markets ETF, , Apple Inc, sells Xtrackers USD High Yield Corporate Bond ETF, Schwab US Aggregate Bond ETF, SPDR Portfolio Emerging Markets ETF, Bristol-Myers Squibb Co, Citizens & Northern Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Kohmann Bosshard Financial Service"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5a68364e17fae5db7b67d054f79bc8b6f61cf67cba618dd240d72f06e2b3483b"}
{"Ticker":"AMZN","Date":1641996604,"Headline":"The Upcoming Streaming Wars And Why Netflix Will Lose","Source":"SeekingAlpha","Summary":"Netflix has switched to being focused on its own content. NFLX is struggling to generate positive FCF. Read why we don't expect that to improve."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fbc36abd8a19c4d2b3a4678ee76070b1ed85d1c2718c1c5310aa21a9382a8686"}
{"Ticker":"AMZN","Date":1641993000,"Headline":"Best Metaverse Stocks To Buy Today? 4 For Your List","Source":"Nasdaq","Summary":"4 Top Metaverse Stocks To Watch TodayWhile stocks continue to see-saw this week, investors may want to consider looking at metaverse stocks. Accordingly, this area of the stock market today is becoming an increasingly relevant one. Rightfully so as the global pandemic continues t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ab100f0651335d6daed411f6574f2208e414c996f475b082e78bd56aecf99c7b"}
{"Ticker":"AMZN","Date":1641992465,"Headline":"Air AI Joins Amazon Activate for Startups Program, Receives First Batch of $11,500 of $101,500 in 2022 Amazon Credits","Source":"Finnhub","Summary":"“We’re excited to join the Amazon Activate for Startups program, which supports our mission of making commercial use of our AI platform seamless from launch to scale,” said Jeremy... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11fa8d51a8b4e47ea216f1c6fbacc30608aeead6639957bad6e7162076ed89da"}
{"Ticker":"AMZN","Date":1641991020,"Headline":"US STOCKS-Wall St inches up after in-line inflation data eases investor fears","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with megacap technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=744ab1c4ba5e3f04d8360a8f26260ee86c1e11ab5ec99f328d2c421502b59cb5"}
{"Ticker":"AMZN","Date":1641984780,"Headline":"Noteworthy ETF Inflows: ACWI, AAPL, AMZN, GOOG","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares MSCI ACWI ETF (Symbol: ACWI) where we have detected an approximate $336.7 million dollar inflow -- that's a 1.9% increase week over week in"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=90111990b0c37555eb29fb2ce4d1aa0e77499a3dfd07d4f988529ae245aac3bf"}
{"Ticker":"AMZN","Date":1641984420,"Headline":"EXCLUSIVE: Unusual Whales Creates 'Nancy Pelosi ETF' So You Can Track Her Trades","Source":"Benzinga","Summary":"Members of U.S. Congress are permitted to buy and sell stocks and options in public companies as long as they publicly disclose their trades. The rule has come under scrutiny..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0d4b2e7c9be28b7c1039ff064f903e7f51ebf796fc3314f73bcc06048ded81e"}
{"Ticker":"AMZN","Date":1641982440,"Headline":"Wall St rises as in-line inflation data calms nerves","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with big technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d84f0cad02ab8738f6ff4f8c26ddd8c1eb2d45dde9bf40ff37a82dd380bf4cf"}
{"Ticker":"AMZN","Date":1641979140,"Headline":"US STOCKS-Futures extend gains as inflation data meets estimates","Source":"Nasdaq","Summary":"U.S. stock index futures rose on Wednesday after largely in-line consumer prices data eased some concerns about faster-than-expected interest rate hikes, with big technology stocks leading the gains after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c30b87e09669cb0c94b6fa55bb069e6e4159584e83ebf5401af6b0c855047d37"}
{"Ticker":"AMZN","Date":1641979020,"Headline":"Should You Invest In Rivian in 2022?","Source":"Nasdaq","Summary":"Rivian (NASDAQ: RIVN) grabbed a lot of attention after its multibillion-dollar initial public offering (IPO) last year. Many investors saw Rivian's partnership with Amazon (NASDAQ: AMZN), under which it will deliver 100,000 electric delivery vans to the latter, as a key pillar of"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0739e12d49ef55ddb6c4eb5e50a4d2317efd1fc74d497bfa3e6f3d8b4aa288f1"}
{"Ticker":"AMZN","Date":1641978953,"Headline":"Roku Got Some Very Good News, Should You Buy?","Source":"SeekingAlpha","Summary":"Roku has two potential paths to profit: advertising and commissions. I am short-term bullish but long-term bearish. Read why I assign a neutral rating to ROKU."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4bd737c944778add6c42d1dc90dba15dfb7349a440b9a6baf3beb45115893474"}
{"Ticker":"AMZN","Date":1641978900,"Headline":"2 Market Crash-Ready REIT Stocks To Buy in 2022","Source":"Nasdaq","Summary":"Being able to withstand a market crash is no easy feat. Volatile economic conditions can sway consumer confidence and push the values of even the best companies low. But those moments are often the best opportunities to snag up shares in high-quality stocks that will bounce back"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a28672a0d170285cbcbb4c83b8015874429e754a5acb0f32a301a567051f7115"}
{"Ticker":"AMZN","Date":1641975000,"Headline":"3 Hot Robinhood Stocks to Buy for 2022","Source":"Nasdaq","Summary":"With more than 22.4 million funded accounts, Robinhood Markets' stock trading platform has helped introduce millions of people to the world of investing. The platform's users have been associated with explosive meme stocks like GameStop and AMC Entertainment and risky options pla"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=efd08fec46e450b144df5fc7ef40404089c5334172ac2134ca5e5406502a0487"}
{"Ticker":"AMZN","Date":1641971880,"Headline":"US STOCKS-Futures edge higher ahead of key U.S. inflation data","Source":"Nasdaq","Summary":"U.S. stock index futures edged higher on Wednesday, with investors bracing for consumer prices data that is expected to show an almost four-decade high in December, while big technology stocks bounced after a bruising selloff at the start of the year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88f02d641a81ffe2d34d9c63948bbb5966398d19b9244ad7c28fc0ed7235288e"}
{"Ticker":"AMZN","Date":1641971859,"Headline":"Wall Street Breakfast: Another 40-Year High?","Source":"SeekingAlpha","Summary":"Listen on the go! A daily podcast of Wall Street Breakfast will be available by 8:00 a.m. on Seeking Alpha, iTunes, Stitcher and Spotify."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b762045c7b3b0abd3d6a860724c129787d5e8e4be3dd005b19c3f31ea9809de9"}
{"Ticker":"AMZN","Date":1641967200,"Headline":"U.S. business fears never ending liability from 'take-home' COVID-19 lawsuits","Source":"Nasdaq","Summary":"As COVID-19 cases surge in the United States, businesses say they fear a California court ruling has increased the likelihood that companies will be sued for infections, even by people who are not employees or customers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=945e5dca81767eb65610a9644bb426a9e3883a7e142c544be3e5e3508512af4d"}
{"Ticker":"AMZN","Date":1641966720,"Headline":"2 Cryptocurrencies That Have Trounced Bitcoin and Shiba Inu During the Crypto Crash","Source":"Nasdaq","Summary":"Bitcoin (CRYPTO: BTC), the biggest cryptocurrency on the market, has bitten the dust so far in the new year. So has the best-performing digital token in 2021, Shiba Inu (CRYPTO: SHIB)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9d210cb8f9f2a0eb91ea65d6b4aff394149a6929b3f0fc7bcf6f5bf27f67f228"}
{"Ticker":"AMZN","Date":1641958320,"Headline":"What's Next For Target's Stock?","Source":"Nasdaq","Summary":"Target’s stock (NYSE: TGT), the second-largest discount chain in the U.S., has declined 3% over the last twenty-one trading days (one month) and currently stands near $231. It should be noted that the broader S&P500 returned an almost flat growth during the same perio"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7376245484012b31d249ccb7519c47897f43d45bc9f911b075bafd78118cc37f"}
{"Ticker":"AMZN","Date":1641951960,"Headline":"France's OVHcloud picks up speed in Q1, on track for 2022 targets","Source":"Nasdaq","Summary":"French cloud computing company OVHcloud reported on Wednesday a rise of 13.9% in its first-quarter revenue, and said it was on track to achieve its full-year objectives."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0b8f9e42cecf5d8c1e05f10fa15c812956cd99774ddde6362813d43557defe2"}
{"Ticker":"AMZN","Date":1642114310,"Headline":"Why Cloudflare Tanked by More Than 13% Today","Source":"Yahoo","Summary":"Shares of Cloudflare (NYSE: NET) fell 13.2% on Thursday, dropping the edge computing company's market cap to half of what it was at its all-time high in November.  Cloudflare is, however, still up by 27% over the last 12 months.  As for the tumble in recent months, Cloudflare is being beaten up along with other high-growth but richly valued stocks because the market is anticipating that interest rates will rise from their current rock-bottom levels this year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=987232c4c3d79bb7698704d0f3e0d4a3b39ed4f5e0d37d15c691c729df930e50"}
{"Ticker":"AMZN","Date":1642113486,"Headline":"Canandaigua National Corp Buys Amazon.com Inc, American Express Co, S&P Global Inc, Sells ...","Source":"Yahoo","Summary":"Investment company Canandaigua National Corp (Current Portfolio) buys Amazon.com Inc, American Express Co, S&P Global Inc, KKR Inc, Vanguard High Dividend Yield Indx ETF, sells PNC Financial Services Group Inc, Nasdaq Inc, Magnolia Oil & Gas Corp, ONEOK Inc, People's United Financial Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Canandaigua National Corp."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=597748e01e48d2ba3adf7f69a284f4d02476a64223eb7d01f512fb132f8506ea"}
{"Ticker":"AMZN","Date":1642110321,"Headline":"Why Omicron is a big risk in 2022","Source":"Yahoo","Summary":"Bianco Research LLC President Jim Bianco talks to Yahoo Finance's Jared Blikre about the impact the Omicron variant will have on the economy and DeFi in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcf2db77cb13a54c6a9569206bd7fb08349cdd068e58b3a15f3581b53047a92f"}
{"Ticker":"AMZN","Date":1642110298,"Headline":"Amazon is 'hunting three big whales in its retail business': analyst","Source":"Yahoo","Summary":"Evercore ISI analyst Mark Mahaney says Amazon has three huge opportunities to send revenue growth skyward."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa85d4d2c91051e027f80d2025db832bd455b9d7395df99ccf1a0591f5c6f6fb"}
{"Ticker":"AMZN","Date":1642107612,"Headline":"Netflix Needs New Subscribers. Its Korean Playbook Is Its Secret Weapon.","Source":"Yahoo","Summary":"(Bloomberg) -- It took “Squid Game” just four weeks this past fall to become the most-watched Netflix Inc. show ever released in any language. But when it comes to the streaming giant’s global ambitions, what happened afterward matters even more — viewers who devoured “Squid Game” started watching more shows in Korean.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test R"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a6d3a91e7f6759ff6d95af9855bda96ff5cc5ea3ac46a0e9f4b8534cff72a5aa"}
{"Ticker":"AMZN","Date":1642107540,"Headline":"Labor Secretary on Amazon union vote: Workers ‘should be able to organize without any interference’","Source":"Yahoo","Summary":"US Labor Secretary Marty Walsh voiced an indirect but resolute defense of worker organizing in response to a question about the re-vote in Bessemer, calling on all employers to refrain from interference with union drives at their workplaces."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d7ecef5474ffbd85943a01b27b42bf12ea81a4ed14e168027cf4ab20a6e8f12"}
{"Ticker":"AMZN","Date":1642106040,"Headline":"Why Amazon Stock Traded Lower on Thursday","Source":"Yahoo","Summary":"It wasn't just the down market that dragged the cloud computing giant lower. It may be losing share to a competitor."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9c49c39907612845fbd43989921c84eb2745d9e87040414b547a95bd0705e587"}
{"Ticker":"AMZN","Date":1642105133,"Headline":"Market check: Nasdaq poised to end three-day streak, tech and health care lag","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down the stock market latest and the sell-off in tech."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e72a88298405fb9115ac2c5731012499107fb979c5450644eb2a5baeec2658e"}
{"Ticker":"AMZN","Date":1642100207,"Headline":"Why Shares of Sea Limited Tanked 8% Today","Source":"Yahoo","Summary":"Shares of southeast Asia e-commerce and video game giant Sea Limited (NYSE: SE) were down 8% today as of 1:30 p.m. ET.  It deepens the sell-off the stock has suffered since October when Sea reached its all-time high.  Sea has been using its highly profitable video game segment (publisher Garena, responsible for the international hit Free Fire) to invest in its e-commerce app Shopee."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2de0cbda7d70e2cf4e397b6e83c9a0b4740af223775a7687a7552529979579a6"}
{"Ticker":"AMZN","Date":1642099104,"Headline":"Marotta Asset Management Buys General Dynamics Corp, iShares iBoxx USD Investment Grade ...","Source":"Yahoo","Summary":"Investment company Marotta Asset Management (Current Portfolio) buys General Dynamics Corp, iShares iBoxx USD Investment Grade Corporate Bond , Caterpillar Inc, Pfizer Inc, Deere, sells Generac Holdings Inc, Moderna Inc, Global X FTSE Nordic Region ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Marotta Asset Management."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54c37bc6f07cf9e610e1586a330ae413801ddc9744d343ae35644e3c41ee9cd5"}
{"Ticker":"AMZN","Date":1642099101,"Headline":"BlueSky Wealth Advisors, LLC Buys Schwab U.S. ...","Source":"Yahoo","Summary":"Investment company BlueSky Wealth Advisors, LLC (Current Portfolio) buys Schwab U.S. Large-Cap ETF, Vanguard Short-Term Corporate Bond ETF, Schwab US Aggregate Bond ETF, Schwab U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f16486a2ae727031b716e6c75f6d7498c7d68063907e1af1383a19626dc16f28"}
{"Ticker":"AMZN","Date":1642099099,"Headline":"McGuire Investment Group, LLC Buys SPDR Bloomberg 1-3 Month T-Bill ETF, WisdomTree Floating ...","Source":"Yahoo","Summary":"Investment company McGuire Investment Group, LLC (Current Portfolio) buys SPDR Bloomberg 1-3 Month T-Bill ETF, WisdomTree Floating Rate Treasury Fund, BTC iShares Floating Rate Bond ETF, SPDR Bloomberg Investment Grade Floating Rate ETF, Global X Genomics & Biotechnology ETF, sells Sangamo Therapeutics Inc, ARK Genomic Revolution ETF, Editas Medicine Inc, Boston Scientific Corp, United Rentals Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, M"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b972f130ffb2e7bb6240dc3bf12ce0053cf67a1c30ef4f2c733b25e03864830"}
{"Ticker":"AMZN","Date":1642099090,"Headline":"Burt Wealth Advisors Buys iShares MSCI Emerging Markets Asia Index Fund, WisdomTree Yield ...","Source":"Yahoo","Summary":"Rockville, MD, based Investment company Burt Wealth Advisors (Current Portfolio) buys iShares MSCI Emerging Markets Asia Index Fund, WisdomTree Yield Enhanced U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eb126347b2df7cca85a0d253cc4ce06bff7bed52c3853a5826dc16519c80db53"}
{"Ticker":"AMZN","Date":1642097832,"Headline":"Labor market may soon be flush with workers","Source":"Yahoo","Summary":"Our insatiable appetite to buy things, and our wants galloping past our needs, will eventually help loosen up the labor market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2855d17207d01f723296f7be572eb0b8d2282b36e9aa5c28ae710a2b7e924cb"}
{"Ticker":"AMZN","Date":1642096162,"Headline":"Earnings: ‘Margins are going to be under attack’ in Q1, strategist says","Source":"Yahoo","Summary":"John Hancock Investment Management Co-Chief Investment Strategist Matt Miskin joins Yahoo Finance Live’s Zack Guzman and Akiko Fujita to discuss inflation, supply chain disruptions, and the earnings growth outlook for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e6fb3c9fb3fbd5a792766b323d69f4ea8d91696305bc86e945aa1be879ceaef"}
{"Ticker":"AMZN","Date":1642096074,"Headline":"3 mega-cap tech stocks that will gain big as interest rates rise: analyst","Source":"Yahoo","Summary":"Shopping for some tech bargains ahead of the Federal Reserve's rate hikes? Try these on for size, says one veteran tech analyst."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=569765feba01b1a8d5da367ab5155adf45eef5ced093958a61b080de449f33cb"}
{"Ticker":"AMZN","Date":1642094381,"Headline":"Kohl's is 'another show-me story': analyst","Source":"Yahoo","Summary":"Kohl's has one big problem, said JPMorgan retail analyst Matt Boss."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3825679c14f6e12363f8f4c3d6df585528765158f176ae96967b1e9082e99e61"}
{"Ticker":"AMZN","Date":1642092011,"Headline":"Supreme Court vaccine mandate ruling won't bar companies from demanding Covid shots for workers — Biden vows to advocate for that","Source":"CNBC","Summary":"President Biden urged companies to voluntarily impose Covid vaccination rules on workers after the Supreme Court blocked a government order to do that."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02855b44c057214e24defd3ad2d6a77304657e1178951553d53f39e861729cea"}
{"Ticker":"AMZN","Date":1642090680,"Headline":"CES unable to confirm COVID-19 cases after 70 S.Korean nationals test positive","Source":"Nasdaq","Summary":"The organizer of CES, the world's largest technology show, said on Thursday it was unable to confirm the number of COVID-19 cases from its in-person event in Las Vegas last week after South Korean authorities said about 70 attendees from the country tested positive for the virus."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2a367b6367dc6154bce06f1d41beaaa08c5d95c486b81f4692a75ad6ee1f7ba"}
{"Ticker":"AMZN","Date":1642090320,"Headline":"4 Top Stock Trades for Friday: F, AVGO, NFLX, SPCE","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3da69d78528f848ea6342a0351f8fa4bbffca4df0a38d210eb8cba701bb05caf"}
{"Ticker":"AMZN","Date":1642089840,"Headline":"Amazon Is the Latest Fall of the Cloud Czars","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de9868bcd095950c7a02144d02b79bba93743db6b17bd0deaad4114ab18569f9"}
{"Ticker":"AMZN","Date":1642089180,"Headline":"Breakthrough Transplants Signal BIG Opportunity","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3b414f2b4b2ab564c5eac1af38b2282f7246d8bec2dd1878c246e536d9f0265c"}
{"Ticker":"AMZN","Date":1642088160,"Headline":"7 Great Growth Stocks to Add to Your January Buy List","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f23df77b73c518922c1b2cdac565e7fead86d415d709227c303a3d1dd4be695e"}
{"Ticker":"AMZN","Date":1642087283,"Headline":"Should Companies Approach the Buy Now, Pay Later Craze With Caution?","Source":"Yahoo","Summary":"The phenomenon of buy now, pay later technology has taken companies and consumers by storm, and the popularity of this method of paying for goods and services is only growing.  In this segment of Backstage Pass, recorded on Dec. 17, 2021, Fool contributors Jason Hall, Toby Bordelon, and Rachel Warren discuss.  Jason Hall: I think what I'm really worried about just to get to the core of it is, let's backup."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=332a6358d7d1a83aada4cb4f5e06d847c7e24f01f45878d1603d49d1d9ab19b3"}
{"Ticker":"AMZN","Date":1642085760,"Headline":"Cybertruck Production Delayed Yet Again? Removal Of Date From Configuration Page Set Tongues Wagging","Source":"Benzinga","Summary":"Tesla Inc.'s (NASDAQ: TSLA) much-awaited Cybertruck could be further delayed and there is limited visibility into the timeline for its production to begin.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b4e1a7770b4e413b7c26c62b5661cab9c0b1512de349b5c6d1541f433dd4682"}
{"Ticker":"AMZN","Date":1642079294,"Headline":"Amazon Vs. MercadoLibre Stock: Analyzing Their Key Drivers For 2022","Source":"SeekingAlpha","Summary":"Amazon and MercadoLibre have been impacted by headwinds relating to their supply chains. Read more for a discussion of their key catalysts in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2b13a4e1af73d1731a33c84abced86c9f743367114eca27cb5034749fff36d9"}
{"Ticker":"AMZN","Date":1642078477,"Headline":"DigitalOcean: The Decentralized Future Of Technological Innovation","Source":"SeekingAlpha","Summary":"DigitalOcean is a smart way to invest in the future of tech. The company's platform has seen solid growth due to consistent demand. See more on DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6e4e4fd7bada8d65259a19cc5a634c39f8fe1dc04ad4f4e27cfab126ce9da915"}
{"Ticker":"AMZN","Date":1642069200,"Headline":"What to Watch for in This Critical Earnings Season","Source":"Nasdaq","Summary":"This quarter, the top- and bottom-line results for the last three months carry more weight than any forward-looking statements."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=541091fe7b0f571508fb26db0828ce9c948d444f664b3f18e068e2f0a218d521"}
{"Ticker":"AMZN","Date":1642068780,"Headline":"British lawmakers target Visa and Mastercard fee increases","Source":"Nasdaq","Summary":"British lawmakers plan to scrutinise increases in the fees Visa and Mastercard charge businesses after the country's payments regulator found no evidence to justify the rises, a parliamentary committee said on Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a83d8a48136484fafbc5accedaee0c16cd26f13dbdc42e2aab3a7a2f96bcae88"}
{"Ticker":"AMZN","Date":1642067337,"Headline":"Top Stocks Not To Miss From Glassdoor's 2022 Rankings","Source":"SeekingAlpha","Summary":"Since 2009, Glassdoor has released a yearly ranking of the Best Places To Work. Glassdoor just revealed its 2022 ranking. See the top stocks from the rankings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75fc4555b24e4e1610d94a57bfe12fa6cacaacb09798029f1650d6eaea39d66c"}
{"Ticker":"AMZN","Date":1642064106,"Headline":"FedEx's Free Cash Flow Generation On The Mend, Shares Cheap","Source":"SeekingAlpha","Summary":"FedEx's free cash flow is on the up despite hefty capital expenditures. Read more to find out our estimated fair value of FDX stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9d3d3b19fd5f549227c40c72f02a5a0c953865b471e8caabca1033ed996c1761"}
{"Ticker":"AMZN","Date":1642063260,"Headline":"Analysts Anticipate QQEW Will Reach $137","Source":"Nasdaq","Summary":"Looking at the underlying holdings of the ETFs in our coverage universe at ETF Channel, we have compared the trading price of each holding against the average analyst 12-month forward target price, and computed the weighted average implied analyst target price for the ETF itsel"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f58f7b88500b77745554c76a92d3df4cad40d6662a991518eb9cdf0e14f21bc2"}
{"Ticker":"AMZN","Date":1642062600,"Headline":"Down 55% From Its High, Is UiPath Stock a Smart Buy?","Source":"Nasdaq","Summary":"UiPath (NYSE: PATH) is on a mission to fully automate the enterprise. To that end, its software platform helps clients build AI-powered bots capable of augmenting a human workforce by automating a variety of business processes. Since going public in April 2021, UiPath's share pri"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4b33bed1c70243e3440d0714ca04e4f0a80640633ac308491a5451a335f973b"}
{"Ticker":"AMZN","Date":1642062600,"Headline":"Dividend Harvesting Week 45 Update, $4,500 Allocated, $298.44 In Annual Dividends Yielding 6.25% Across 60 Positions","Source":"SeekingAlpha","Summary":"Even though 2021 was a strong year for the markets overall, some segments got decimated. Check out Dividend Harvesting for week 45 and my game plan for week 46."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d614f381216d8d40a8755032fbd6ac8d73b317e559e39f06d0b7d042daa81374"}
{"Ticker":"AMZN","Date":1642060020,"Headline":"10 Best Stocks to Buy on the Nasdaq Right Now","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=672305cc27e23c02e77618b6f63164e50d0aa0c83aaec25d2dde137f5f293d38"}
{"Ticker":"AMZN","Date":1642059180,"Headline":"US STOCKS-Futures muted ahead of data; Delta Air rises on strong earnings","Source":"Nasdaq","Summary":"U.S. stock index futures were muted on Thursday ahead of jobless claims data and fresh inflation figures that are expected to give more cues on the Federal Reserve's tightening policy, while Delta Air Lines led gains among carriers on strong earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2ada7d2bbc3c3c06d8fb802f0e1207915990089e8931fe7d99ebf16da29be555"}
{"Ticker":"AMZN","Date":1642057500,"Headline":"Better Buy: Microsoft vs. Alphabet","Source":"Nasdaq","Summary":"Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) were two of the best-performing tech stocks of 2021. Over the past 12 months, Microsoft's stock price rallied 45% as Alphabet's stock advanced 59%. Both stocks easily beat the S&P 500's 24% gain."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4acf705aea255053b0cee6c3395d3225243d500d74c6a1eb9af9e44deeaf5e69"}
{"Ticker":"AMZN","Date":1642054800,"Headline":"Should iShares Core S&P 500 ETF (IVV) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Launched on 05\/15\/2000, the iShares Core S&P 500 ETF (IVV) is a passively managed exchange traded fund designed to provide a broad exposure to the Large Cap Blend segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a67408a80af951132ba5367663faced8bd1a891119f007a63d4c7128f0c0dbfa"}
{"Ticker":"AMZN","Date":1642054800,"Headline":"Should iShares Russell 1000 Growth ETF (IWF) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"The iShares Russell 1000 Growth ETF (IWF) was launched on 05\/22\/2000, and is a passively managed exchange traded fund designed to offer broad exposure to the Large Cap Growth segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00ed019768ac0b589123953b6f6a18ea2847f25c6fd4ca7a017eb17218c75f74"}
{"Ticker":"AMZN","Date":1642054800,"Headline":"Should Vanguard Mega Cap ETF (MGC) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Launched on 12\/17\/2007, the Vanguard Mega Cap ETF (MGC) is a passively managed exchange traded fund designed to provide a broad exposure to the Large Cap Blend segment of the US equity market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=01ac4afe9c29f13f6f23cfe98ac99fa8daab33d9beeadc1211bcbc9ea636ec72"}
{"Ticker":"AMZN","Date":1642051800,"Headline":"3 Investments You'll Thank Yourself for by the End of 2022","Source":"Nasdaq","Summary":"As we continue into the new year, it's the perfect opportunity to reevaluate your portfolio and consider adding some new investments."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b935d36ce66a019ef414cf67aad62b267c5e22b7a9df92aca3432471b4a8b30"}
{"Ticker":"AMZN","Date":1642050000,"Headline":"White House will meet execs from Apple, Amazon, IBM to discuss software security","Source":"Nasdaq","Summary":"The White House will meet executives from leading tech firms, including Alphabet-owned Google, Apple Inc and Amazon.com Inc, on Thursday to discuss software security after the United States suffered several major cyberattacks last year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6ab3c8d81d9ea231e65c5d82a97d5c00c5b1c8f27ed67c6be83517031bd39501"}
{"Ticker":"AMZN","Date":1642044775,"Headline":"Finally, I Found Alpha In 2021","Source":"SeekingAlpha","Summary":"Finding alpha regularly is not easy. Read this article to know how my portfolio performed in 2021 and check out my plans for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=450786c52f5f27ee9f1f8943fe754036a0667f53adadc9e4d26ed317c9d198c9"}
{"Ticker":"AMZN","Date":1642041483,"Headline":"Mountain Capital Investment Advisors, Inc Buys BTC iShares MSCI EAFE Value ETF, BTC iShares ...","Source":"Yahoo","Summary":"Investment company Mountain Capital Investment Advisors, Inc (Current Portfolio) buys BTC iShares MSCI EAFE Value ETF, BTC iShares MSCI EAFE Growth ETF, Invesco S&P 500 Equal Weight ETF, iShares MSCI EM ESG Select ETF, Amazon.com Inc, sells Schwab International Equity ETF, iShares Core S&P 500 ETF, iShares Core Total USD Bond Market ETF, BTC iShares U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6bb0f9ac26fd62b7b2a4fdd08a53b423adeadee491987a37a9dd632c2fffb0a8"}
{"Ticker":"AMZN","Date":1642034571,"Headline":"Why HubSpot Gained 66.3% in 2021","Source":"Yahoo","Summary":"Despite its co-founder and CEO stepping back, the \"inbound\" marketing software provider expanded its product set and posted accelerating growth."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61d63d99d2af92ba106120a76ad6c0189f128bb7cb674736fc5861fcbb2ae94b"}
{"Ticker":"AMZN","Date":1642032852,"Headline":"These Stocks Would Make Great Gifts","Source":"Yahoo","Summary":"Whether for the holidays, a birthday, or another special occasion, stocks are increasingly being seen by investors of all ages as great and thoughtful gifts.  In this segment of Backstage Pass, recorded on Dec. 17, Fool contributors Rachel Warren, Jason Hall, and Toby Bordelon discuss the trend of gifting stocks.  Rachel Warren: For me, I also picked two of my favorite companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f6bec2a330c0ccf808fce4f0433d9a554ea42719a22d710d5a5186dff5e94d56"}
{"Ticker":"AMZN","Date":1642032091,"Headline":"Facebook and Twitter failing to tackle fake review factories, says Which?","Source":"Yahoo","Summary":"The fake review industry uses Facebook and Twitter to find people to give five-star ratings to mediocre products sold on Amazon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55f267744bd71256b1570c83a54c09d78c5d478ebc76abed0c6eeb89371f4133"}
{"Ticker":"AMZN","Date":1642200860,"Headline":"Why DigitalOcean Stock Tanked 9% Today","Source":"Yahoo","Summary":"Was it the threat of Amazon's spending spree, rising interest rates, or just a good old-fashioned irrational crash?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd07cfabb8b6e3a9f77808981dbebe8ae7c6d15db95b7ec592f0f439627e5d70"}
{"Ticker":"AMZN","Date":1642198147,"Headline":"'Scream' hits theaters, Netflix raises prices","Source":"Yahoo","Summary":"Yahoo Finance's Allie Canal details the opening box office numbers for the theatrical release of \"Scream\", the success of hybrid theatrical-streaming movie releases, and Netflix raising its prices for subscribers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b74e656f9aebab853d84da789647bdb40bb62959a41dc9d57b9250ab1f6319c7"}
{"Ticker":"AMZN","Date":1642195020,"Headline":"Crypto job openings surge 395% in a year, with Miami, Austin and Denver emerging as new hubs","Source":"Yahoo","Summary":"Crypto-related job postings in the U.S. surged 395% in 2021 from a year before, a sign of the industry's expansion, according to a recent analysis by LinkedIn."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bddf033e73c34cca465abb921ed7928a93b612b30a3e642b77e4de1565238392"}
{"Ticker":"AMZN","Date":1642189368,"Headline":"E-Commerce Startup Bolt Nearly Doubles Valuation to $11 Billion","Source":"Yahoo","Summary":"(Bloomberg) -- Bolt Financial Inc., a startup that makes online shopping tools used by Forever 21 and other retailers, raised funds valuing the business at $11 billion, a person familiar with the terms said.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingDjokovic’s Australian Visa Canceled Again"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=087f63a7f2f00d4ae6b3580ebefd86071cfa0ed6cd4f60d287808154a0fab914"}
{"Ticker":"AMZN","Date":1642189363,"Headline":"TBJ Plus: Raleigh rates high for friendliness; Shortages slam Chapel Hill's Sutton's; Girl Scout cookies ahead","Source":"Yahoo","Summary":"RALEIGH RATES HIGH FOR FRIENDLINESS: If you feel like Raleigh is a friendly place to live, you're not alone.  All donated books will be provided to children in Durham and beyond through Book Harvest’s book access and literacy initiatives."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ef7dcadb8fbd6362b63f7d9953cd64180c57ac2c5a8151f257bf325310ee0a06"}
{"Ticker":"AMZN","Date":1642185485,"Headline":"HighTower Trust Services, LTA Buys Amazon. ...","Source":"Yahoo","Summary":"Investment company HighTower Trust Services, LTA (Current Portfolio) buys Amazon.com Inc, iShares Core S&P 500 ETF, Netflix Inc, American Tower Corp, Masimo Corp, sells Raytheon Technologies Corp, Upland Software Inc, Verizon Communications Inc, The Walt Disney Co, Schlumberger during the 3-months ended 2021Q4, according to the most recent filings of the investment company, HighTower Trust Services, LTA."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8f5b10f0bffd9a784534c60e7a29fd0ad68fbe1a234bc090963b774831b6311e"}
{"Ticker":"AMZN","Date":1642182660,"Headline":"Since Blasting Off With Branson, Virgin Galactic Stock Is a Disappointment","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f71437a1b410cc0bee0168f33e6cdf01a5f69e7a9b075861de6caf9a7ddac90"}
{"Ticker":"AMZN","Date":1642181254,"Headline":"Market check: Stocks choppy in intraday trading, tech stocks turn green","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down how stocks are trading on Friday afternoon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5f9a6e9eccfd68ac739a7dad7698de79c8c371b89443061916996c91400bb4f"}
{"Ticker":"AMZN","Date":1642179932,"Headline":"Data-driven digital business is ‘in its first chapter,’ NetApp CEO says","Source":"Yahoo","Summary":"NetApp CEO George Kurian joins Yahoo Finance’s Akiko Fujita and Brian Sozzi to discuss the outlook on cloud computing, chip supply disruptions, and digital transformations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a11c3f3dcbcee0acc579dbd8a62936cf531203bc51efee8579a0cd17f225c720"}
{"Ticker":"AMZN","Date":1642177800,"Headline":"Should You Buy Chewy Stock Before It Goes Back Up?","Source":"Yahoo","Summary":"Chewy (NYSE: CHWY) stock experienced massive growth as the company drove online sales for pet supplies in 2020.  Given the discounted stock price, its current value proposition deserves a closer look.  Chewy may not appear to offer a significant competitive advantage at first glance."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6845dd017ad36e2a19abc1ecf293af2832f264d661690b1ac110d87a299f56ee"}
{"Ticker":"AMZN","Date":1642176540,"Headline":"Amazon Stock Could Return 20% Annually Based on Analyst FCF Forecasts","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=343f64932d486c543ed696c39d1d7be1f441e8b05f2a1ffc2b7d9097179ed273"}
{"Ticker":"AMZN","Date":1642174440,"Headline":"Netflix raises monthly subscription prices in U.S., Canada","Source":"Nasdaq","Summary":"Netflix Inc has raised its monthly subscription price by $1 to $2 per month in the United States depending on the plan, the company said on Friday, to help pay for new programming to compete in the crowded streaming TV market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bd6318fed463c25ff4323426a6aa872f627f041f85d4c9f370f2f95c8aed1ad1"}
{"Ticker":"AMZN","Date":1642172400,"Headline":"EXCLUSIVE-Netflix raises monthly subscription prices in U.S., Canada","Source":"Nasdaq","Summary":"Netflix Inc has raised its monthly subscription price by $1 to $2 per month in the United States depending on the plan, the company said on Friday, to help pay for new programming to compete in the crowded streaming TV market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c4fbb6a24a2c0232375eba0e87e2e56f20fb499372ffad343c18bb800e7e58fa"}
{"Ticker":"AMZN","Date":1642171091,"Headline":"Access Financial Services, Inc. Buys BTC iShares U.S. ...","Source":"Yahoo","Summary":"Investment company Access Financial Services, Inc. (Current Portfolio) buys BTC iShares U.S. Treasury Bond ETF, Communication Services Select Sector SPDR Fund, COHEN & STEERS TAX-ADV PRD SEC AND INC, BlackRock Science and Technology Trust II, Discover Financial Services, sells iShares 3-7 Year Treasury Bond ETF, Amazon.com Inc, Vanguard Communication Services ETF, Tesla Inc, Leidos Holdings Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Acce"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=04125d0faac0ba2965d6f184ed0b9629a126a50ec07861415c05d26719b30062"}
{"Ticker":"AMZN","Date":1642171088,"Headline":"BKD Wealth Advisors, LLC Buys PIMCO Enhanced Short Maturity Active Exchange-Trad, Kimball ...","Source":"Yahoo","Summary":"Springfield, MO, based Investment company BKD Wealth Advisors, LLC (Current Portfolio) buys PIMCO Enhanced Short Maturity Active Exchange-Trad, Kimball Electronics Inc, Amazon.com Inc, MetLife Inc, JPMorgan Ultra-Short Municipal Income ETF, sells Unum Group, Nuveen Tax-advantaged Dividend Gr Fund, iShares iBonds Dec 2021 Term Corporate ETF, AstraZeneca PLC, BP PLC during the 3-months ended 2021Q4, according to the most recent filings of the investment company, BKD Wealth Advisors, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b38c5d0f93c67217e0ff4c92b3851f8a202913d4229e2dff92e2a5390234001"}
{"Ticker":"AMZN","Date":1642168860,"Headline":"\"The Matrix\" co-producer Village Roadshow considering strategic options - WSJ","Source":"Nasdaq","Summary":"Village Roadshow Entertainment Group, which has co-produced 'Joker' and 'The Matrix', is considering taking on an investor or selling itself, the Wall Street Journal reported on Friday, citing sources familiar with the matter."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00ad016aa9e3338f509262829425f2a3ff2c880202cf4cae0fc4ab2012e569f2"}
{"Ticker":"AMZN","Date":1642168680,"Headline":"2 Stocks I Bought for 2022","Source":"Yahoo","Summary":"The valuations of these two companies have slumped, but I believe in the resilience of their businesses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f6da07fe4ab1886c0d6ab8e91b3fd825d6d192c5956ff807a9751537b5ff2dbf"}
{"Ticker":"AMZN","Date":1642167000,"Headline":"Amazon's Big Plan to Win the Labor War","Source":"Yahoo","Summary":"In this segment of \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Fool contributor Brian Withers discusses Amazon's (NASDAQ: AMZN) two new employment programs to help recruit talent.  Brian Withers: I am going to jump into a little company called Amazon, you might have heard of it.  Amazon had a news release in late December that announced that more than 2,000 jobs, we're going to be added to the Austin area in a tech center, over the next several years."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9fed4622b5cda040881a39be7b1b5ce7297f19615be5d5a38825359c96dc2325"}
{"Ticker":"AMZN","Date":1642166101,"Headline":"DXC to Help Lloyd's & London Market to Digitalize Process","Source":"Yahoo","Summary":"DXC Technology (DXC) is set to modernize the information technology infrastructure of Lloyd's of London, reflecting the reliability of the company's cloud solutions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7232edf460ca7a3370d0bcda1b8efc73a943468d2c88eb36e584e2fa1ce10dfe"}
{"Ticker":"AMZN","Date":1642163760,"Headline":"Prediction: Amazon Stock Will Be Worth More Than Apple in 10 Years","Source":"Yahoo","Summary":"Most people think of Amazon (NASDAQ: AMZN) as an e-commerce company, and for good reason.  It has become the online marketplace of choice for millions of consumers around the world.  In this Backstage Pass video, recorded on Jan. 4, Motley Fool contributor Trevor Jennewine explains why Amazon could surpass Apple (NASDAQ: AAPL) as the world's most valuable company in 10 years' time."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53b3e1bbdf71afeb71b37d58603007f52d6bc256bf92be00eed2e005801cab74"}
{"Ticker":"AMZN","Date":1642163460,"Headline":"US STOCKS-Wall St dragged down by financials after mixed results from big banks","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4223986daabcf67d0adef3c218460e3c5c4cfac8dfd3b63e451cc3bb8296e7d6"}
{"Ticker":"AMZN","Date":1642163186,"Headline":"Closed-End Funds: A Look At 2021, And Looking Forward To 2022","Source":"SeekingAlpha","Summary":"The market can continue to run higher, though I would temper expectations for the year. Read more to find out why I'm cautiously optimistic heading into 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d43263fc71c940f326b02eddeb9f475822cfe34ea6c6e86f6b835f211a641f24"}
{"Ticker":"AMZN","Date":1642162800,"Headline":"Amazon Stock: What to Expect in 2022 and Beyond","Source":"Yahoo","Summary":"From short-term headwinds to satellite constellations, what is happening with Amazon in the new year?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cd9a8735be70666c0248e5ce30c384c5ef8b555b3a5a966608fcdef7534499e0"}
{"Ticker":"AMZN","Date":1642161060,"Headline":"FOCUS-Burned by COVID supply crunch, hospitals invest in U.S. mask-making","Source":"Nasdaq","Summary":"Two days before Christmas, a cargo ship left Mumbai with a mask-making machine bound for Illinois-based OSF HealthCare, which will use the equipment to make its own N95 masks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6da36b3a76cb8df0d721ae593a3b39cf5a1af6790d4c291d47f7750fa8983dd9"}
{"Ticker":"AMZN","Date":1642160040,"Headline":"3 Popular ESG Indexes and How to Invest in Them","Source":"Nasdaq","Summary":"Here’s a look at three ESG indexes (based on the prominent parent indexes) and the ways to invest in them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cec46e63c16bf5065a8b188d6144ec2f913ce6362f996502530a91a2783dca34"}
{"Ticker":"AMZN","Date":1642159260,"Headline":"3 Cheap Stocks to Buy Right Now","Source":"Yahoo","Summary":"Pinterest has been under significant pressure lately, as you can see in the chart above.  Since peaking in early 2021, not only has there been a notable rotation out of high-growth technology stocks, but Pinterest's user base has actually declined a bit in recent quarters.  First, Pinterest's user decline is likely a temporary headwind caused by the gradual lifting of COVID-19 restrictions rather than any problem with the business itself."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d77ede2a749df48034b5ca56a45cf5c73c30eacc0cfc8cf9cd4692845b02d79a"}
{"Ticker":"AMZN","Date":1642159015,"Headline":"U.S. holiday sales endure supply chain, Omicron snags to hit $887 billion - NRF","Source":"Finnhub","Summary":"U.S. holiday sales hit a record $886.7 billion in 2021, data from a trade body showed on Friday, as people rushed to buy gifts online and in stores amid a jump in COVID-19 cases and supply chain... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f2b4c257d47c5ee0da07bfe88c076a92a993578d99dd8a344a3825fce404ddf"}
{"Ticker":"AMZN","Date":1642157194,"Headline":"TINA Was Wrong, Cash Is Not Trash, And There Is An Alternative","Source":"SeekingAlpha","Summary":"Despite high rates of inflation, recent CPI readings register a 7.0% inflation rate, many stock prices have deteriorated faster than cash prices. See more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=275cbeb7c370c77bb3a0b3caa6e4e2f66d626e6ad8d9d3de4124805d99c278af"}
{"Ticker":"AMZN","Date":1642157100,"Headline":"3 Reasons to Dip Into Crypto in 2022 -- and 2 Reasons Not To","Source":"Yahoo","Summary":"Cryptocurrency can gain and lose value on the ebbs and flows of investor demand alone.  The list of companies that accept Bitcoin and other cryptocurrencies is growing.  Early adopters Microsoft, Overstock.com, and e-commerce company Rakuten have accepted Bitcoin for years."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a93bfb63a2f67dfa0291cbf190a15a7ea174f75a4548384b9e66372f8a357bc0"}
{"Ticker":"AMZN","Date":1642156440,"Headline":"US STOCKS-Dow, S&P 500 dragged down by financials after mixed big bank results","Source":"Nasdaq","Summary":"The Dow and the S&P 500 fell on Friday as declines among heavyweight financial stocks led by JPMorgan made for a weak start to the fourth-quarter earnings season, while the Nasdaq edged higher as some big technology stocks regained lost ground."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e23ce4228749fa9074148da7f0e488027a65a4003a84f74adbe35051f2275a31"}
{"Ticker":"AMZN","Date":1642154686,"Headline":"Live Sports Key to Apple Streaming Success: Wedbush","Source":"Yahoo","Summary":"By Sam Boughedda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=321f5ddaf6915120f609730e7f32c778dc137d9e8585dffd1294032953c702c4"}
{"Ticker":"AMZN","Date":1642152600,"Headline":"Stock Market News for Jan 14, 2022","Source":"Nasdaq","Summary":"U.S. stocks closed sharply lower, led by a huge selloff in tech stocks as the Nasdaq snapped its three-day winning streak after rising interest rate worries once again dented investors’ spirits. All the three major indexes ended in negative territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcfdb59abe8c7eed5ab00b7aad645dd7ef4a57ef29a8f678e14318cdd0be6f84"}
{"Ticker":"AMZN","Date":1642150500,"Headline":"US STOCKS-Wall St set to open lower after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index were set to open lower on Friday as JPMorgan, Wells Fargo and Citigroup kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5e41ac8202a323992448e8880807bc49831cafb5c88840486f39ab24d6684c7"}
{"Ticker":"AMZN","Date":1642150222,"Headline":"Spotify: Content King In Audio Streaming","Source":"SeekingAlpha","Summary":"Spotify is down roughly 40% from all-time highs set in February of last year. This drawdown has allowed for valuations to normalize, in my opinion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f98ae9d1cb74cdff60f58c6069bd5bb165f8053960086ea5bb4525890f3d184"}
{"Ticker":"AMZN","Date":1642147800,"Headline":"Indian electric van maker for Amazon raises funds","Source":"Yahoo","Summary":"Indian start-up EVage, which is building electric delivery vans for e-commerce and logistics companies including Amazon.com Inc, has raised $28 million from U.S.-based venture capital firm RedBlue Capital, the company said on Friday.  The seed money will help EVage complete its factory in northern India and begin delivery of \"thousands of vehicles\" that are on order, Inderveer Singh, the company's founder and chief executive told Reuters.  Singh did not comment on the number of orders but said it has been working with companies, including Amazon, to design and test its one-tonne electric van which it will launch this year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=011940e17b65144451f49571cf7fb4af3fa52a14d1915f48aa8f0ca602034230"}
{"Ticker":"AMZN","Date":1642146210,"Headline":"Futures slip after mixed results from big banks","Source":"Finnhub","Summary":"U.S. stock index futures edged lower on Friday as big lenders including JPMorgan and Wells Fargo kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=530770a4fafe5c438577502cfe928c40736402882172449776af180900e7f790"}
{"Ticker":"AMZN","Date":1642146060,"Headline":"US STOCKS-Futures slip after mixed results from big banks","Source":"Nasdaq","Summary":"U.S. stock index futures edged lower on Friday as big lenders including JPMorgan and Wells Fargo kicked off the fourth-quarter earnings season with a mixed batch of results, while big technology companies extended declines after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=91515945fb98c6925752ebd7554642870c8daccfd5146a79dcbf26654cda1df4"}
{"Ticker":"AMZN","Date":1642145459,"Headline":"Shopify Really Needs A+ Execution","Source":"SeekingAlpha","Summary":"I recently bought some Shopify stock on the dip, only to sell it a few days later. I'm neutral on SHOP, arguing that it could rise more, but that it will take truly stellar execution."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=690a45476f9317ae106f4393cb49f8089743be3dea7f8457a05e336ff5d4e755"}
{"Ticker":"AMZN","Date":1642141200,"Headline":"Should Invesco QQQ (QQQ) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"Looking for broad exposure to the Large Cap Growth segment of the US equity market? You should consider the Invesco QQQ (QQQ), a passively managed exchange traded fund launched on 03\/10\/1999."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6daa391b851ccfed640c101a71e93541f7370c3dc56828e953ecc37df6d5d11d"}
{"Ticker":"AMZN","Date":1642141200,"Headline":"Should You Invest in the Vanguard Consumer Discretionary ETF (VCR)?","Source":"Nasdaq","Summary":"Looking for broad exposure to the Consumer Discretionary - Broad segment of the equity market? You should consider the Vanguard Consumer Discretionary ETF (VCR), a passively managed exchange traded fund launched on 01\/26\/2004."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=862ce9c3d0fa0833d02d217adbb0b43f1e0693a87e17b3003aca5abfbdbc6532"}
{"Ticker":"AMZN","Date":1642130695,"Headline":"Amazon Brand Startup Thrasio Launches $500 Million India Push","Source":"Yahoo","Summary":"(Bloomberg) -- Thrasio Holdings Inc., an aggregator of private brands on Amazon.com Inc., is setting aside more than $500 million for an expansion in India to target one of the world’s fastest-growing e-commerce markets.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersShould I Be Wearing an N95 o"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ac81a3b2a1c65999dc97c31a03d96e2298cdf6daaee2186d32fc864642389661"}
{"Ticker":"AMZN","Date":1642256100,"Headline":"My Top Fintech Stock to Buy in 2022","Source":"Yahoo","Summary":"Last year, shares of fintech giant PayPal Holdings (NASDAQ: PYPL) fell as investors weren't pleased with the company's decelerating revenue growth.  The market is accustomed to PayPal delivering higher growth rates than that, which explains why some investors aren't too optimistic about the company right now.  In 2020, PayPal's business experienced abnormal growth as customers shifted their habits at the onset of the pandemic."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ecfb7a3fdf93a01e28bdf2849f7e432cb4d35cff7c0eee540cf123ff714a430"}
{"Ticker":"AMZN","Date":1642256100,"Headline":"The AI Stock That Should Be High on Your 2022 Watch List","Source":"Yahoo","Summary":"In this segment from Motley Fool Live, recorded on Jan. 6, Fool contributor Jason Hall examines Stem (NYSE: STEM), a software company that is the market leader in smart energy storage.  Jason Hall: Stem is a really interesting company that's right at the forefront of the transition in the energy industry away from fossil fuels.  This is a software company."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e59d90c4dec68dc2f7ed52dcf672f1ad6ef4382337be9df2dd4db118a6ed125d"}
{"Ticker":"AMZN","Date":1642254600,"Headline":"Apple to require employee proof of COVID-19 booster -The Verge","Source":"Nasdaq","Summary":"Apple Inc will require retail and corporate employees to provide proof of a COVID-19 booster shot, The Verge reported on Saturday, citing an internal email."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d4a8888c954dc93691ed6e6f7581121da0185a933d0bea20f345c922e160b080"}
{"Ticker":"AMZN","Date":1642254300,"Headline":"2 Top Tech Stocks to Buy for the Long Haul","Source":"Yahoo","Summary":"Technological innovation continues to influence how we live, from how we watch television to remote work.  A lot has changed globally over the past few decades, and long-term stock winners like Amazon and Netflix have used these tailwinds to reach great heights on the market.  Looking ahead for the next big winners, Coupang (NYSE: CPNG) and Autodesk (NASDAQ: ADSK) are two top technology stocks to buy for the long haul as they ride their own tides of change."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4aac47b4511e642b724404077421240be2af876330f326b76843be785be5a0fd"}
{"Ticker":"AMZN","Date":1642253520,"Headline":"Better Buy Now: Lucid Up 20% or Rivian Down 20%?","Source":"Yahoo","Summary":"Electric-vehicle (EV) newcomers Lucid Group (NASDAQ: LCID) and Rivian Automotive (NASDAQ: RIVN) captured headlines in 2021 after both companies went public, began delivering vehicles, and set bold plans for 2022.  Less than two weeks into the new year, Lucid's shares have already gained around 20%, while Rivian stock has fallen 20%.  Daniel Foelber (Lucid Group): Lucid hasn't released any major announcements this year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a4535d657c62a940584d1f1007a0b119757cabcc3d4ac95e9902fd1c15d10967"}
{"Ticker":"AMZN","Date":1642252500,"Headline":"Should You Invest in the Metaverse or Is This an Overhyped Buzzword to Avoid?","Source":"Yahoo","Summary":"According to semiconductor company Nvidia (NASDAQ: NVDA), \"The metaverse is a shared virtual 3D world, or worlds, that are interactive, immersive, and collaborative.\"  Jon Quast: Everybody's favorite buzzword -- especially if you're a public company -- and that is \"the metaverse.\"  At the Consumer Electronics Show again, many companies are debuting new products that are designed to be more in the augmented reality, the virtual reality headsets."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c28e6be6ca516be769b977b257d4946cb1d2f80413585ab24d2da71d0cfcdc5f"}
{"Ticker":"AMZN","Date":1642250700,"Headline":"Buy This Stock, Not That One: 2022 Edition","Source":"Yahoo","Summary":"While this has caused some angst among investors holding stock in these companies, its also created situations where there are some high-quality stocks now available at attractive prices.  The metaverse, where the internet and the physical world come together, is potentially a massive opportunity for the next decade and beyond.  CEO Mark Zuckerberg has made it clear that Meta will be investing billions of dollars over the coming years to develop its metaverse business."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c42d191d6bcb6b44596c3d1daf5cf75e54cba784888ea7aa63c153e0cb288ee"}
{"Ticker":"AMZN","Date":1642249800,"Headline":"Is This Tech Stock the Square of Cloud Computing?","Source":"Yahoo","Summary":"In this segment of Motley Fool Live, recorded on Jan. 6, Fool contributor Trevor Jennewine explores how DigitalOcean (NYSE: DOCN) has been able to gain some significant traction in the crowded cloud computing space.  Trevor Jennewine: DigitalOcean is in the cloud computing business.  It provides a range of infrastructure services like compute, storage, networking, and platform services like application development tools."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9967afc71b81c70d8086dacbcf9cb19d01d1165a486c9561a2514a521fcd477b"}
{"Ticker":"AMZN","Date":1642246620,"Headline":"After an IPO-Day Rocket Ride, Can Hour Loop Maintain Its Mojo?","Source":"Yahoo","Summary":"Hour Loop quickly became the company of the hour, but now it's time to loop back and assess the company's viability prospects."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54f04ae45a652fcf6edc9d02e940c4a05999551d5576224c978ce3a715dcf429"}
{"Ticker":"AMZN","Date":1642239420,"Headline":"Is Palantir a 2022 Breakout Stock?","Source":"Nasdaq","Summary":"While starting off as a data analytics company that catered to the U.S. government, Palantir (NYSE: PLTR) has pivoted to provide its services to the civilian market. Some people fear the government has access to too much personal data, and Palantir processes a portion of the info"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6787f4f8058c13d5614f03a9d2dc0f695474d4399e918dcea86d75787f7ea0e5"}
{"Ticker":"AMZN","Date":1642237200,"Headline":"Tech Stocks Vs. REITs: Which Are Better Investments In 2022?","Source":"SeekingAlpha","Summary":"We have good reasons to believe that tech stocks will remain challenged. We present five reasons why REITs are better investments than tech stocks in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aacdca1b08a5e765833bde12907de86464f3bb33a1be5d597d18dbfa76c337e4"}
{"Ticker":"AMZN","Date":1642229429,"Headline":"Confounded's Complete Aggressive Growth Portfolio After A Brutal Beatdown","Source":"SeekingAlpha","Summary":"I have reduced my number of holdings in portfolio to 25 and have begun to concentrate my holdings among a few. Check out my current aggressive growth portfolio."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d90fb5b50c198f00685ab7386bb327fb17b396c3e36378fe2fcca87be2bd3665"}
{"Ticker":"AMZN","Date":1642351757,"Headline":"Trouble For Technology","Source":"SeekingAlpha","Summary":"It has been a rough start for the NASDAQ and technology so far in 2022. These challenges can be traced back as far as mid-2021."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11ddbe29f435f922afd47387dc50b8cf9a2266bc61b2967424cf24c5d3165fbd"}
{"Ticker":"AMZN","Date":1642320000,"Headline":"Now Is a Great Buying Opportunity for This Giant Fintech Stock","Source":"Nasdaq","Summary":"There are 33 million merchants that now accept PayPal (NASDAQ:PYPL) worldwide. In this clip from \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Motley Fool contributors Brian Feroldi and Brian Withers discuss why they think PayPal is on the right track and why"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1e0190701e1326d9a40d045c3ccf8e2403c66602e089e9ffccee7d8275adda18"}
{"Ticker":"AMZN","Date":1642319580,"Headline":"Amazon Challenges SpaceX in Space","Source":"Nasdaq","Summary":"Amazon (NASDAQ: AMZN) announced in November that -- at long last -- it's getting ready to roll out its Project Kuiper initiative to provide broadband internet service via satellite."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec7b5eabc455b00aa6e66b49800defb582cfecf35bf42cb72f74abeef8bb6195"}
{"Ticker":"AMZN","Date":1642319220,"Headline":"3 Top E-Commerce Stocks to Buy in January","Source":"Nasdaq","Summary":"According to the U.S. International Trade Administration, global e-commerce sales made up 18% of global retail sales in 2020. This figure is expected to increase to 22% of global retail sales by 2024, demonstrating that -- slowly but surely -- e-commerce is becoming a primary way"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1c136a9eae5c844df0edb330d6f954facb955358eae26e16401dc7d4cf8b26e4"}
{"Ticker":"AMZN","Date":1642317420,"Headline":"MercadoLibre Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"MercadoLibre (NASDAQ: MELI), the largest e-commerce company in Latin America, nearly tripled its market capitalization in 2020 as its growth accelerated throughout the pandemic. But over the past 12 months, the high-flying stock lost nearly a third of its value as investors frett"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5116c131e856452d1757d39105e2a809d67ec74fe98e5c8732a1926ea89bc9c9"}
{"Ticker":"AMZN","Date":1642460110,"Headline":"Amazon (AMZN) Outpaces Stock Market Gains: What You Should Know","Source":"Yahoo","Summary":"Amazon (AMZN) closed the most recent trading day at $3,242.76, moving +0.57% from the previous trading session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c1e9138dc50794fc3f7cc994a389625de0bbc8b179d45f1efe06b12f04c5adda"}
{"Ticker":"AMZN","Date":1642459800,"Headline":"Be a landlord for Amazon and FedEx with these REITs that yield up to 4.1%","Source":"Yahoo","Summary":"The REITs are paying big dividends from diverse commercial property holdings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4a2d1019d473e38019225a33003da1a408824e18e1b1daf2e9844eabfe1fa256"}
{"Ticker":"AMZN","Date":1642458312,"Headline":"Amazon com : commits another $24.8 million for affordable homes in the Puget Sound region","Source":"Finnhub","Summary":"The Amazon Housing Fund has now committed more than $344.3 million in loans and grants to the Puget Sound region to create or preserve 2,870 affordable units-with more investments to come. ... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=86007eae01b9ee47d46cf42048f3b9a60c4702765f81cc499b0ae3f55774d5b9"}
{"Ticker":"AMZN","Date":1642456684,"Headline":"Lawsuit against Amazon filed in tornado swarm that left 6 dead in Illinois warehouse","Source":"Reuters","Summary":"The family of an Amazon.com delivery truck driver in Illinois who died in December when a warehouse was destroyed by a swarm of tornadoes that killed six people there, filed a lawsuit against the online retailer on Monday over his death."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8afec671aabbf569c03faf19b7782731487f8de477e5a4594e79564abc223b6b"}
{"Ticker":"AMZN","Date":1642446000,"Headline":"After flying start, Stellantis must tackle Tesla and China","Source":"Nasdaq","Summary":"If playing catch up with Tesla is what everyone in the auto industry is about then Stellantis, the company formed from the merger of Fiat Chrysler and Peugeot, has had a good start – its shares have far outpaced its U.S. rival in its inaugural year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=82cb0af6c9e0b7a8d88c45df6b8bdf873302c0c86ccb1b317e50616817650fee"}
{"Ticker":"AMZN","Date":1642442488,"Headline":"11 Best Delivery Stocks To Buy Now","Source":"Yahoo","Summary":"In this article, we discuss the 11 best delivery stocks to buy now. If you want to skip our detailed analysis of these stocks, go directly to the 5 Best Delivery Stocks To Buy Now. Delivery stocks have jumped into the spotlight as supply chain disruptions lead to inflation and businesses scramble to identify reliable […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49d01c94d1abd6f7a2b604bc934f4475ffe94c8ecd66601f5eef5fade3c0a56a"}
{"Ticker":"AMZN","Date":1642438725,"Headline":"835 Reasons to Invest in Netflix Stock Right Now","Source":"Yahoo","Summary":"There's little question that Netflix (NASDAQ: NFLX) has created a windfall for early investors, generating returns of more than 43,300% in 20 years.  The most common bearish narrative goes something like this: Once, Netflix was the only streaming game in town.  Netflix won't be able to keep up the frantic pace of original content additions and will continue to lose market share as a result."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=93f28d35f1fafbe0c3d712d5b4fff5a1e4bbba225cb96b4f841229b4a87a2d82"}
{"Ticker":"AMZN","Date":1642434405,"Headline":"Amazon reverses decision to ban customers from using Visa credit cards","Source":"Yahoo","Summary":"The online retailer had intended to introduce the changes from Wednesday, having warned customers that the card company’s fees were too high."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0b0317b8b6a89ebec053a4c416c41b066d90b71b32c6bd03753c6343a8719b36"}
{"Ticker":"AMZN","Date":1642434322,"Headline":"Amazon will continue to accept Visa credit cards in the UK—for now","Source":"Yahoo","Summary":"The two companies are working closely on a \"potential solution,\" but there is no clarity yet on what that might be."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b8efd21f0ccc4eac1dcabb40dbce3e8e0019aa86055daabd9d713d3b3948ccf"}
{"Ticker":"AMZN","Date":1642431709,"Headline":"Amazon halts ban on UK-issued Visa credit cards","Source":"Reuters","Summary":"Amazon.com said on Monday it would not stop accepting UK-issued Visa Inc credit cards on its British website later this month as it had proposed, adding that it was working with Visa to resolve a dispute over payment fees."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c8f5e3c6ad0c4e45088cd532dd2979638cc5c3c946335bb3f4e3862f4eb33639"}
{"Ticker":"AMZN","Date":1642427880,"Headline":"Polygon’s Value Grows as Its Apps Grow in Usefulness and Popularity","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cef806cfb07ffa0e57e7e37eb97c77119bcea05a7b163feb61c070819a7e1ca0"}
{"Ticker":"AMZN","Date":1642427288,"Headline":"Fundsmith LLP: “The Purchase of Amazon (AMZN) has Attracted a Lot of Attention”","Source":"Yahoo","Summary":"Fundsmith LLP, an investment management firm, published its “Fundsmith Equity Fund” fourth-quarter 2021 investor letter – a copy of which can be downloaded here. The T Class Accumulation shares, the most commonly held share class, rose by +22.1% in 2021 and compares with a rise of +22.9% for the MSCI World Index in sterling with […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b21a5484ba7e60468b406ffdee2b3f6669a7a77cb9771a90c9d3d65d5d96d5f0"}
{"Ticker":"AMZN","Date":1642427100,"Headline":"Should You Consider Investing in Amazon (AMZN)?","Source":"Yahoo","Summary":"Stewart Asset Management, an investment management firm, published its fourth-quarter 2021 investor letter – a copy of which can be seen here. For the full year 2021, the fund’s Flagship portfolio advanced 22.85%, net of fees. The S&P 500 Index, its benchmark, appreciated 28.71%. For the fourth quarter of 2021, its Flagship advanced 7.74%, and […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5a0f36dad6026cbfaa2298a18171ecb7f748fe7ce5b3ff7c9217ee8bf293fae4"}
{"Ticker":"AMZN","Date":1642427100,"Headline":"Here's an Under-the-Radar Strategy for Picking Winning Retail Real Estate Investment Trusts","Source":"Yahoo","Summary":"Investing in retail stocks comes with its own set of challenges.  Charlene has a great approach for picking winning real estate investment trusts (REITs) in the retail space.  Travis brings up how retail companies can increase relevance by offering easy from-home shopping."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bf5931bad1fc53476e6e5d8eec635f9a02fe1824894468606651a41ab70adfd"}
{"Ticker":"AMZN","Date":1642425900,"Headline":"Tech Stocks Roundup: Well-Known Value Investor Likes Google, Meta, Netflix","Source":"Yahoo","Summary":"Check out the latest news and performance numbers from the top technology and FAANG\/MAMAA stocks like Amazon, Apple, Microsoft, Intel, and more."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b5c488737928f627e5e54ddc52f3f306e5261c8dc0c639867b870983e78b4bdb"}
{"Ticker":"AMZN","Date":1642424280,"Headline":"Amazon Scraps Plan to Stop Accepting Visa’s U.K. Credit Card","Source":"Yahoo","Summary":"Visa stock tumbled more than 5% one day in November after Amazon said British shoppers would no longer be able to use their Visa credit card."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f057e361b68855ca594b9eff0fc8f370f540ec3c51ddb70abe8e9d4d765bd6d0"}
{"Ticker":"AMZN","Date":1642421374,"Headline":"Musk and Bezos among world's 10 richest men who doubled their wealth in pandemic","Source":"Yahoo","Summary":"The 10 richest now have six times more wealth than the poorest 3.1 billion people, according to an Oxfam study."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23d87293fe0c8bc1181a309f067893fd58393d1def4643889bcbb296deaef3ca"}
{"Ticker":"AMZN","Date":1642420800,"Headline":"4 Robots That Can Shape the Future of Amazon's Fulfillment Centers","Source":"Yahoo","Summary":"In this clip from \"3 Minute Stocks Updates\" on Motley Fool Live, recorded on Jan. 5, Motley Fool contributors Brian Withers and Toby Bordelon talk about the four robots Amazon (NASDAQ: AMZN) introduced as an effort to improve worker safety while also increasing business efficiency.  Toby Bordelon: Amazon seems like your relatively high-tech company dealing with a low-tech problem like labor shortages."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b6d083ff67d37a2885a0f775c722009dd355dcf9f71591818eaf02e95155aec"}
{"Ticker":"AMZN","Date":1642419300,"Headline":"Reversing stance, Amazon says it will keep accepting Visa credit cards in the U.K.","Source":"Yahoo","Summary":"Amazon.com on Monday said it will keep allowing payments in the U.K. using Visa, a reversal of a plan by the online retailing giant to stop using the service."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=85e5564d4ad8f82cce98d176ca45ca0b01defbf5a1281ab2b5f4f6d950a2e616"}
{"Ticker":"AMZN","Date":1642419000,"Headline":"Can 2021's Best-Performing FAANG Stock Do It Again in 2022?","Source":"Yahoo","Summary":"If you had invested in any one of the FAANG stocks 10 years ago, you'd be pleased. On average, FAANG stocks have returned an astounding 1782% over the last 10 years versus the market's 325%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f97f2daa9881207ab9b44e75c847e37060d94378a77b6e49a639e5b22c1f803"}
{"Ticker":"AMZN","Date":1642418100,"Headline":"2 Top Bargain Stocks Ready for a Bull Run","Source":"Yahoo","Summary":"Many technology stocks took it on the nose in 2021.  Cathie Wood's high-growth, tech stock-focused exchange traded fund (ETF) ARK Innovation (NYSEMKT: ARKK) took a hit last year and lost 24% of its value.  The tech sector is stumbling out of the gate in 2022 as well, already down almost 10% versus an essentially flat index."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=87638ae1e1aa13a6940173bcd6a84feca51ba35a073aed2184c06a45611352c7"}
{"Ticker":"AMZN","Date":1642417800,"Headline":"Rivian Stock Just Fell Below its IPO Price of $78 Per Share: Time to Buy?","Source":"Yahoo","Summary":"Share prices of Rivian Automotive (NASDAQ: RIVN) briefly fell to $75.13 per share on Friday before closing the session at $79.95 per share.  It was the first time Rivian stock dipped below its initial public offering (IPO) price of $78 per share.  Howard Smith: Markets aren't always efficient, and that's how investors can gain an advantage."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=570fdb66116deae86d68116f2567521543d2dbccd3337910c36c9f567ab6fd65"}
{"Ticker":"AMZN","Date":1642417325,"Headline":"Amazon U-turns on decision to scrap Visa credit cards in UK","Source":"Yahoo","Summary":"The online retail giant said it was working closely with Visa on a potential solution that will enable customers to continue using their Visa credit cards on Amazon.co.uk."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5c531420a5ce2bd20fe5bdc22028e2c3c1431b59ccac0b050051c3104fac0a21"}
{"Ticker":"AMZN","Date":1642415555,"Headline":"Amazon halts ban on UK-issued Visa credit cards ","Source":"Reuters","Summary":"Amazon.com said on Monday it would not stop accepting UK-issued Visa credit cards on its website later this month as it had proposed, adding that it was working with Visa to resolve a dispute over payment fees."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fff6ca8bff817c577cb3c408491102668ba19127803815d9c5cb26c069493dba"}
{"Ticker":"AMZN","Date":1642414860,"Headline":"Amazon Backs Off Threat to Ban U.K.-Issued Visa Credit Cards ","Source":"DowJones","Summary":"The online retailer, which has criticized Visa’s fees, said it is negotiating a deal that would allow customers to keep using their U.K. cards. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e8c0f4bd42f08cb239b66543fc1a1eed6a597d22a12a1c93053b57bfa5a0a466"}
{"Ticker":"AMZN","Date":1642412894,"Headline":"Samsung Dishwashers Designed Specifically for Indian Kitchens to Launch During Amazon Great Republic Day Sale","Source":"Finnhub","Summary":"Samsung, India's most trusted consumer electronics brand, has announced it will launch two models of its freestanding Dishwashers on e-commerce platform Amazon during the Great Republic Day Sale from... | January 17, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cede5f472553bcbcd3e7eaa6e1270e7b0917464a7e0ff53752d993133a5c2486"}
{"Ticker":"AMZN","Date":1642398720,"Headline":"3 Unstoppable Stocks That Can Beat Bitcoin in 2022","Source":"Nasdaq","Summary":"Bitcoin (CRYPTO: BTC) delivered its worst performance in 2021 of the past three years. And the cryptocurrency still trounced most stocks, with its price soaring more than 60%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ab1a29a22b4941b157d94c519923ed69dbc35427925a06eeffce8bd843732f8b"}
{"Ticker":"AMZN","Date":1642550358,"Headline":"Apple, Google Tell U.S. Senators That Tech Bills Will Harm Privacy","Source":"Yahoo","Summary":"(Bloomberg) -- Apple Inc. and Google warned U.S. lawmakers Tuesday that bipartisan antitrust legislation aimed at curbing the power of big technology companies will threaten the privacy and security of users.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Tensions, Roil Oil MarketOlymp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=51ae58ef254bd5b806e6002d12489fb65b95f4720b7872d1a2443bbae57be5da"}
{"Ticker":"AMZN","Date":1642545499,"Headline":"Searcy Financial Services Inc  Buys First Trust Financials AlphaDEX Fund, Apple Inc, CVS Health ...","Source":"Yahoo","Summary":"Investment company Searcy Financial Services Inc (Current Portfolio) buys First Trust Financials AlphaDEX Fund, Apple Inc, CVS Health Corp, Berkshire Hathaway Inc, iShares MSCI Global Min Vol Factor ETF, sells First Trust International IPO ETF, The Walt Disney Co during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Searcy Financial Services Inc ."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1901ffaf14666977c111c113f2d57978e9afead11b74f881cfd5129197fa8483"}
{"Ticker":"AMZN","Date":1642545497,"Headline":"Procyon Private Wealth Partners, LLC Buys PIMCO Enhanced Short Maturity Active Exchange-Trad, ...","Source":"Yahoo","Summary":"Investment company Procyon Private Wealth Partners, LLC (Current Portfolio) buys PIMCO Enhanced Short Maturity Active Exchange-Trad, Vanguard Mega Cap Value ETF, iShares Interest Rate Hedged Long-Term Corporate B, Vanguard FTSE Developed Markets ETF, Schwab U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=007a08f1dce06e62eb05d4deb6b24a05d0d85b2ee11dd5ef7a8005221bcb3376"}
{"Ticker":"AMZN","Date":1642545494,"Headline":"HNP Capital LLC Buys Industrial Select Sector SPDR, iShares TIPS Bond ETF, ISHARES TRUST, Sells ...","Source":"Yahoo","Summary":"Investment company HNP Capital LLC (Current Portfolio) buys Industrial Select Sector SPDR, iShares TIPS Bond ETF, ISHARES TRUST, BTC iShares Floating Rate Bond ETF, Vanguard Short-Term Government Bond ETF, sells SPDR Portfolio S&P 500 Growth ETF, Blackrock Income Trust Inc, Dow Inc, SPDR Gold Shares ETF, iShares iBoxx USD High Yield Corporate Bond ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, HNP Capital LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=124034cddb669b28691f59426f968b9e32491aaa97fa8166eebc19d68d53d190"}
{"Ticker":"AMZN","Date":1642545488,"Headline":"TTP Investments, Inc. Buys ProShares Ultra S&P500, Amplify BlackSwan Growth & Treasury ...","Source":"Yahoo","Summary":"Investment company TTP Investments, Inc. (Current Portfolio) buys ProShares Ultra S&P500, Amplify BlackSwan Growth & Treasury Core ETF, Apple Inc, Amazon.com Inc, Microsoft Corp, sells BTC iShares MSCI USA Min Vol Factor ETF, ISHARES TRUST, ISHARES TRUST, ISHARES TRUST during the 3-months ended 2021Q4, according to the most recent filings of the investment company, TTP Investments, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3bc151e5c49c1ac957cc1b6a12f57ceb8507725ee057723a374c7e45a808ddc"}
{"Ticker":"AMZN","Date":1642542804,"Headline":"Microsoft’s Activision Deal Set to Test Biden’s Antitrust Regime","Source":"Yahoo","Summary":"(Bloomberg) -- Less than three weeks into 2022, President Joe Biden’s antitrust regime is facing its first big test of the year. Microsoft Corp.’s $69 billion all-cash takeover of Activision Blizzard Inc. brings together two major gaming platforms in a deal that directly affects consumers -- and could also raise grievances among some of the tech giant’s biggest rivals.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward O"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e76dd52da6bc0a8c1f54349d40d0c11f4d04cb45fdc07cbf6bf61bfc8ad1b31"}
{"Ticker":"AMZN","Date":1642539728,"Headline":"6 Stocks To Buy According To Zach Schreiber’s PointState Capital","Source":"Yahoo","Summary":"In this article, we discuss 6 stocks to buy according to Zach Schreiber’s PointState Capital. If you want to skip our detailed analysis of Zach Schreiber’s history, investment philosophy, and hedge fund performance, go directly to 3 Stocks To Buy According To Zach Schreiber’s PointState Capital. In 2011, Zach Schreiber founded PointState Capital in New […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=86adaa1024366ce75890f707d64562d5e02ca7d7f765700ac4c0bf90ec58ad69"}
{"Ticker":"AMZN","Date":1642537860,"Headline":"Microsoft could have just kicked off a Big Tech gold rush, which helps videogame stocks but maybe not gamers","Source":"Yahoo","Summary":"Microsoft Corp.'s agreement to buy Activision Blizzard Inc. would be the largest tech acquisition ever, and the chance it could prompt other Big Tech names to make their own acquisitions sent videogame stocks higher in response, according to analysts."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8fff9a247ac9ca1108969d3eb27baf2c8230429de67809099af68a745b4532c7"}
{"Ticker":"AMZN","Date":1642537800,"Headline":"Reliance joins calls for India to tighten marketplace rules -sources","Source":"Nasdaq","Summary":"Indian retailer Reliance has called for tighter regulation of marketplace e-commerce platforms to ensure such websites treat all sellers equally, four sources told Reuters."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b4b04998faa41bf60708aac7f51118944019c82e1ebf476f2bbacbf32688f801"}
{"Ticker":"AMZN","Date":1642537460,"Headline":"Amazon Prime Membership Fee Is Due to Rise","Source":"Yahoo","Summary":"It’s been several years since Amazon raised its Amazon Prime membership cost to $119. Could inflation (and growth) mean another increase is imminent?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9242e6b097c959775bd6d0b5353da9ddb9334fb8a1c94c7d26d302e920e67e84"}
{"Ticker":"AMZN","Date":1642536507,"Headline":"Why Amazon Stock Traded Lower Today","Source":"Yahoo","Summary":"The e-commerce giant was the target of some mixed commentary courtesy of a Wall Street analyst, while also following the broader market lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1a7e56f09763ad8cfab561434a8245d60e8f70f326bf63338df6a914b35ec6f"}
{"Ticker":"AMZN","Date":1642534236,"Headline":"Big Tech sell-off not 'a long-term problem for the sector,' market strategist says","Source":"Yahoo","Summary":"J.P. Morgan Asset Management Global Market Strategist Jack Manley joins Yahoo Finance Live to discuss stocks selling off, fourth quarter earnings for big banks, inflation data, and the Fed."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=880a4366ddecd21b6ebf3fecde0cc36119f88ed382e44cd3173c8bb8488302de"}
{"Ticker":"AMZN","Date":1642533579,"Headline":"Report: Amazon expected to be the tenant of million-square-foot development in New Stanton","Source":"Yahoo","Summary":"Newmark industrial report expects a familiar team for a new million-square-foot distribution center in the works for Glenn Fox Road in Westmoreland County"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c1615a1082b8a624c9ed98088674bf3cc52dfce62954543590a3c92c54215d7"}
{"Ticker":"AMZN","Date":1642533300,"Headline":"Microsoft faces battle for Activision deal, especially if 'Call of Duty' is destined for Xbox exclusivity","Source":"MarketWatch","Summary":"Microsoft Corp. has in the last few years gotten a bit of an anti-competitive pass from U.S. regulators, after its long legal battle with the Justice..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fbc612c8e86e43d4d4c0a765e83f7da028f895cd95f9bcf761a60620f47d1ea1"}
{"Ticker":"AMZN","Date":1642531093,"Headline":"GPM Growth Investors, Inc. Buys Canadian Pacific Railway, Amazon. ...","Source":"Yahoo","Summary":"Investment company GPM Growth Investors, Inc. (Current Portfolio) buys Canadian Pacific Railway, Amazon.com Inc, iShares Fallen Angels USD Bond ETF, sells Northrop Grumman Corp, , Skyworks Solutions Inc, Lockheed Martin Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, GPM Growth Investors, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=70b2b3533f42a4491b83e074f937530ac6a985dc931eff95d91c203a0bad1a33"}
{"Ticker":"AMZN","Date":1642529146,"Headline":"Five Reasons Microsoft Is Making Activision Blizzard Its Biggest Deal Ever","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp. is buying Activision Blizzard Inc. in a $68.7 billion all-cash acquisition, uniting two of the biggest forces in video games. It’s the software maker’s biggest deal ever, almost three times as large as the 2016 purchase of LinkedIn. Here are five key reasons why it happened.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasu"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cb0e7b8203d47e4e0037283ed71121e19243bb5f77fbbf15f3a804f57d8b15eb"}
{"Ticker":"AMZN","Date":1642525920,"Headline":"Labor Secretary Marty Walsh on Vaccine Mandates, Labor Shortages, and the Retirement Crisis","Source":"MarketWatch","Summary":"Martin J. Walsh spoke with Barron’s about the state of America’s workforce for A Better Economy: Inclusive Recovery event."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d85856c992505c50251fa390967b6343b33f060c2c133dc6a3ae23aadaf85fb"}
{"Ticker":"AMZN","Date":1642524240,"Headline":"With Few Reasons to Buy, ContextLogic Is a Safe Haven for Bears","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3ab0c826ef3045f3940e3c241ab9d4bea972288704dd207edb0bead776efa410"}
{"Ticker":"AMZN","Date":1642523640,"Headline":"Can Elon Musk Save the Internet?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=97103274b8cfd521db5e36a6a5187b123a45eb821cd96d95b2c19006f4da1deb"}
{"Ticker":"AMZN","Date":1642523400,"Headline":"Amazon.com Inc. stock outperforms competitors despite losses on the day","Source":"MarketWatch","Summary":"Shares of Amazon.com Inc. slid 1.99% to $3,178.35 Tuesday, on what proved to be an all-around rough trading session for the stock market, with the S&P 500..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fc80740cfe5b0313f5dbcde049e29094ca759eee907b148f2f4e819119097d29"}
{"Ticker":"AMZN","Date":1642523160,"Headline":"Ford to book $8.2 billion fourth-quarter profit on Rivian investment","Source":"MarketWatch","Summary":"Ford Motor Co. said late Tuesday it has realized a $8.2 billion gain in the fourth quarter related to its investments in Rivian Automotive Inc. following the..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3649ebbd111dfa2099c7adf9c6554625a96da0428ae8f7fd476c87521bab75b1"}
{"Ticker":"AMZN","Date":1642520641,"Headline":"Market check: 10-year Treasury yield climbs to 2-year high, Dow falls 500+ points","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre breaks down how the stock and bond markets are performing in early trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e8ff053b63d1a33d90257e0ea8b8c41d36b2654665a02b4ad4942db341e6067"}
{"Ticker":"AMZN","Date":1642520535,"Headline":"11 Good And 4 Bad Reasons To Keep Holding ARK Invest","Source":"SeekingAlpha","Summary":"The few who bought ARKK before its rise should hold. The majority who bought at the 02\/2021 peak risk long-term losses. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=23bcddbc25c54143d05baa8072462efc36f978882b3d87ab2cc834af4ac9fa0c"}
{"Ticker":"AMZN","Date":1642519380,"Headline":"Notable Tuesday Option Activity: AMZN, STAR, AZO","Source":"Nasdaq","Summary":"Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Amazon.com Inc (Symbol: AMZN), where a total volume of 181,956 contracts has been traded thus far today, a contract volume which is representative of approximat"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7839d71fec7d8f6b1be8651b2f53e771ddb1d9fdb718fb26d6428aa69f31143a"}
{"Ticker":"AMZN","Date":1642519020,"Headline":"Tech Stocks Alert: Why TSLA, NVDA, FB, AMZN, UBER Stocks Are Down Today","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3f9afdbd0654a20034f61291361999a0d0057b625f12876db5ff7001125f2134"}
{"Ticker":"AMZN","Date":1642516697,"Headline":"David J Yvars Group Buys Amazon.com Inc, Entegris Inc, Crocs Inc, Sells iShares Core S&P ...","Source":"Yahoo","Summary":"Investment company David J Yvars Group (Current Portfolio) buys Amazon.com Inc, Entegris Inc, Crocs Inc, Netflix Inc, Tempur Sealy International Inc, sells iShares Core S&P 500 ETF, Microsoft Corp, InMode, PayPal Holdings Inc, Bank of America Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, David J Yvars Group."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ede6fd0ed92e6c541c19bee27e59302004eeb16195aa2af01956c61d5b58a4a"}
{"Ticker":"AMZN","Date":1642515240,"Headline":"Wall Street tumbles as yield spike hits tech, banks slump after Goldman miss","Source":"Nasdaq","Summary":"Wall Street's main indexes fell sharply on Tuesday as weak results from Goldman Sachs weighed on financial stocks and tech shares continued their sell-off to start the year as U.S. Treasury yields rose to milestones."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4685584dfddff3b88622bc3faca5ac5e8d9819408f68a450749f81082f8b2cb4"}
{"Ticker":"AMZN","Date":1642512600,"Headline":"EXCLUSIVE-U.S. examining Alibaba's cloud unit for national security risks - sources","Source":"Nasdaq","Summary":"The Biden administration is reviewing e-commerce giant Alibaba's cloud business to determine whether it poses a risk to U.S. national security, according to three people briefed on the matter, as the government ramps up scrutiny of Chinese technology companies' dealings with U.S. firms."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d32f9baef1c4a4ac9b917ec0633080e177102623083898f5d97e8e4362f495dd"}
{"Ticker":"AMZN","Date":1642510620,"Headline":"Microsoft Buys Activision With One Eye on the Cloud","Source":"Nasdaq","Summary":"Long-suffering shareholders — not to mention canny value investors — were rewarded for their patience in Activision Blizzard (ATVI, $65.39) Tuesday when Microsoft (MSFT, $310.20) agreed to pay $68.7 billion, or $95 a share in cash, for the troubled video game publis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3b4ba8345d73cab5c70dd57a2d5b50d11fdb28c62a8bb9745d9fb872afc86a2"}
{"Ticker":"AMZN","Date":1642508580,"Headline":"What Made Peak Shipping Season a Success?","Source":"Benzinga","Summary":"This post contains sponsored advertising content. This content is for informational purposes only and not intended to be investing advice.\n\nBy all accounts, the 2021 holiday peak..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=efac073cff157d5e8d7e80d4fb93e33b8ad700cf7791b2b23f5529a187280b2b"}
{"Ticker":"AMZN","Date":1642508580,"Headline":"US STOCKS-Wall St falls on tech drag; GS profit miss triggers bank selloff","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as Goldman Sachs led declines among banks after posting its quarterly profit below expectations, while big technology stocks were slammed by rising Treasury yields."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89bc5965db689e0b8bca9ab7e9f8e71c8249f8107b4879fa9cd43f1d83d8d006"}
{"Ticker":"AMZN","Date":1642507500,"Headline":"What Lies Ahead for Netflix ETFs in Q4 Earnings","Source":"Nasdaq","Summary":"Netflix NFLX is set to release fourth-quarter 2021 results on Jan 20 after market close. Being the world's largest video streaming company, it is worth taking a look at its fundamentals ahead of the results.The stock has underperformed the broad industry, having plunged 1"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=99bba3ec4f2a155ee1b02fd7e85730aec4081c2088bc90bcf544545c919df118"}
{"Ticker":"AMZN","Date":1642505040,"Headline":"Apple (AAPL) Allows Use of Third-Party Payment in Netherlands","Source":"Nasdaq","Summary":"Apple AAPL will comply with a ruling from the Netherlands’ Authority for Consumers and Markets (ACM) by allowing app developers to utilize third-party payment services within its App Store for the first time in its history.The company has decided to release a pair of enti"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46579bd0163aa828e4483f3d8080074ac6dfdda76d1005460c2614d17fff7d03"}
{"Ticker":"AMZN","Date":1642504740,"Headline":"Amazon Will Be a ‘Cleaner Story’ Through 2022, Analyst Says","Source":"MarketWatch","Summary":"Despite near-term headwinds, Amazon remains a top pick at J.P. Morgan."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cf671f48f35406f8e5cbe78f4fbdc0ff663723ec0de4d21ed7f554285c8ba372"}
{"Ticker":"AMZN","Date":1642502744,"Headline":"Lawsuit against Amazon filed in tornado swarm that left 6 dead in Illinois warehouse","Source":"Reuters","Summary":"The family of an Amazon.com delivery truck driver in Illinois who died in December when a warehouse was destroyed by a swarm of tornadoes that killed six people there, filed a lawsuit against the online retailer on Monday over his death."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=206086f15c74f94459fb1db57312584bd058dd2b6bd6765772bd324350ccb456"}
{"Ticker":"AMZN","Date":1642502040,"Headline":"TD SYNNEX (SNX) Signs SCA With AWS, Boosts Digital Offerings","Source":"Nasdaq","Summary":"TD SYNNEX SNX recently inked a strategic collaboration agreement (“SCA”) with Amazon’s AMZN subsidiary, Amazon Web Services (“AWS”), to invest in resources that will help in developing advanced cloud solutions for its partners."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=99cb53ab90d26a65651f79d8d9d1ecbf22d6709f0314d62a036f8b08bc489303"}
{"Ticker":"AMZN","Date":1642501511,"Headline":"Microsoft's $68.7 billion deal for Activision once again shows big tech's dominance over legacy media","Source":"CNBC","Summary":"Microsoft takes big $68.7 billion swing on video game company Activision Blizzard while legacy media stays on sidelines"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a5205c04e8f94f2b43d56a1755255b55dd0f87260fc875c098ba3919100852df"}
{"Ticker":"AMZN","Date":1642500720,"Headline":"US STOCKS-Wall St falls on tech drag; GS results trigger more bank declines","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as big technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17208323599ef5fd4929cb459d94f9b9378823d1ddc75fbf51c769ad93bf9290"}
{"Ticker":"AMZN","Date":1642498680,"Headline":"Activision, Apple, Tesla, Goldman Sachs: What to Watch When the Stock Market Opens Today","Source":"DowJones","Summary":"Activision Blizzard shares soared on a deal with Microsoft; Goldman Sachs reported a profit drop."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4b50371d5c8f11c3e6763b5f3a1dcea2391196f90682d10be5f50975ac1d86dd"}
{"Ticker":"AMZN","Date":1642497617,"Headline":"Amazon com : Addressing housing issues in Washington State","Source":"Finnhub","Summary":"Public-private cooperation creates the best chance for success. One of the most significant challenges we face in Washington, particularly in the Puget Sound region, is... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a86b33fa7ac046e8d30ea6f14ee8b2000c9a55d80b45fa11f2c6e9d80ae1509f"}
{"Ticker":"AMZN","Date":1642496880,"Headline":"US STOCKS-Tech tumble, lackluster GS earnings set to weigh on Wall Street","Source":"Nasdaq","Summary":"Wall Street's main indexes were set to open lower on Tuesday as technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among big banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49c6350d931ef7545f89df775f44860156485dea75f22f8526a173ce415d42fc"}
{"Ticker":"AMZN","Date":1642495020,"Headline":"GLOBAL MARKETS-Nasdaq braced for beating as bond markets drive up costs","Source":"Nasdaq","Summary":"Nasdaq traders were braced for a fresh pounding on Tuesday as a seven-year high for oil prices drove up global borrowing costs to pre-COVID levels, with even sub-zero German Bund yields at the brink of positive territory again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46bfd7e196a853c8f1b00ad3cb5e0670092ce9d7f8b57012e30e7b375d012059"}
{"Ticker":"AMZN","Date":1642493820,"Headline":"Could MercadoLibre Have a Massive Growth Opportunity Ahead?","Source":"Nasdaq","Summary":"In a recent episode of The Rank, three of our top contributors revealed their highest-conviction stock ideas for 2022. And not only did Fool.com contributor Danny Vena call MercadoLibre (NASDAQ: MELI) one of his top ideas, but colleagues Matt Frankel and Jason Hall both ranked it"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=baaa103394551c84c6fdf50c7bafb8a34b09e2d253eff4525014b5a5ad04eb62"}
{"Ticker":"AMZN","Date":1642491840,"Headline":"Top Stock Market News For Today January 18, 2022","Source":"Nasdaq","Summary":"Stock Market Futures Sink As 10-Year Treasury Yield Hits 2-Year HighStock market futures are on the decline coming into the current four-day trading week. This seems to be the case as the first batch of somewhat lackluster earnings figures from big banks has investors reconsideri"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5fa0a30d817798c33629bddc30fff0fc05d530aaf101bfaaeb705b5cc4b1fc7"}
{"Ticker":"AMZN","Date":1642490040,"Headline":"US STOCKS-Nasdaq futures tumble as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the technology-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c47f9d75ebed20fec74420657aa0c4bdde9232f249eaa14830e28966773d82a9"}
{"Ticker":"AMZN","Date":1642489920,"Headline":"Amazon Not To Ban Visa Credit Cards In UK","Source":"Nasdaq","Summary":"(RTTNews) - Amazon has dropped its earlier plan to stop accepting credit cards issued by Visa Inc. in the United Kingdom. The e-commerce giant said it is working on a potential solution with the payments processor to resolve a dispute over the payment fees."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3442fc97a64a2e60bee8c2ad3538514cef2728c81b9bae4f0c8302c63e23501f"}
{"Ticker":"AMZN","Date":1642489200,"Headline":"PREVIEW-Netflix earnings to set the pace for 2022 streaming wars","Source":"Nasdaq","Summary":"Netflix Inc will be the first major streaming service to report earnings this week, offering investors a sign of whether companies have started to pull in enough new customers to justify big spending on online programming in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f269948ceb0e84585c29794ad41de5f79a07a70ab8e62c157c15c11a469b64b0"}
{"Ticker":"AMZN","Date":1642482360,"Headline":"10 Top Stocks That Can Make You Richer in 2022","Source":"Nasdaq","Summary":"A new year brings new opportunities for investors to punch their ticket to the greatest wealth creator on the planet: the stock market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=09c1ef115d03c1adec3469bc54cd4654500d30fa72aed0cb14c763e48f2a96fb"}
{"Ticker":"AMZN","Date":1642482120,"Headline":"US STOCKS-Nasdaq futures slump 2% as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the tech-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=87c9114e6bbcf1060c5fc561af38023b8e297269d7e07a4e2e6cbc1c8a27f885"}
{"Ticker":"AMZN","Date":1642471510,"Headline":"The Trade Desk Stock: Another Great Buy Opportunity With 1 Caveat","Source":"SeekingAlpha","Summary":"Trade Desk is a high-quality advertising tech leader. Read on to know why we believe that investors who didn't manage to get on board TTD stock previously can consider adding now."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6f13fbdf1274dae9ea1c6d750ceb1d1e5572c06ac43c2efd149fe01ef800be3"}
{"Ticker":"AMZN","Date":1642468327,"Headline":"Quantitative Restrictions In E-commerce Agreements: Amazon And Apple Fined For More Than EUR 200 Million By The Italian Competition Authority","Source":"Finnhub","Summary":"With its decision issued on 23 November 2021, the Italian Competition Authority has fined Amazon and Apple for EUR 68.7 million and EUR 134.5 million, respectively. According to the AGCM, the two... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b16a4d05e65a4281cf944f53b09ec3494c1cfa4eb642319e26158595b6982c8a"}
{"Ticker":"AMZN","Date":1642464060,"Headline":"EU’s Tough Data Privacy Rules Rake in Biggest Annual Fines","Source":"Yahoo","Summary":"(Bloomberg) -- European Union data protection fines targeting Amazon.com Inc. and Meta Platforms Inc.’s WhatsApp helped push penalties to record levels last year, in a sign that the bloc’s tough privacy rules are starting to bite.Most Read from BloombergDeadly Strikes on UAE Upset Efforts to Ease Gulf FrictionsFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsOne of the World’s Wealthiest Oil Exporters Is Becoming UnlivableDjokovic Loses Shot at Tennis History as Aust"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1dbbc4212fe4551ac630a78fc9ab967e46e7ded6009c8a2723eb60b5ac0e6b23"}
{"Ticker":"AMZN","Date":1642636800,"Headline":"Telenor partners with Amazon to modernise systems, offer services","Source":"Nasdaq","Summary":"Norway's Telenor said on Thursday it had partnered with Amazon Web Services (AWS) to speed up the modernisation of its telecoms systems, boosting the use of cloud technology to offer 5G and low-latency data services to professional customers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b9a4210dc593ae8fd4aafdaaf89304173631e9621ea2cc85e4e881c10856ca19"}
{"Ticker":"AMZN","Date":1642623360,"Headline":"White House meets small and mid-sized firms to discuss competition in tech sector","Source":"Nasdaq","Summary":"White House officials met on Wednesday with small and mid-sized companies to discuss competition issues in the tech sector, as momentum grows in the U.S. Congress to rein in large technology companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=155c01d4d2b309fe7240e75db30db07bf9709afb07fe492ec1f589ea80ac97a4"}
{"Ticker":"AMZN","Date":1642620840,"Headline":"Here's what's coming to Amazon's Prime Video in February 2022","Source":"MarketWatch","Summary":"Get ready for the action drama 'Reacher,' a new season of 'The Marvelous Mrs. Maisel' and much more"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f5a4a52d3949ca3c361b0458c34a830f61e388a763e91b3ab1e4d6f39b5799e"}
{"Ticker":"AMZN","Date":1642611300,"Headline":"US STOCKS-Wall Street sell-off deepens, Nasdaq confirms correction","Source":"Nasdaq","Summary":"Wall Street's main indexes ended sharply lower on Wednesday, with the tech-heavy Nasdaq confirming it was in a correction, after a diverse set of corporate earnings and as investors continued to worry about higher U.S. Treasury yields and the Federal Reserve tightening monetary policy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9b078482a37b025dca72b76db11fd9fc603523d2c4b999536095181fb5ec9778"}
{"Ticker":"AMZN","Date":1642609800,"Headline":"Amazon.com Inc. stock falls Wednesday, underperforms market","Source":"MarketWatch","Summary":"Shares of Amazon.com Inc. shed 1.65% to $3,125.98 Wednesday, on what proved to be an all-around grim trading session for the stock market, with the S&P 500..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=054ce89adaba242a8a518480e489137dfc100934c8ef4d2566e0daf1803f8f77"}
{"Ticker":"AMZN","Date":1642609740,"Headline":"Nasdaq confirms fourth correction since pandemic hit","Source":"Nasdaq","Summary":"The Nasdaq's loss on Wednesday left it down nearly 11% from its November record high close, marking the fourth time in the nearly two years since the coronavirus pandemic shook global markets that the tech-heavy index has found itself in a correction."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a14da25ec31fbe9edbc80daf6804b869ffc8fa3a82792f192491e94147be2e78"}
{"Ticker":"AMZN","Date":1642609320,"Headline":"When It Comes to Rivian, Don’t Sweat the Small Stuff","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b362838c448669691a3096191766c98ecf90f27e0361a7663212b369327fa76"}
{"Ticker":"AMZN","Date":1642608149,"Headline":"Microsoft Buys Activision? We Take Profit And Increase The Exposure At The Same Time","Source":"SeekingAlpha","Summary":"Nobody saw this coming, but Microsoft is making a huge move with its acquisition of Activision. Read more about MSFT & ATVI stock and this deal here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c919dfb1859caa084ae8413af4b69697b1543dea3f65fd3f9f16029911c08f6"}
{"Ticker":"AMZN","Date":1642605840,"Headline":"Rivian Is On Sale for Long-Term Investors, But It’s Not for Everyone","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aff443ca6f6abcd6c51ff1a2f35fecba732338c01bf58e6fb79d003d0e1c3744"}
{"Ticker":"AMZN","Date":1642604586,"Headline":"Amazon reveals 'Lord of the Rings' subtitle that hints at storyline","Source":"Reuters","Summary":"The long-awaited, expensive Middle-earth fantasy series from Amazon.com Inc has a name: \"The Lord of the Rings: The Rings of Power.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=08b419050953a9542e027bc803d99b2d0989eacd66248ebe1d33f86938ba90f0"}
{"Ticker":"AMZN","Date":1642601280,"Headline":"Rivian Stock Is Down 60% From Its Highs. Is the Electric Vehicle Maker a Buy Now?","Source":"Nasdaq","Summary":"In the days following its initial public offering (IPO) in November, shares of Rivian (NASDAQ: RIVN) rocketed 130% from its IPO price of $78. Investors were excited about the EV start-up's impressive designs for its battery-powered pickup trucks, sport utility vehicles, and comme"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ce67014bbf985d237613a54092b33cf7901904a7e1223c7193b1f1932464a25"}
{"Ticker":"AMZN","Date":1642598967,"Headline":"Sea Limited Stock: Is Now A Good Time To Buy Or Sell? A Critical Analysis Of The E-Commerce Ambitions","Source":"SeekingAlpha","Summary":"Sea Limited has used video game profits to aggressively expand its e-commerce presence. Read more to find out if SE stock is a buy or sell."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9593416e3e01efb41ea920185f1f88de386b7ba9198f2949af8cedb20b9c39fd"}
{"Ticker":"AMZN","Date":1642597320,"Headline":"How Ad Spending Can Help Alphabet and Meta Stock Keep Climbing","Source":"MarketWatch","Summary":"The growth of short video formats, augmented and virtual reality and the creator economy, plus the convergence of e-commerce and advertising and the ongoing..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fcc53979a69c10afeb19ec0fb1b87edb4957ba6e8145276525bb560a36bc218f"}
{"Ticker":"AMZN","Date":1642594583,"Headline":"Yes, The Crash Will Probably Get Worse From Here","Source":"SeekingAlpha","Summary":"Most of the major stock averages are still down by fewer than 10%. Check out why we think the declines could continue and accelerate moving forward."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2d153acebfb19a972c9b0bc625886a2d6cb63fd097f6c561950a8700ddb471eb"}
{"Ticker":"AMZN","Date":1642594522,"Headline":"Amazon com : Web Services scholarships help high school seniors go to college","Source":"Finnhub","Summary":"Applications are now open to students from four U.S. states where AWS has data center operations, to support their higher education ambitions in science, technology, engineering, and math. ... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3e97d21b17e2044b18effcfc919fc4a00529e58842391b28e620e13422ad25af"}
{"Ticker":"AMZN","Date":1642593000,"Headline":"Rivian’s investors prove an expensive ride","Source":"Nasdaq","Summary":"(The author is a Reuters Breakingviews columnist.  The opinions expressed are their own.)"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=885536d5472ef86f3c7c0f186d29febceab2ff4b84f03ae8c8ceeaa61421fb11"}
{"Ticker":"AMZN","Date":1642592839,"Headline":"Heritage land dispute over Amazon's new Africa HQ goes to court","Source":"Reuters","Summary":"Groups representing the descendants of South Africa's earliest inhabitants, the Khoi and San, went to court on Wednesday to try to halt construction of Amazon's new 70,000-square meter Africa headquarters on land they regard as sacred."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ca1cc823d814f99a392e3ece6ee66c55a6751470f69fc11e9ca16900c0ef18dd"}
{"Ticker":"AMZN","Date":1642592160,"Headline":"Got $3,000? 5 Buffett Stocks to Buy and Hold Forever","Source":"Nasdaq","Summary":"Warren Buffett stands atop the pantheon of history's most successful investors. If you were lucky enough to own a $3,000 stake in Berkshire Hathaway (NYSE: BRK.A)(NYSE: BRK.B) when he took control of the company in 1965, that position would now be worth nearly $81 million."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e103b56c7d01a72f49df51704dd192356091f73282b775be4d7fb7c45781611c"}
{"Ticker":"AMZN","Date":1642591980,"Headline":"3 Key Questions About Microsoft’s Deal to Buy Activision, Answered","Source":"MarketWatch","Summary":"Sony, Apple, and even GameStop may be among the casualties if the $69 billion gaming deal goes through. But the acquisition also faces challenges."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bf8ed36398e00e0adfed8af76767efb81d5aece1409a4f71658958b8d24cb16e"}
{"Ticker":"AMZN","Date":1642591980,"Headline":"Alphabet (GOOGL) Boosts Steaming Efforts With Annual Plans","Source":"Nasdaq","Summary":"Alphabet’s GOOGL division Google has taken a solid pricing strategy in order to gain a bigger market share in the booming streaming market.This is evident from the latest annual subscription plans for YouTube Premium and YouTube Music Premium.Notably, the yearly subscript"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a222e1b01fc2d85c600fcd8c230757718c1b74e18e11a23ad230f3f0e19bd6c8"}
{"Ticker":"AMZN","Date":1642591560,"Headline":"A Deep Dive into the FAANG Earnings Charts","Source":"Nasdaq","Summary":"This is a shortened trading week due to the Martin Luther King Day holiday but that doesn’t mean it’s not filled with plenty to keep traders busy."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1d7fc7884e7e66bd39d952f87f608014eb2f4f1fdbbeddc7872ea24e64046df"}
{"Ticker":"AMZN","Date":1642589640,"Headline":"Virgin Galactic Stock Needs Its Fans Back in Order to Climb High Again","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=739da1c458fe749a900dd89b07ed7cd1b6553ad1cb5508bf46684dec0c2212ea"}
{"Ticker":"AMZN","Date":1642589181,"Headline":"Microsoft: Activision, Azure, And Why It's Worth Every Penny","Source":"SeekingAlpha","Summary":"Microsoft is a best-of-breed software company whose competitive position looks as strong as ever. Read why the current valuation of MSFT stock seems reasonable."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=563249cd5a56b690a9acc035dea657e38d7be952c10f037a29153111a142d08a"}
{"Ticker":"AMZN","Date":1642589100,"Headline":"3 Growth Stocks You Can Buy Right Now With Less Than $100","Source":"Nasdaq","Summary":"Last year was a good one for the S&P 500. Much like consumers who opened their wallets en masse after being locked in their homes for months due to the pandemic, the benchmark index turned on the afterburners in 2021 and outperformed both the Dow Jones Industrial Average and"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f3a4fe05524b2bb143b96cde6bfced6247427b200a936476153af62be7677fe2"}
{"Ticker":"AMZN","Date":1642587310,"Headline":"What Does Competition From Amazon Care Mean To Teladoc?","Source":"SeekingAlpha","Summary":"As Amazon Care continues to expand its virtual healthcare offerings, it will offer a similar services to Teladoc. See how this may impact TDOC stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=602c5c9990e947ff9569a426c7b38e5cca09e53bce6faa2a83e60ae4a1871fd4"}
{"Ticker":"AMZN","Date":1642584600,"Headline":"1 Unstoppable E-Commerce Stock to Buy in 2022","Source":"Nasdaq","Summary":"Could Etsy (NASDAQ: ETSY) be one of the top e-commerce stocks for long-term investors to buy in 2022? The following segment of Backstage Pass was recorded on Dec. 22 and features Fool contributors Rachel Warren, Danny Vena, and Deidre Woollard."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8ef2d5f6ad11b78ec1f2ef73309816adc304da405d68198c1814e1880789e261"}
{"Ticker":"AMZN","Date":1642583720,"Headline":"Spotify: Why I'm Buying Shares","Source":"SeekingAlpha","Summary":"Spotify ticks a lot of the boxes I look for in an investment: founder-led, market leadership, rapid product innovation, expanding margins, and a reasonable valuation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=26bb4df5c77a5ff56734990ea0bc40bb0b0f3ca419ca2ed42165a729756ba41e"}
{"Ticker":"AMZN","Date":1642582800,"Headline":"How One Venture Capitalist Thinks About Capital Allocation","Source":"Nasdaq","Summary":"Picking the right companies to invest in is probably the biggest challenge to being a successful investor, but there's more to it than that. You also have consider things like position sizing, or how much to invest in each company."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2b3cb5e60316788455834449f8d46139556d09a2c900e05765c137a502d62f3d"}
{"Ticker":"AMZN","Date":1642580760,"Headline":"Affirm Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Affirm Holdings (NASDAQ: AFRM) lost more than 50% of its value over the past two months as rising interest rates caused investors to dump their pricier, more speculative, and unprofitable growth stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=25f068cce01bfbd0730d172ac5c00e39f4b54aba3b63e02bebd2a2981beadf66"}
{"Ticker":"AMZN","Date":1642579200,"Headline":"1 Compelling Real Estate Trend to Watch in 2022","Source":"Nasdaq","Summary":"Real estate is an exciting and fast-paced space to invest in, and this rings truer than ever as a new year kicks off. In this segment of Backstage Pass, recorded on Dec. 22, Fool contributor Deidre Woollard shares with fellow Fool contributor Rachel Warren the key trend she's wat"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2a71d788eef0bd624f37a7cb8762af485f48894df216ae5d3b263e78d5125257"}
{"Ticker":"AMZN","Date":1642577400,"Headline":"Here's Why Remote Work Isn't Going Anywhere in 2022","Source":"Nasdaq","Summary":"Adoption of remote work continues to skyrocket, even as a record number of Americans continue to leave their jobs. But as the pandemic shifts and changes, will these trends remain? In this segment of Backstage Pass, recorded on Dec. 22, Fool contributor Rachel Warren discusses th"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=441f7aa18b3fe82fafa5a5310bae18a8985bee74c25e73f7804072e1b690b7d6"}
{"Ticker":"AMZN","Date":1642575600,"Headline":"Will 2022 Be Another Great Year for AMD?","Source":"Nasdaq","Summary":"In this video, I will be talking about Advanced Micro Devices (NASDAQ: AMD), the recent analyst upgrades, its partnerships with Big Tech, and its third-quarter financials. You can find the video below but here are the highlights."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6f4199c74aeabd523dbbeaf1547e4b5bbc36436850c8303ed968299347f7f8e3"}
{"Ticker":"AMZN","Date":1642573740,"Headline":"Oscar Mayer Launches Bologna-Inspired Face Mask","Source":"Benzinga","Summary":"Kraft Heinz Co (NASDAQ: KHC) owned meat and cold cut production company Oscar Mayer has launched a bologna-inspired face mask.\nThe rejuvenating face masks..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fff0707364eca8770ba220f3d39b1efc8f0b59267790ade24dc386bb7bcf947d"}
{"Ticker":"AMZN","Date":1642573320,"Headline":"2 Data Analytics Stocks That Could Help Set You Up for Life","Source":"Nasdaq","Summary":"The amount of data being produced today is already immense. Roughly 90% of the world's data has been created within just the past two years, yet this will double over the next two years. Every day, the world creates 1.1 trillion megabytes of data, and companies are beginning to g"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2bc7c821479abc9f368a9831c4d37945d056bbc1d80c2eb3436e46cd1e98e02e"}
{"Ticker":"AMZN","Date":1642573200,"Headline":"Is iShares ESG Aware MSCI USA ETF (ESGU) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"Making its debut on 12\/01\/2016, smart beta exchange traded fund iShares ESG Aware MSCI USA ETF (ESGU) provides investors broad exposure to the Style Box - All Cap Growth category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f6b4b146977336aebc25af7e828655407ff9b48b50c304cd2984e51c779cc65"}
{"Ticker":"AMZN","Date":1642573200,"Headline":"Is FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) a Strong ETF Right Now?","Source":"Nasdaq","Summary":"A smart beta exchange traded fund, the FlexShares Morningstar U.S. Market Factor Tilt ETF (TILT) debuted on 09\/16\/2011, and offers broad exposure to the Style Box - All Cap Blend category of the market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9905fd19a3d91317724db7df11646051ab11b76f71a5c9536042489a36717717"}
{"Ticker":"AMZN","Date":1642573200,"Headline":"Should SPDR Portfolio S&P 500 ETF (SPLG) Be on Your Investing Radar?","Source":"Nasdaq","Summary":"If you're interested in broad exposure to the Large Cap Blend segment of the US equity market, look no further than the SPDR Portfolio S&P 500 ETF (SPLG), a passively managed exchange traded fund launched on 11\/08\/2005."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=905fcf072a993f6fbe8210616ee3b7f1528f19707fb8fe1b239c9d6a87f86fc5"}
{"Ticker":"AMZN","Date":1642568400,"Headline":"Big Tech and Foes Spar Over Bill to Curb Market Power of Dominant Internet Platforms","Source":"DowJones","Summary":"Technology companies and their critics are ramping up lobbying efforts in Congress this week as a key Senate panel takes up legislation that seeks to blunt the market power of dominant tech platforms. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1e2c696d66111b5b6e8239f9f0661e8de86272cea78d082674ee1a1a9d7e3e7"}
{"Ticker":"AMZN","Date":1642561500,"Headline":"ANALYSIS-Sony faces deep-pocketed rivals in war over future of gaming","Source":"Nasdaq","Summary":"Sony Group, perched atop the gaming sector, is facing a fresh challenge from cash-rich rivals betting on a next-generation online video game boom as the Japanese conglomerate eyes expansion on multiple fronts, including electric cars."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f83f344c168bc70edad764b9f9727b401c3909667f8ab0f51be599060d2cbefa"}
{"Ticker":"AMZN","Date":1642559888,"Headline":"Professional Financial Advisors, LLC Buys iShares 20+ Year Treasury Bond ETF, Vanguard Total ...","Source":"Yahoo","Summary":"Investment company Professional Financial Advisors, LLC (Current Portfolio) buys iShares 20+ Year Treasury Bond ETF, Vanguard Total World Bond ETF, Vanguard Intermediate-Term Bond ETF, Western Asset Total Return ETF, iShares 7-10 Year Treasury Bond ETF, sells Dollar Tree Inc, SPDR Gold Shares ETF, Invesco Preferred ETF, Calamos Dynamic Convertible and Income Fund, Barclays Bank PLC ZC SP REDEEM 12\/06\/2036 USD 50 during the 3-months ended 2021Q4, according to the most recent filings of the invest"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ee7b0101f4f76137348a0b789c99288dc986b6fe90ff3cba2d2705afe13f6464"}
{"Ticker":"AMZN","Date":1642558044,"Headline":"Oracle opens data centre to provide cloud services across Africa","Source":"Finnhub","Summary":"Oracle opened a data centre in South Africa on Wednesday to provide local cloud services across Africa for the first time, joining the likes of Microsoft and Amazon in setting up facilities in the... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=76c6b9f00f62ffc7efbe79089a8c31a2b958f1b8c84922db7e1fcc140412e122"}
{"Ticker":"AMZN","Date":1642556144,"Headline":"Report: Social commerce challenges e-commerce, pitting Amazon against Meta, TikTok","Source":"Yahoo","Summary":"TikTok isn't trying to be a retailer, but with social commerce on the rise, it could end up being a competitor to Amazon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=44c0f7d0dbc7f34d8b4e4060264007c0080419fc01de2b38fd299a4d7848e39a"}
{"Ticker":"AMZN","Date":1642714952,"Headline":"Amazon: Undervalued And Should Have A Breakout 2022, Buy Now","Source":"SeekingAlpha","Summary":"Amazon is another one of our favorite large-cap stocks for 2022. Read more to see why we urge investors to accumulate AMZN when opportunities arise."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=07ff8b4ab72d1d48cb55cf4d7218aeb395a0df085546059f495f9d2bfc5b4415"}
{"Ticker":"AMZN","Date":1642711500,"Headline":"What to Know About MercadoLibre's Move Into Crypto","Source":"Nasdaq","Summary":"One of the most exciting emerging-markets companies out there is MercadoLibre (NASDAQ: MELI). On this Jan. 12 edition of \"The Crypto Show\" on Backstage Pass, Fool.com contributors Chris MacDonald and Jon Quast discuss how MercadoLibre is looking for solutions to currency volatili"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aaa21ded4343808e1a892e1c6f1dd4ccc675a1c1660ba81101f95ccd698833a3"}
{"Ticker":"AMZN","Date":1642699729,"Headline":"Netflix quietly admits streaming competition is eating into growth","Source":"CNBC","Summary":"Netflix added a line in its quarterly shareholder letter acknowledging streaming competition is affecting its \"marginal growth.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=647c4727b95f510bd5445c657366b1fec0afa3d7c8b5729451fcec4394460acb"}
{"Ticker":"AMZN","Date":1642696519,"Headline":"Italy's antitrust recalculates Apple, Amazon fines after \"material error\"","Source":"Reuters","Summary":"Italy's antitrust regulator said on Thursday it had recalculated the fines for U.S tech giants Apple and Amazon due to a \"material error\" in the first calculation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=446527ce099b6ccdfe07138adc3e6236f3edf257467df48a732e246985bc7df8"}
{"Ticker":"AMZN","Date":1642694522,"Headline":"Amazon.com to Webcast Fourth Quarter 2021 Financial Results Conference Call","Source":"Finnhub","Summary":"Amazon.com, Inc. announced today that it will hold a conference call to discuss its fourth quarter 2021 financial results on Thursday, February 3, 2022, at 2:30 p.m. PT\/5:30 p.m. ET.The event will... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f8edaed7c65d690726353051177107d3bcf4a1addc417a1ab48e0eb6651c9a1"}
{"Ticker":"AMZN","Date":1642694220,"Headline":"Senate Panel Approves Antitrust Bill Restricting Big Tech Platforms","Source":"DowJones","Summary":"Apple, Amazon and Google say the bipartisan legislation barring tech platforms from favoring their own products could disrupt popular services for businesses and consumers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a3431bfcc9a1fb4abdc1ce2cde57dbc87e543bc707ac83a559bc6998cc6aacb3"}
{"Ticker":"AMZN","Date":1642692840,"Headline":"Amazon Is Opening Its First Physical Apparel Store","Source":"Nasdaq","Summary":"(RTTNews) - Amazon.com (AMZN), the e-commerce giant which ended the dominance of brick-and-mortar retail stores, has announced plans to open a physical clothing store in Los Angeles."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1fc99e0c2c5efed163422cd2a73cf0b1457803577cdcf3a1cd141016318ea5f"}
{"Ticker":"AMZN","Date":1642691051,"Headline":"Microsoft's Activision Deal Is A Must - Buy On Weakness","Source":"SeekingAlpha","Summary":"we believe Microsoft has wrapped up a fantastic deal with Activision that should transform its gaming metaverse ambitions. Read more about MSFT stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8f1fa47a8e31597c1ae920fc8840971e72345987393fa952f99fb7fd300ea65"}
{"Ticker":"AMZN","Date":1642690800,"Headline":"Google launches fresh appeal to overturn $2.8 bln fine at top EU court","Source":"Nasdaq","Summary":"Google is filing an appeal at the European Union's top court against an earlier decision to uphold a $2.8 billion antitrust fine, a spokesperson for the Alphabet unit said late on Thursday, the company's second bid to overturn the penalty."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c60c270942171673bdd9048d13eeb1e4630325449c2667b246c46c320e8065eb"}
{"Ticker":"AMZN","Date":1642684440,"Headline":"Bill targeting Big Tech approved by Senate panel","Source":"Nasdaq","Summary":"The U.S. Senate Judiciary Committee on Thursday approved a bill that would bar tech giants like Amazon.com Inc and Alphabet Inc's Google from giving preference to their own businesses on their websites."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=216a7c9b543925791f7220d5bc833cde72775057e535e1ed847bb4f7e120c1fe"}
{"Ticker":"AMZN","Date":1642679336,"Headline":"Amazon heads to the mall with prototype clothing store","Source":"Finnhub","Summary":"NEW YORK — Amazon says it plans to open a clothing store in a Southern California mall later this year, a first for the online behemoth and a fresh challenge for already struggling traditional... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c3f49736bdd0161a2b9376b4262fa3576d77ecb166e0fdf1a08381bc495dc532"}
{"Ticker":"AMZN","Date":1642677840,"Headline":"Netflix could be Activision’s Plan B","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     If Microsoft has kicked off the game of who could buy Activision Blizzard, Netflix could be a surprise winner. The software giant’s $69 billion bid for the maker of “Call of Duty” is likely to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=531db50bddebc105bc99f8b7adcdaa9dc6fb678c54c09a434557492c29e1b2d8"}
{"Ticker":"AMZN","Date":1642676798,"Headline":"EU Parliament agrees on proposal to take on U.S. tech giants","Source":"Finnhub","Summary":"The European Parliament onThursday signed off on a proposal for new rules aimed at U.S.tech giants, paving the way for talks on the plan with membercountries and the European Commission. ... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e329c08e69f2f28b0ca41d11a24c8ce53a98a17ebd1ec5be28b2702e0b70e9a9"}
{"Ticker":"AMZN","Date":1642676400,"Headline":"AMD: 1 Reason to Sell and 3 Reasons to Buy","Source":"Nasdaq","Summary":"Today's video focuses on Advanced Micro Devices (NASDAQ: AMD) and four recent pieces of news affecting its stock price. One could be a reason to sell the stock, but the other three could be seen as reasons to hold or buy. Here are some highlights from the video."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41a2876572103c83e20a3344e9ed0cbd098d1538553a42490239b14365fcc442"}
{"Ticker":"AMZN","Date":1642676160,"Headline":"iShares MSCI ACWI ETF Experiences Big Inflow","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the iShares MSCI ACWI ETF (Symbol: ACWI) where we have detected an approximate $428.6 million dollar inflow -- that's a 2.5% increase week over week in"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=60203c90759b3d4820a13b6c5cec40db5138a6a7ef452c38f54e5cb132647d8e"}
{"Ticker":"AMZN","Date":1642675980,"Headline":"Amazon To Open First Physical Clothing Store: What Investors (And Shoppers) Need To Know","Source":"Benzinga","Summary":"While many retail companies work to expand their online presence, e-commerce juggernaut Amazon.com Inc (NASDAQ: AMZN) is bringing its clothing shopping experience to the..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3c1b8ece5465827eb1b3a0f16e7b2abf06b3e2fbc82be7eb5e93d3d42e5a885e"}
{"Ticker":"AMZN","Date":1642674298,"Headline":"India's Future mulls Supreme Court bid to avoid being named a defaulter - sources","Source":"Finnhub","Summary":"India's Future Group plans to challenge its own lenders in the Supreme Court to avoid being named a defaulter for missing payments, citing its ongoing dispute with partner Amazon.com Inc, three... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=efcace74d1863b53aa02eb941507561d8f9fbb2dc85acc860eee9843b25b9c80"}
{"Ticker":"AMZN","Date":1642674240,"Headline":"Amazon Releases Title, Plot Details Of Upcoming 'Lord Of The Rings' Series","Source":"Benzinga","Summary":"Amazon.com, Inc. (NASDAQ: AMZN) has revealed the title and part of the storyline of its highly anticipated series based on J.R.R. Tolkien’s epic fantasy “The Lord..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d78e0230c6d33e51392224f96995d74d747b17a6fcd751dbf35f2b8df0ef36d9"}
{"Ticker":"AMZN","Date":1642673306,"Headline":"EU Parliament agrees on proposal for new rules aimed at U.S. tech giants","Source":"Finnhub","Summary":"The European Parliament on Thursday signed off on a proposal for new rules aimed at U.S. tech giants, paving the way for talks with member countries and the European Commission, as France seeks a... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=14bfb013606e6b88fb9eece1e68f7969bae147504416745f4fa0bfb2045c0de4"}
{"Ticker":"AMZN","Date":1642673160,"Headline":"US STOCKS-Growth bargains, upbeat earnings take Wall Street higher","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41723a364b6f65901d1188fa99ea089f3e6c418d338aa4e513ef01d51f3bc4af"}
{"Ticker":"AMZN","Date":1642669740,"Headline":"US STOCKS-Wall Street set to open higher after upbeat earnings","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday as upbeat results from American Airlines and Travelers kept the positive momentum going for the fourth-quarter earnings season, a day after the tech-heavy Nasdaq index plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c1cbf1b5be1f96e95e8c74681e0a3e48312870513789e9f5a923ffdb311558f"}
{"Ticker":"AMZN","Date":1642669029,"Headline":"Amazon to open fashion store where algorithms suggest what to try on","Source":"Reuters","Summary":"Amazon.com Inc's recipe for the department store of the future includes algorithmic recommendations and what one corporate director called \"a magic closet\" in the fitting room."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f9fb8822c5f0ec8a12165ef2cc7423060acc5df384576200c7b36a3fd53048e"}
{"Ticker":"AMZN","Date":1642668480,"Headline":"2 Top Tech Stocks Ready for a Bull Run","Source":"Nasdaq","Summary":"Since the end of the Great Recession in 2009, growth stocks have been a driving force on Wall Street. Historically low lending rates and the Federal Reserve's ongoing quantitative easing measures have created a pool of abundant cheap capital that fast-paced businesses have used t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=00c14d26b8c91e3b76520b5544173c4ecb66634cf7dbb2b106f8a2f570f70dbe"}
{"Ticker":"AMZN","Date":1642667400,"Headline":"Dividend Harvesting Week 46 Update, $4,600 Allocated, $312.32 In Annual Dividends Yielding 6.32% Across 60 Positions","Source":"SeekingAlpha","Summary":"After 46 weeks and $4,600 allocated, Dividend Harvesting portfolio is generating $312.32 in annual dividend income. In week 46, I added to my current positions of OHI, PFFA, THW, BRMK, PTY."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61c94c9deb229cd0240529ba4c0482ce0572e980f9e1c2df1b7b82044f666d15"}
{"Ticker":"AMZN","Date":1642664940,"Headline":"U.S. stock futures rise on earnings after Nasdaq enters correction territory","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday on a string of strong earnings led by American Airlines and insurer Travelers, a day after the tech-heavy Nasdaq plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bdbded73dae2ec0cd25707914357b80a3e3e1c932e4f63e807c26c94f979f350"}
{"Ticker":"AMZN","Date":1642664640,"Headline":"Brick and Mortar vs. E-Commerce: Which Retailers Are Thriving Now?","Source":"Nasdaq","Summary":"E-commerce has been ripe territory for investors since the early days of the internet."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bb7e9858351dc28175ae76d1ea26437e44e072132f05bbd3762fdcf877aededd"}
{"Ticker":"AMZN","Date":1642664394,"Headline":"Amazon Unlocks Next Growth Driver","Source":"SeekingAlpha","Summary":"Amazon’s subscription segment grew at over 20% YoY. Check out why I think the company's subscription business could drive AMZN stock price higher long term."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dfe7f589d732ce4bfc44b39c5b0178a4c1dfdfc0d65656adaafa38fd3a324fca"}
{"Ticker":"AMZN","Date":1642664040,"Headline":"Affirm: Great Idea, Not-So-Great Company","Source":"Nasdaq","Summary":"Affirm (NASDAQ: AFRM) entered the market with high hopes of out-innovating and overtaking the many other fintech competitors in the \"buy now, pay later\" market. In 2021, the company experienced large losses and now has an unclear path to profitability. Despite record payment volu"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cd4099cf9a814978b2790eb201428641e696bd391b1628d37840180999618e99"}
{"Ticker":"AMZN","Date":1642662900,"Headline":"Got $3,000? Here Are 2 Stocks to Buy and Hold for the Long Term","Source":"Nasdaq","Summary":"Amazon already had a large-cap valuation a decade ago, but the company still managed to deliver stock gains of roughly 1,710% over the last 10-year period. That performance would have turned a $3,000 investment in the company made in early 2012 into more than $54,000."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c4dbcea8b440beb2aace20d9af459c13e97b522c34bb1e5b0c2bbc2a906f82f"}
{"Ticker":"AMZN","Date":1642661700,"Headline":"2 REITs to Buy With Ultra-Safe Dividends","Source":"Nasdaq","Summary":"Dividends are a great reason to own real estate investment trusts (REITs). For many, they're the main reason.  That steady flow of quarterly (and in some cases, monthly) cash can help bolster retirement income or, for investors of any age, add a bit more profit to the portfolio t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d528c4dad66bddff149a5e9095de6fd276576a98402ebc3a83957b2e99b53312"}
{"Ticker":"AMZN","Date":1642661400,"Headline":"Why I'm Not Touching Alibaba in 2022","Source":"Nasdaq","Summary":"The Chinese e-commerce giant and internet conglomerate Alibaba Group (NYSE: BABA) had a troubled 2021, as it made headlines for various reasons and its shares tumbled by more than 40%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0f5263acb94e777e2c618139971705970b1c43f04034e71314387d255813727c"}
{"Ticker":"AMZN","Date":1642661220,"Headline":"One Growth Stock to Buy in 2022 and Hold for the Next Decade","Source":"Nasdaq","Summary":"The best investing theses are simple. A simple thesis can come from identifying a company serving one or two basic needs for customers with predictable product demand. Examples of these include Amazon (customer convenience when shopping), McDonald's (ready-to-go food), Starbucks"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c4532793fad203e8d5e3ab2292f2c377a02385307822f5bd23b47d272c55bd0a"}
{"Ticker":"AMZN","Date":1642660500,"Headline":"Nasdaq Enters Correction Territory. Will Earnings Stop the Rot?","Source":"MarketWatch","Summary":"Biden says social spending agenda will have to split up, Fed ponders inflation as people consider ‘shock and awe,’ White House distributing 400 million free..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=597909490e36c5dafb5d6f13a99156d99f60939818fe0e3c484e569090595909"}
{"Ticker":"AMZN","Date":1642658700,"Headline":"2 Cheap Tech Stocks to Buy Right Now","Source":"Nasdaq","Summary":"Before the last few months of 2021, the words \"cheap tech stocks\" may have sounded odd. But a massive sell-off in the tech sector has made many strong businesses much more affordable. It's easy to be scared out of investing in a business that has had its stock price crushed, but"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b1d267dd0986c6c4a3736cfc3134683eb682623f400cc20df398e90c674dcb5e"}
{"Ticker":"AMZN","Date":1642658400,"Headline":"Bills targeting Big Tech to go before U.S. Senate panel","Source":"Nasdaq","Summary":"The U.S. Senate Judiciary Committee is set to decide Thursday whether the full Senate should vote on two bills aimed at reining in tech giants like Alphabet's Google and Meta's Facebook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=049446f8bc5a58b7379a12b3430d0cfbc2c7d5ce35fa90c255f21ebc093dc402"}
{"Ticker":"AMZN","Date":1642657860,"Headline":"Is GameStop Stock a Buy?","Source":"Nasdaq","Summary":"Video game retailer GameStop (NYSE: GME) had quite a year in 2021. The company experienced some unique market action and applied an industrial-strength broom to its leadership team."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ef8d3ec4b5770d5689d4de814d25dbe72b4ab46067e24bf0145ff0584318e8b1"}
{"Ticker":"AMZN","Date":1642656960,"Headline":"Amazon To Launch First-Ever Physical Fashion Store  - Everything You Need To Know","Source":"Benzinga","Summary":"Amazon.com Inc's (NASDAQ: AMZN) first physical apparel store Amazon Style, will open later this year at The Americana at Brand, a shopping destination in Los Angeles..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0dc99426a5abe1bf233181de72e7c141957f696c98119a452bb577684ee8b86c"}
{"Ticker":"AMZN","Date":1642655460,"Headline":"Amazon Is Opening a Fashion Store in Los Angeles in Latest Bricks-and-Mortar Move","Source":"MarketWatch","Summary":"This will be its first fashion store which will open later this year in the Los Angeles suburb of Glendale"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6e97ce34074c1f7fe7df4264a53674bf8ac3a0b76f964d602aac36e6ebcd057"}
{"Ticker":"AMZN","Date":1642654080,"Headline":"Amazon to open its first clothing store","Source":"MarketWatch","Summary":"Amazon says it plans to open a clothing store in a Southern California mall later this year"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f00282429f3d23b0465812ad58f6e99a902f7ac80e97ff97789e7c34d86452fe"}
{"Ticker":"AMZN","Date":1642648571,"Headline":"Amazon com : reimagines in-store shopping with Style","Source":"Finnhub","Summary":"Our first-ever physical apparel store offers a personalized, convenient shopping experience where Amazon's technology and operations make it easy for customers to find styles they love at great... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=535bfdd4b1a760ff3d1d0fda2fedce090c66a0c6a493e4c0c3ace45bba48adbf"}
{"Ticker":"AMZN","Date":1642647725,"Headline":"Amazon plans a clothing store for a Southern California mall","Source":"Finnhub","Summary":"NEW YORK — Amazon says it plans to open a clothing store in a Southern California mall later this year, a first for the online behemoth and a fresh challenge for already struggling traditional... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e1834cecb76f530b8d34c92e1fd215e99db8beb2d3c607064bc24e194c13a222"}
{"Ticker":"AMZN","Date":1642644370,"Headline":"Senegalese Logistics and Delivery Company PAPS Raises $4.5m Led By 4DX Ventures and Orange","Source":"Finnhub","Summary":"Multinationals like Amazon and Alibaba have leveraged logistics infrastructure such as UPS and FedEx to create large businesses. It's not the same in Africa, where few third-party infrastructure... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0c4472bb0e536c82dbfaebd40372bd52d4863b26ed0aec9c66445da2f43f651"}
{"Ticker":"AMZN","Date":1642637289,"Headline":"Telenor partners with Amazon to modernise systems, offer services","Source":"Finnhub","Summary":"Norway's Telenor said on Thursday it had partnered with Amazon Web Services to speed up the modernisation of its telecoms systems, boosting the use of cloud technology to offer 5G and low-latency... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=22f8c7ed71b9ad1d70d988df7eed57524cc62ea12d4e807191219c0ae5ada518"}
{"Ticker":"AMZN","Date":1642762800,"Headline":"Amazon Earnings: What to Watch on Feb. 3","Source":"Nasdaq","Summary":"Amazon (NASDAQ: AMZN) is slated to report its fourth-quarter and full-year 2021 results after the market close on Thursday, Feb. 3. An analyst conference call is scheduled for the same day at 5:30 p.m. ET. The period to be reported on is the second quarter that Andy Jassy has bee"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=72e589d6c4c77d14b5028c17e6b64a1e208af06979eae90cb3dcab26e25f69d2"}
{"Ticker":"AMZN","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"AMZN","Date":1642755540,"Headline":"Where Will Snowflake Be in 1 Year?","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) has served its early investors well. Warren Buffett's Berkshire Hathaway invested in this stock before the IPO at a significantly discounted price. When Snowflake ultimately debuted for retail investors, it was priced at more than double the $120 per share"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dffdc165d9582d986761f7986ead652b390f6fc1191e78ad67b6d76e2c3058d"}
{"Ticker":"AMZN","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"AMZN","Date":1642754880,"Headline":"You Can Buy a Lot of Bad Stocks and Still Get Rich","Source":"Nasdaq","Summary":"At the Motley Fool, we have a free service called Motley Fool CAPS. In CAPS, you pick the stocks you think will beat the S&P 500 Index (also known as \"the market\"). In my case, 57% of my stock picks in CAPS beat the market, which means that 43% of my stock picks fail to beat"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ec153e6ebb3faae6b2a91a7f2e2e1aa71e269cacddf868e77e6a35b7050b177"}
{"Ticker":"AMZN","Date":1642752360,"Headline":"Snowflake Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) launched the largest software IPO ever in September 2020. The cloud-based data warehousing company went public at $120 per share, started trading at $245, and hit an all-time high of $405 a share last November.But over the past two months, Snowflake's stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c125abffa32d67037717c3bc79bef2e14e44dca89823945e59098c1a23cea22c"}
{"Ticker":"AMZN","Date":1642750080,"Headline":"US STOCKS-Nasdaq futures weaken after disappointing Netflix forecast","Source":"Nasdaq","Summary":"Futures tracking the Nasdaq 100 index slipped on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dcb16af0503d88a3aca8d90dc9cbcff33a41a77b44e8021f7771e40710461e8b"}
{"Ticker":"AMZN","Date":1642749480,"Headline":"Amazon's Getting Into Physical Clothing Retail. Is That Bad News for Malls?","Source":"Nasdaq","Summary":"The pandemic has changed the way a lot of consumers shop. Though e-commerce was gaining traction for many years prior to the COVID-19 outbreak, digital sales have really exploded from mid-2020 onward as health concerns have kept shoppers away from physical stores."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5d321b99a8caadba4fe94a976e2369173b249f8545ef518280665c9429b77408"}
{"Ticker":"AMZN","Date":1642746600,"Headline":"Got $500? 3 No-Brainer Stocks to Buy Right Now","Source":"Nasdaq","Summary":"The new year looks like it's starting off on the wrong foot for investors. After a 27% increase in 2021, the S&P 500 stumbled in January. Tech stocks continue to fall as the world copes with the relentless economic woes of the pandemic. But that doesn't mean there aren't any"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=270c40244e45d2a4f1b32fbed02983c0439651fd81998d20a5ab7da90b78e4c2"}
{"Ticker":"AMZN","Date":1642743780,"Headline":"3 Beaten-Down Fintech Stocks to Buy on Sale Right Now","Source":"Nasdaq","Summary":"Upsetting signs of inflation and corresponding fear of rising interest rates to combat it are changing how the stock market feels about high-growth fintech stocks. That's because it's easier for companies to grow by leaps and bounds if they have easy access to lots of cheap capit"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ce2cc2e37735602a8695999fb20a5062c3a48bab34a5cccec33d06584e4e2d15"}
{"Ticker":"AMZN","Date":1642741745,"Headline":"Entire Market Value Rule Strikes Again In WDTX","Source":"Finnhub","Summary":"On January 3, 2022, Magistrate Judge Susan Hightower granted a defendant's motion to exclude an expert's damages theory for violating the entire market value rule, reminding plaintiffs everywhere to... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=853b889551690ffbfc414c91899f73d3c565316566692ad8526b38d0d569dd45"}
{"Ticker":"AMZN","Date":1642741560,"Headline":"2 FAANG Stocks to Buy and 1 to Avoid in 2022","Source":"Nasdaq","Summary":"Wall Street delivered another winning year in 2021. The benchmark S&P 500 rocketed higher by 27%, which is more than double its average annual total return of 11% (including dividends) dating back to 1980."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ba9e484bfa42f1dfbf715f794714d924981edb965da51a1490c7edfd73a48f2"}
{"Ticker":"AMZN","Date":1642741260,"Headline":"The Worst Mistake PayPal Investors Can Make Right Now","Source":"Nasdaq","Summary":"High-growth tech stocks have been getting hammered in recent months, thanks to heightened economic uncertainty caused by soaring inflation, the ongoing coronavirus pandemic, and tightening monetary policy. Among this unfortunate group is fintech leader PayPal Holdings (NASDAQ: PY"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f0bbe82185762bc41035140e24e07eefb947211d127af6e54c324dfa710265d"}
{"Ticker":"AMZN","Date":1642740206,"Headline":"The Mercator International Opportunity Fund Q4 2021 Report","Source":"SeekingAlpha","Summary":"Click here to read Mercator International Opportunity Fund's Q4 2021 report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c1965604bc07941452eaf1916653671989f811110d247bc42d7d0c942daa472"}
{"Ticker":"AMZN","Date":1642731989,"Headline":"DoorDash: Why The Stock Is Plummeting","Source":"SeekingAlpha","Summary":"DoorDash's stock is plummeting; I suspect investors are worried about the competition risks. Walmart and Instacart are big same-day grocery delivery companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0dc9b57fb0eaf3efbb1ad30ef5fb5c7ce162b4c10e8f7c3a231316fd2fb32a72"}
{"Ticker":"AMZN","Date":1642762800,"Headline":"Amazon Earnings: What to Watch on Feb. 3","Source":"Nasdaq","Summary":"Amazon (NASDAQ: AMZN) is slated to report its fourth-quarter and full-year 2021 results after the market close on Thursday, Feb. 3. An analyst conference call is scheduled for the same day at 5:30 p.m. ET. The period to be reported on is the second quarter that Andy Jassy has bee"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=72e589d6c4c77d14b5028c17e6b64a1e208af06979eae90cb3dcab26e25f69d2"}
{"Ticker":"AMZN","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"AMZN","Date":1642755540,"Headline":"Where Will Snowflake Be in 1 Year?","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) has served its early investors well. Warren Buffett's Berkshire Hathaway invested in this stock before the IPO at a significantly discounted price. When Snowflake ultimately debuted for retail investors, it was priced at more than double the $120 per share"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dffdc165d9582d986761f7986ead652b390f6fc1191e78ad67b6d76e2c3058d"}
{"Ticker":"AMZN","Date":1642755420,"Headline":"US STOCKS-Nasdaq set for lower open after disappointing Netflix forecast","Source":"Nasdaq","Summary":"The Nasdaq index was set to open lower on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd182de07b41c13f4511f5684471d48549f4e849b92e55665778dc8551bac9a4"}
{"Ticker":"AMZN","Date":1642754880,"Headline":"You Can Buy a Lot of Bad Stocks and Still Get Rich","Source":"Nasdaq","Summary":"At the Motley Fool, we have a free service called Motley Fool CAPS. In CAPS, you pick the stocks you think will beat the S&P 500 Index (also known as \"the market\"). In my case, 57% of my stock picks in CAPS beat the market, which means that 43% of my stock picks fail to beat"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ec153e6ebb3faae6b2a91a7f2e2e1aa71e269cacddf868e77e6a35b7050b177"}
{"Ticker":"AMZN","Date":1642752360,"Headline":"Snowflake Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) launched the largest software IPO ever in September 2020. The cloud-based data warehousing company went public at $120 per share, started trading at $245, and hit an all-time high of $405 a share last November.But over the past two months, Snowflake's stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c125abffa32d67037717c3bc79bef2e14e44dca89823945e59098c1a23cea22c"}
{"Ticker":"AMZN","Date":1642750080,"Headline":"US STOCKS-Nasdaq futures weaken after disappointing Netflix forecast","Source":"Nasdaq","Summary":"Futures tracking the Nasdaq 100 index slipped on Friday after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower, with Wall Street's main indexes headed for another week of losses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dcb16af0503d88a3aca8d90dc9cbcff33a41a77b44e8021f7771e40710461e8b"}
{"Ticker":"AMZN","Date":1642749480,"Headline":"Amazon's Getting Into Physical Clothing Retail. Is That Bad News for Malls?","Source":"Nasdaq","Summary":"The pandemic has changed the way a lot of consumers shop. Though e-commerce was gaining traction for many years prior to the COVID-19 outbreak, digital sales have really exploded from mid-2020 onward as health concerns have kept shoppers away from physical stores."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5d321b99a8caadba4fe94a976e2369173b249f8545ef518280665c9429b77408"}
{"Ticker":"AMZN","Date":1642746600,"Headline":"Got $500? 3 No-Brainer Stocks to Buy Right Now","Source":"Nasdaq","Summary":"The new year looks like it's starting off on the wrong foot for investors. After a 27% increase in 2021, the S&P 500 stumbled in January. Tech stocks continue to fall as the world copes with the relentless economic woes of the pandemic. But that doesn't mean there aren't any"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=270c40244e45d2a4f1b32fbed02983c0439651fd81998d20a5ab7da90b78e4c2"}
{"Ticker":"AMZN","Date":1642743780,"Headline":"3 Beaten-Down Fintech Stocks to Buy on Sale Right Now","Source":"Nasdaq","Summary":"Upsetting signs of inflation and corresponding fear of rising interest rates to combat it are changing how the stock market feels about high-growth fintech stocks. That's because it's easier for companies to grow by leaps and bounds if they have easy access to lots of cheap capit"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ce2cc2e37735602a8695999fb20a5062c3a48bab34a5cccec33d06584e4e2d15"}
{"Ticker":"AMZN","Date":1642741745,"Headline":"Entire Market Value Rule Strikes Again In WDTX","Source":"Finnhub","Summary":"On January 3, 2022, Magistrate Judge Susan Hightower granted a defendant's motion to exclude an expert's damages theory for violating the entire market value rule, reminding plaintiffs everywhere to... | January 21, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=853b889551690ffbfc414c91899f73d3c565316566692ad8526b38d0d569dd45"}
{"Ticker":"AMZN","Date":1642741560,"Headline":"2 FAANG Stocks to Buy and 1 to Avoid in 2022","Source":"Nasdaq","Summary":"Wall Street delivered another winning year in 2021. The benchmark S&P 500 rocketed higher by 27%, which is more than double its average annual total return of 11% (including dividends) dating back to 1980."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ba9e484bfa42f1dfbf715f794714d924981edb965da51a1490c7edfd73a48f2"}
{"Ticker":"AMZN","Date":1642741260,"Headline":"The Worst Mistake PayPal Investors Can Make Right Now","Source":"Nasdaq","Summary":"High-growth tech stocks have been getting hammered in recent months, thanks to heightened economic uncertainty caused by soaring inflation, the ongoing coronavirus pandemic, and tightening monetary policy. Among this unfortunate group is fintech leader PayPal Holdings (NASDAQ: PY"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f0bbe82185762bc41035140e24e07eefb947211d127af6e54c324dfa710265d"}
{"Ticker":"AMZN","Date":1642740206,"Headline":"The Mercator International Opportunity Fund Q4 2021 Report","Source":"SeekingAlpha","Summary":"Click here to read Mercator International Opportunity Fund's Q4 2021 report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c1965604bc07941452eaf1916653671989f811110d247bc42d7d0c942daa472"}
{"Ticker":"AMZN","Date":1642731989,"Headline":"DoorDash: Why The Stock Is Plummeting","Source":"SeekingAlpha","Summary":"DoorDash's stock is plummeting; I suspect investors are worried about the competition risks. Walmart and Instacart are big same-day grocery delivery companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0dc9b57fb0eaf3efbb1ad30ef5fb5c7ce162b4c10e8f7c3a231316fd2fb32a72"}
