{"Ticker":"GOOGL","Date":1641854710,"Headline":"Alphabet Inc. (GOOG) Gains As Market Dips: What You Should Know","Source":"Yahoo","Summary":"Alphabet Inc. (GOOG) closed the most recent trading day at $2,771.48, moving +1.15% from the previous trading session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1de5718e3763e4d5b7b9711e5ae7a467a373b7ae8f03bad45b771af983fd867"}
{"Ticker":"GOOGL","Date":1641854710,"Headline":"Alphabet (GOOGL) Gains As Market Dips: What You Should Know","Source":"Yahoo","Summary":"Alphabet (GOOGL) closed at $2,773.39 in the latest trading session, marking a +1.21% move from the prior day."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cfc816cdf124ab12ea1a1d16708c27ffa42be85a55a92da43100a541ee949caf"}
{"Ticker":"GOOGL","Date":1641854290,"Headline":"Boltwood Capital Management Buys FlexShares Credit-Scored US Corporate Bond Index, ISHARES ...","Source":"Yahoo","Summary":"San Francisco, CA, based Investment company Boltwood Capital Management (Current Portfolio) buys FlexShares Credit-Scored US Corporate Bond Index, ISHARES TRUST, iShares 20+ Year Treasury Bond ETF, Vanguard Intermediate-Term Corporate Bond ETF, iShares Short-Term National Muni Bond ETF, sells SPDR Portfolio Mortgage Backed Bond ETF, iShares MSCI Emerging Markets ETF, Zimmer Biomet Holdings Inc, Block Inc, SPDR Portfolio Intermediate Term Treasury ETF during the 3-months ended 2021Q4, according t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5e6dd8fe7a28a0612689c9e0e61bdebf9abdb30acf45e8c6b286fdddf0d0ffc"}
{"Ticker":"GOOGL","Date":1641852275,"Headline":"Apple is still bigger than all these companies combined","Source":"Yahoo","Summary":"King Apple still towers over its megacap peers despite the tech selloff"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a30df40725bdd7d32dbb07fcaa296c8e4bcda25a70d115ac9473e270b22b05f"}
{"Ticker":"GOOGL","Date":1641850991,"Headline":"The top 50 stocks by market cap in the S&P 500","Source":"Yahoo","Summary":"Jared Blikre dives in the most valuable S&P stocks by market cap."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d3cf4f3bdb88e90c8e28f8953db1e260be088191334c12b0922cdee75efabbea"}
{"Ticker":"GOOGL","Date":1641849086,"Headline":"Will This Company Be The Top Performing FANG Stock Of 2022?","Source":"Yahoo","Summary":"Amazon stock is expected to outperform the other FANG stocks in 2021, says an equity analyst in a research note on Monday"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b4c0be1f8aacb87889c78d6523f1136b7ee5c73c0678f9ef3326d196fa86e332"}
{"Ticker":"GOOGL","Date":1641847595,"Headline":"Signal’s Marlinspike Stepping Down as CEO of Messaging App","Source":"Yahoo","Summary":"(Bloomberg) -- Moxie Marlinspike, the longtime chief executive officer of the encrypted messaging app Signal, announced that he is replacing himself.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameCyprus Finds Covid-19 Infections That Combine Delta and OmicronDip Buyers Drive U.S. Stock Rebound After Selloff: Markets WrapT Cells Triggered by Common Cold Fend Off Covid in StudyMarlinspike, who started"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75941c617af8207f695bbed5abf08388135ff504aa6b58e54497ad705ba8c511"}
{"Ticker":"GOOGL","Date":1641846713,"Headline":"Stocks are still ‘a great buy,’ Momentum Advisors CIO says","Source":"Yahoo","Summary":"Momentum Advisors Chief Investment Officer Allan Boomer joins Yahoo Finance Live to discuss the Fed's policy moves in 2022 and why stocks are still favored over bonds."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b01823605cfb9ad9960db6147655a159ab08b997bdf2dc3c04a8d82b404230e6"}
{"Ticker":"GOOGL","Date":1641845700,"Headline":"This Is Why Investors Should Never Sell a Stock Based Solely on Bad Headlines","Source":"Yahoo","Summary":"In this segment of Backstage Pass, recorded on Dec. 15, Fool contributors Rachel Warren, Danny Vena, and Connor Allen discuss a recent example of this and why selling based on headlines can be a massive mistake for long-term investors.  Rachel Warren: So, Roku (NASDAQ: ROKU), we're going to be talking about Roku.  Shares have plunged earlier in the year when it seems like the company was at an impasse with Google about keeping YouTube apps on its platform, then rose again when the company's reached an agreement, now shares are plunging again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a8f2c8567b5b0b1bc13593271dffa315b2c485bd72621998f2c867f76f9f5fbd"}
{"Ticker":"GOOGL","Date":1641843680,"Headline":"Market outlook for 2022: 'Focus on things that have real earnings value right now'","Source":"Yahoo","Summary":"Brent Schutte, Chief Investment Strategist at Northwestern Mutual Wealth Management, joins Yahoo Finance Live to compare the worth of growth and value stocks, where to find value as stocks in sectors like technology begin to slide, and large and small-cap growth."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=342c5b8c88877841b3715daa1fd9c75cb57aaf2d6131e73ba366106df62c4357"}
{"Ticker":"GOOGL","Date":1641841282,"Headline":"Will Microsoft (MSFT) Stock Deliver Growth in 2022?","Source":"Yahoo","Summary":"Microsoft stock has had a spectacular run in the past couple of years. Will 2022 be a repeat, or will it capitulate to shifting investor preferences?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f5825cef687a714be1490cef4e3053e5a0e1b56bddfcb728066fde107e00cb7f"}
{"Ticker":"GOOGL","Date":1641840713,"Headline":"Big tech is selling off, with households more exposed than ever","Source":"Yahoo","Summary":"Big tech and Internet stocks were under pressure on Monday amid a market sell-off in high-growth stocks. The declines came amid a rising 10-year treasury yield."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=16c13189d4b0309c1412d89b3ccaa498da640e6bc96121795d7b82bd6a694f40"}
{"Ticker":"GOOGL","Date":1641840223,"Headline":"Top 10 Stocks Kettle Hill Capital Management Is Buying","Source":"Yahoo","Summary":"In this article, we take a look at the top 10 stocks Kettle Hill Capital Management is buying. You can skip our comprehensive analysis of Andrew Kurita’s history, investment philosophy, and hedge fund performance, and go directly to Top 5 Stocks Kettle Hill Capital Management Is Buying. Andrew Kurita’s Kettle Hill Capital Management is a […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f935fc5c4ccf912b87b2a04d87713b1c92660a5e2ca7396328017a37cd7ba15b"}
{"Ticker":"GOOGL","Date":1641839100,"Headline":"Car sharing startup Turo reveals revenue surge in IPO filing","Source":"Nasdaq","Summary":"Daimler AG-backed car sharing marketplace Turo Inc on Monday made public its filing for a stock market flotation in the United States and disclosed its finances for the first time, revealing a 207% jump in revenue."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=347cde9177913dbca937b92ace68704757ac490830f65a663999a67147153368"}
{"Ticker":"GOOGL","Date":1641837766,"Headline":"22 No-Brainer Blue-Chip Buys For 2022","Source":"SeekingAlpha","Summary":"2021 was a freakish year of soaring markets and low volatility. 2022 is likely to be the opposite with lower returns. Read more to see 22 blue-chip buys."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=67cceec78ba6a73202bee911aed4616685209eaff13ef9ba1ffff9df44cdfd5d"}
{"Ticker":"GOOGL","Date":1641832735,"Headline":"Why Digital World Acquisition Was Trumpeting a 24% Gain in December","Source":"Yahoo","Summary":"President Trump is planning to return to social media in a big way, but not through the platforms offered by Big Tech.  Because they summarily banned him from their sites following the 2020 elections, he is making an end run around them by launching his own platform and will be merging the Trump Media & Technology Group with special purpose acquisition company (SPAC) Digital World Acquisition (NASDAQ: DWAC) to create a publicly traded business.  What caught many by surprise was Trump Media's announcement to kick off December that it intended to raise $1 billion by selling shares to hedge funds and other private investors in a PIPE, or private investment in public equity, deal."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c880669c0ca2f427c90fc47bd12654992937b48405c2b9138f6d320464317f4"}
{"Ticker":"GOOGL","Date":1641831766,"Headline":"Will Workers Ever Return to the Office?","Source":"Yahoo","Summary":"Many companies are continuing to have some or all of their staff work remotely, while others have switched to hybrid or remote work permanently.  In this segment of Backstage Pass, recorded on Dec. 14, 2021, Fool contributors Demitri Kalogeropoulos, Asit Sharma, and Rachel Warren discuss what that means for the workforce and investors.  Demitri Kalogeropoulos: This is a headline that coming from two days ago from The New York Times."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=393279a5a4011a66a0e9f903e0b8e4dd27e9403981e17511c60f6ff663b71246"}
{"Ticker":"GOOGL","Date":1641831374,"Headline":"My Nifty 50 Stock Portfolio","Source":"SeekingAlpha","Summary":"I'm sharing my 50-stock portfolio update with the world. The portfolio consists of 83.13% equity, 12.68% cash, 4.19% fixed income. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a84acf6f73cfeaf57a1bb37f355d9f6c7c7a2e2cbcb448bc6b8a609469a8ce13"}
{"Ticker":"GOOGL","Date":1641830841,"Headline":"Joe Manchin's former aides gain influential lobbying clients as their ex-boss battles Biden's agenda","Source":"CNBC","Summary":"Former aides to Sen. Joe Manchin who are now lobbyists are scoring big clients as their ex-boss battles President Biden's agenda"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=13c03f30005f651331f2a34931690b9b040475aa5d00ff462ba2e15d7e764365"}
{"Ticker":"GOOGL","Date":1641829323,"Headline":"Alphabet (GOOGL) Adds Trending Section, Game Updates to Stadia","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google is expected to gain strong momentum among gamers with the latest features and updates on Stadia."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3a38dd0e9c4f6d82e866cf4723b5560f683c7d780e9160ceaa38adb2a5ba8625"}
{"Ticker":"GOOGL","Date":1641827220,"Headline":"Why Alphabet Soared by 65.3% in 2021","Source":"Yahoo","Summary":"The Nasdaq Composite index gained 22.2% last year by comparison, so Alphabet's stock surge was nearly triple the magnitude of the rise of the technology-heavy index.  Alphabet is the parent company of Google, one of the most used internet search engines in the world.  Alphabet also owns video-sharing site YouTube and operates a cloud service called Google Cloud."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=eeeff343494c91ff062a150415847631786123f39171d6d41a597245295884f3"}
{"Ticker":"GOOGL","Date":1641826803,"Headline":"Alphabet (GOOGL) to Bring New YouTube Music Feature to Wear OS","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google is gearing up to add a home screen tile to the YouTube Music app for Wear OS, per reports."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=253704d0f03f03062a29e33ac0c1a97267cb2ea2b7ef1002926109cc8ccc4be4"}
{"Ticker":"GOOGL","Date":1641826380,"Headline":"Market Outlook 2022 - Stock Market Review 2021, Outlook On U.S. Stocks And Bonds Next Year","Source":"SeekingAlpha","Summary":"While the S&P 500 performed well in 2021, only 25 of the stocks on the SPX accounted for more than 40% of its weight."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9493b14bcd5b2b50303fd0e83abb592e829d81972dfe62ad25ea78e4fcd066eb"}
{"Ticker":"GOOGL","Date":1641825015,"Headline":"10 Best Tech Stocks to Buy Now According to Nishkama Capital","Source":"Yahoo","Summary":"In this article, we present the list of the 10 best tech stocks to buy now according to Nishkama Capital. You can skip our comprehensive analysis of Nishkama Capital’s history, investment philosophy, and hedge fund performance, and go directly to 5 Best Tech Stocks to Buy Now According to Nishkama Capital. Ravee Mehta’s Nishkama Capital […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=96819cd9c9099c2770e15834b2b74a19da7b7a44fab154fb00debd1f7039b480"}
{"Ticker":"GOOGL","Date":1641823920,"Headline":"In Beverly Hills, Former Google CEO Eric Schmidt Has Paid $65 Million for Microsoft Co-Founder Paul Allen’s “Enchanted Hill”","Source":"DowJones","Summary":"The vacant property came on the market asking $150 million in 2018."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b41e681f44f4628399edc94551df29650cf581dc2ec6fd5ea7feb242019f2511"}
{"Ticker":"GOOGL","Date":1641819947,"Headline":"Is Snowflake Stock A Buy Amid Software Sector Volatility?","Source":"Yahoo","Summary":"Snowflake stock, the biggest software IPO ever, has rebounded. Here is what technical analysis says about buying SNOW stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0da03c6685fea138088f47445cfeef7f44912aab88be21d61cf08c5ca44e7562"}
{"Ticker":"GOOGL","Date":1641816016,"Headline":"Big Data, Privacy & Advertising: System1 Founder & CEO in Fireside Chat","Source":"Yahoo","Summary":"IPO Edge and the Palm Beach Hedge Fund Association hosted a fireside chat with the CEO & Co-Founder of System1, LLC to discuss an overview of the company, System1’s […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=25aaa06b3159471eff2c7e4d9f6ece0fc38ffea3f017a78f3f404bd1f5cfc7bb"}
{"Ticker":"GOOGL","Date":1641814020,"Headline":"Notable ETF Inflow Detected - SPY, MSFT, GOOGL, FB","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the SPDR— S&P 500— ETF Trust (Symbol: SPY) where we have detected an approximate $6.8 billion dollar inflow -- that's a 1.5% increase we"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3baf4b54d6c4b0e435b76adfd0a5bd6d95fac5c40f27b0fe0975024f13c80ae2"}
{"Ticker":"GOOGL","Date":1641812760,"Headline":"Investing in This ETF Right Now Could Make You a Millionaire Retiree","Source":"Yahoo","Summary":"There are more than 2,500 ETFs out there, so it's fair to find the thought of picking the best one, or a very good one, daunting.  When choosing an ETF, many people opt for the SPDR S&P 500 ETF (NYSEMKT: SPY), which is evident from the fund's No. 1 ranking among the biggest ETFs.  Consider investing those long-term dollars in the Vanguard Total Stock Market ETF (NYSEMKT: VTI) instead, though."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aea087f44653098d2fddb20f07958c205e4eacebcfa85a5019d2af6bc28a8f35"}
{"Ticker":"GOOGL","Date":1641812400,"Headline":"Down 60%, Is This ARK Invest Favorite a Buy Now?","Source":"Nasdaq","Summary":"In this video, I will be talking about one of Cathie Wood's favorite stocks, Roku (NASDAQ: ROKU). The stock is down 61% since its all-time highs, and the business has gone through some turbulent times. You can find the video below, but here are some highlights."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bfc41052f462e39347fd5d39ddbd259313e1bbd9db7352bc5ca009f52490f8d6"}
{"Ticker":"GOOGL","Date":1641812220,"Headline":"Want to Get Richer? 2 Top Stocks to Buy Now and Hold Forever","Source":"Yahoo","Summary":"This strategy has certainly paid off in the past: If you bought $10,000 in Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) 10 years ago, you would have almost $52,000 today.  If you can find companies with strong competitive advantages and hold them for decades, you will likely become much richer over the long term.  In 2021, shares of MercadoLibre fell 24%, and some investors are wondering if the company will recover. MercadoLibre got swept up in the tech sell-off, but -- like many other stocks that fell in 2021 -- the company is performing stronger than ever."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d0587c3ab4808299f3c694903ae8b50f9f93f271cd8b765aa4f8ea00b8538caa"}
{"Ticker":"GOOGL","Date":1641812039,"Headline":"It's A Bear Market, No Wait, It's A Bull Market","Source":"SeekingAlpha","Summary":"A lot of digital ink is spilled debating whether we are in a continued bull market or when the next market crash will arrive. Read what to know here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54d260ad37c17a04b1230d6e64f11427bd6c231d46f8231b4a49166dd0016730"}
{"Ticker":"GOOGL","Date":1641811560,"Headline":"Flux Crypto Turns Up Web 3.0 Development With Nvidia Partnership","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c138af860790b0ad35a36f9061d8477cda5647ac8744b0b5d82ed1b88de26499"}
{"Ticker":"GOOGL","Date":1641808800,"Headline":"3 Reasons Why Austin is a Homebuyer's Dream in 2022","Source":"Nasdaq","Summary":"Austin, Texas, fell from the No. 1 spot in 2021 to No. 10 in 2022 on Zillow's list of hottest housing markets in America. Tampa, Florida, has assumed the top spot, but Austin is still a very robust market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=14aeb2dbe08e2af639c8281878779151fc56efb1078af62e6ead5a281658e98d"}
{"Ticker":"GOOGL","Date":1641807180,"Headline":"Benzinga Asks: Which Company Could Join The $1-Trillion Market Cap Club Next? Did NVDA, TSM, BRKA Or TCEHY Win?","Source":"Benzinga","Summary":"Several of the largest technology companies made headlines in 2021 for hitting significant market capitalization milestones.\nMicrosoft Corp (NASDAQ: MSFT) hit a $2-trillion market..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=36cdad239316c49c6bfaa7654643f204a7a793f32f002d0246509d9c824c7132"}
{"Ticker":"GOOGL","Date":1641804000,"Headline":"How to Beat the S&P 500 in 2022","Source":"Nasdaq","Summary":"Famous investor Warren Buffett is famous for (among other things) winning a bet that money parked in an S&P 500 (SNPINDEX: ^GSPC) index fund would outperform professional money managers over 10 years. It's not easy to consistently beat a collection of the world's largest and most"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afadb65b82cea7ebda29107f534ec77be0814d7da41c125b1196569864ae78a3"}
{"Ticker":"GOOGL","Date":1641798765,"Headline":"Intel Drops A Bomb On The Robotaxi Industry","Source":"SeekingAlpha","Summary":"Intel’s (INTC) Mobileye is currently in volume production of SuperVision. Check out why I think Mobileye is well positioned in autonomous driving space."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=081fa64835b7e6196279200f15da5dc9cdc87a2aaf93189aa7d048a737bc37b7"}
{"Ticker":"GOOGL","Date":1641795869,"Headline":"Insider Weekends: Co-Founder Of EverQuote Acquires $1.45 Million Worth Of Stock","Source":"SeekingAlpha","Summary":"EverQuote and its competitors SelectQuote and GoHealth have seen insider buying in recent months. I am intrigued by EverQuote and will add it to my watchlist."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=480cd62879859fd57bd706709585ec6a3795e810d868e159920614515c315c09"}
{"Ticker":"GOOGL","Date":1641794100,"Headline":"Big Tech Stocks: What’s in Store for 2022?","Source":"Nasdaq","Summary":"Big tech stocks have witnessed a fair amount of selling over the past month. Valuation concerns and uncertainty regarding the COVID-19 pandemic led to a selloff in tech stocks. The chart below shows that big tech companies are trading in the red, while Apple (NASDAQ:AAPL) and Meta Platform (NASDAQ:FB) barely managed to stay in the green over the past month. \n\n\n\n\n\n\n\nWith tech stocks currently under pressure, let’s look at each of these tech giants to ascertain what the future holds for them in 2022.\n\n\n\nApple \n\n\n\nDespite supply-chain concerns, Apple delivered a solid financial performance in FY21. Strong sales across all product categories and strength across all of its geographies drove Apple’s financials, and in turn, its stock, which outperformed the benchmark index in 2021. \n\n\n\nLooking ahead, demand for Apple products is likely to outpace supply, as noted by Wedbush analyst Daniel Ives. The analyst is bullish on Apple stock. He sees higher demand and the easing of supply-chain issues in the first half of 2022 as a tailwind for Apple stock. Moreover, Ives noted that higher average selling prices provide a multi-year growth opportunity. \n\n\n\nBesides robust demand and higher selling prices, Ives expects Apple to gain from its growing market share in China. \n\n\n\nOverall, the majority of analysts are bullish on Apple stock. Its Strong Buy consensus rating is based on 21 Buys, 3 Holds, and 1 Sell. However, hedge funds have been selling Apple stock. TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 4 million Apple shares over the past three months. \n\n\n\nAmazon \n\n\n\nTough comparisons, cost inflation, and supply-chain disruptions weighed on Amazon’s (NASDAQ:AMZN) financial performance in 2021, and in turn, its stock price. Amazon stock underperformed the Nasdaq 100 Index by a wide margin in 2021. \n\n\n\nGiven the near-term challenges, investors and hedge funds have a negative outlook on Amazon stock. TipRanks’ Stock Investors tool shows that about 1.3% of investors holding portfolios on TipRanks have sold AMZN stock in the last 30 days. Meanwhile, hedge funds have lowered their holdings by 576.2K shares in three months. \n\n\n\nNevertheless, Monness analyst Brian White is bullish on Amazon for 2022. He expects Amazon’s growth to accelerate in the 2H22. Further, White noted that AWS’ (Amazon Web Services) revenue growth has accelerated over the past three quarters, while Amazon is well-positioned to benefit from an “accelerated digital transformation.” \n\n\n\nAlong with White, most Wall Street analysts maintain a bullish outlook on Amazon stock. AMZN has received 30 positive analyst reviews for a unanimous Strong Buy consensus rating. \n\n\n\nAlphabet\n\n\n\nAlphabet (NASDAQ:GOOGL) stock delivered strong returns in 2021 and outperformed its peers, thanks to the stellar recovery in ad sales and the strength of its cloud business. \n\n\n\nLooking ahead, Alphabet could benefit from higher advertising revenues and growth in the cloud segment. Further, its balance sheet and cash flows remain strong. \n\n\n\nTaking note of its strong cash flows, Ivan Feinseth of Tigress Financial stated that Alphabet would continue to boost shareholders’ returns through share buybacks and fund its growth initiatives on the back of its robust cash flows. \n\n\n\nFeinseth sees Alphabet benefiting from secular tech trends, including video sharing, cloud computing, growing mobile engagement, and the ongoing shift to digital advertising, among others. \n\n\n\nOn TipRanks, Alphabet stock sports a Strong Buy consensus rating based on 26 Buy and 2 Hold recommendations. Furthermore, 1.9% of the investors holding portfolios on TipRanks have increased their exposure to GOOGL stock over the last 30 days. \n\n\n\nMicrosoft \n\n\n\nThanks to the strength in its cloud business, Microsoft (NASDAQ:MSFT) stock increased over 49% in one year and outperformed the benchmark index. Despite the appreciation in its share price, Jefferies analyst Brent Thill is upbeat about Microsoft’s prospects and maintains a bullish outlook on the stock. Thill increased his price target on Microsoft to $400 from $375. \n\n\n\nThill sees Microsoft as the “safest largecap investment option” with multiple growth vectors. The analyst expects Microsoft to continue to enhance shareholder value on the back of its strong profitability and free cash flows. However, he expects Microsoft’s top-line growth to moderate a bit in the coming quarters. \n\n\n\nOverall, on TipRanks, Microsoft stock has received 24 Buys and 1 Hold for a Strong Buy consensus rating. Furthermore, it scores a 9 out of 10 on TipRanks’ Smart Score system, indicating that MSFT stock could outperform the market averages.\n\n\n\nMeta Platforms \n\n\n\nFacebook changed its name to Meta Platforms to better reflect a metaverse company. However, investors and hedge funds continue to dump their stock. \n\n\n\nTipRanks’ Stock Investors tool shows that about 0.7% of investors holding portfolios on TipRanks have sold FB stock in the last 30 days. Meanwhile, TipRanks’ Hedge Fund Trading Activity tool shows that hedge funds have sold 1.7 million Meta Platforms shares over the past three months. \n\n\n\nMonness analyst Brian White noted, “The longer-term journey for Facebook became more intriguing in the later part of 2021 with the company introducing its vision for the metaverse, followed by a name change to Meta Platforms.” \n\n\n\nHowever, he expects Apple’s app tracking transparency to continue to hurt Meta Platforms in the future. \n\n\n\nNevertheless, he maintains a Buy rating on Meta Platforms and expects it to benefit from favorable digital ad trends and digital transformation opportunities. Meanwhile, on TipRanks, FB stock has a Strong Buy consensus rating based on 28 Buys and 5 Holds. \n\n\n\nDownload the TipRanks mobile app now\n\n\n\nDisclosure: On the date of publication, Amit Singh had no position in any of the companies discussed in this article.\n\n\n\nDisclaimer: The information contained in this article represents the views and opinion of the writer only, and not the views or opinion of TipRanks or its affiliates  Read full disclaimer >"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ad7ecad6f79af73a490aeb5d07b2c44237170a1621ad933f89c841e7c8d7063"}
{"Ticker":"GOOGL","Date":1641791880,"Headline":"Microsoft & Google Shares Witness Worst Drop since Pandemic","Source":"Nasdaq","Summary":"Shares of American technology giants Microsoft Corporation (MSFT) and Alphabet Inc. Class A (GOOGL) has fallen the most in the past week, since the start of the pandemic.\n\n\n\nOne of the top metaverse stocks, MSFT declined 6.4% and GOOGL lost more than 5% in the first week of trading for the new year 2022. This has been the largest weekly slump for both companies since March 2020.\n\n\n\nRising Treasury Bond Yields\n\n\n\nThe yield on the U.S. 10-year Treasury bonds increased to 1.77% on Friday, its highest level since January 2020. The upward spike caused high growth stocks, especially technology stocks, to fall.\n\n\n\nAn increasing yield indicates an inflationary environment, which means companies will face higher borrowing costs to fund development. From the investor's perspective, a rising yield means they expect more returns on their investments. Both factors add pressure to the performance of high-growth companies.\n\n\n\nAnother factor that led to the overall downfall was the latest jobs report, which showed a slump in the unemployment rate as well as an increase in wages.\n\n\n\nOn Friday, MSFT sank by as much as 1.2% and GOOGL fell 1.4%. The iShares Expanded Tech-Software Sector ETF also slipped as much as 1.7% on Friday, and for the past week it was down 8.7%.\n\n\n\n2021 was a favorable year for the tech sectors as the pandemic-driven shifts led to major spending on tech services. Microsoft gained 45.6% over the past year and Alphabet gained 56%. Meanwhile, the tech-laden NASDAQ 100 gained about 25% last year.\n\n\n\nAnalysts’ Weigh In\n\n\n\nRecently, Wedbush analyst Daniel Ives issued a report about the upcoming earnings season for the disruptive technology stocks. The analyst says the Street is laser-focused on the stocks’ 2022 guidance.\n\n\n\nIves said, “In this vacuum of Fed news and watching every tick of the 10-year yield move on an hourly basis, tech investors wish 4Q earnings season was already here today. The absence of fundamental news for the tech space in this risk-off environment has catalyzed a brutal surge of selling tech names to kick the year off in 2022 as valuation scrutiny remains front and center for investors.”\n\n\n\nMicrosoft remains his favorite large-cap stock. Ives has a Buy rating on the stock and a price target of $375, which implies 19.4% upside potential to current levels.\n\n\n\nOverall, the MSFT stock commands a Strong Buy consensus rating based on 24 Buys and 1 Hold. The average Microsoft price target of $371.36 implies 18.3% upside potential to current levels.\n\n\n\n\n\n\n\nDownload the TipRanks mobile app now\n\n\n\nRelated News:Bed Bath & Beyond Misses Q3 Expectations; Meme Frenzy Drives the Shares UpNikola Signs LOI with Saia; Shares Soar Above 9%Uber to Stop Uber Eats Restaurant Delivery in Brazil"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=760c85ce392996aac0ba344d1675419c886e99e77ffbeeb27f25666a496eedc6"}
{"Ticker":"GOOGL","Date":1641785760,"Headline":"Sector Themes In Play In The Markets For 2022","Source":"SeekingAlpha","Summary":"Dips will continue to be bought unless something significant changes. Click here for more..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6d62d8f286b6960b7a4db16d3b514067ec4d996e1556715b87302038aa4bdd9"}
{"Ticker":"GOOGL","Date":1641774821,"Headline":"'Dump Stocks That Don't Make Money' We Hear, I Say Poppycock! Also My Trades","Source":"SeekingAlpha","Summary":"The market is suffering from a lack of visibility, and opportunists hoping to sell value stocks are trying to scare people out of tech names. I would rather they take the long view."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a1b3c19426fdcf6e894f2b747866f9b1519357870b882d1fb86f094009f27b88"}
{"Ticker":"GOOGL","Date":1641941170,"Headline":"Google’s Staff Get Pricey Fast Covid Tests While Contractors Wait","Source":"Yahoo","Summary":"(Bloomberg) -- Google offers its full-time employees working from home a supply of high-end instant Covid-19 tests. Meanwhile, the contract workers still coming into offices have to wait longer for results.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorRepeat Booster Shots Spur European Warning on Immune-System RisksEurope Slowly Starts to Consider Treating Covid Like the FluStocks Halt Five-Day Rout After Powell’s Remarks: Markets WrapSingapore Breaks Down Cov"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cf8617b3f44f15b0ae88b882a35b66740961b46e57680a7c08ebca84a1ecf657"}
{"Ticker":"GOOGL","Date":1641936537,"Headline":"Market check: Nasdaq stocks stage comeback, Dow and S&P 500 close near all-time highs","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down a market chart comparing Nasdaq stock returns."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc781f9dc0d816a54852aa527687fb106d56cc0af2eba684a6ae26075650023f"}
{"Ticker":"GOOGL","Date":1641932288,"Headline":"Amazon (AMZN) Boosts AWS Portfolio with New EC2 Instances","Source":"Yahoo","Summary":"Amazon's (AMZN) AWS announces the general availability of purpose-built Amazon EC2 instances, Hpc6a, which are designed for HPC workloads."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02ca621e7981391ef637e5661418b066caa2ea1544dc2fa607053d36fd71647b"}
{"Ticker":"GOOGL","Date":1641931200,"Headline":"Investor Highlights: Square's Acquisition of Afterpay","Source":"Nasdaq","Summary":"Square, now Block (NYSE: SQ), has gone through its fair share of changes lately -- its name change being the most obvious. But the company is also taking another huge step in the form of a $29 billion acquisition of Australian fintech company Afterpay (OTC: AFTP.F). The purchase"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bfcea3bc9e332e5b57ee592bf598b013d19dc019047956359a123fd5db94b705"}
{"Ticker":"GOOGL","Date":1641929399,"Headline":"Market strategist: The issue with tech stocks is ‘simply one of valuation’","Source":"Yahoo","Summary":"Simeon Hyman, ProShares Global Investment Strategist, joins Yahoo Finance Live to discuss how the market and investors may be expected to react to Fed Chair Powell's confirmation hearing, inflation pressures, interest rates, the tech sector, and the market growth outlook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=157d122d4facee31f8fcf81e926af8bbac0341b48817889348ec80ae4e5a33e1"}
{"Ticker":"GOOGL","Date":1641928483,"Headline":"Google accused of punishing Indian news site after tycoon investment deal","Source":"Yahoo","Summary":"Google has been accused of stifling an Indian news website that criticised billionaire businessman Mukesh Ambani after the search engine invested in his company."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9e33b0e6771c26dc134aae8f17283bf51e58c1c007ec7e66e91ccfe42ed4902"}
{"Ticker":"GOOGL","Date":1641926287,"Headline":"Linden Rose Investment LLC Buys Apple Inc, Alphabet Inc, Amazon. ...","Source":"Yahoo","Summary":"Investment company Linden Rose Investment LLC (Current Portfolio) buys Apple Inc, Alphabet Inc, Amazon.com Inc, Berkshire Hathaway Inc, sells Sea, Pinduoduo Inc, Shopify Inc, Fiverr International, Tencent Holdings during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Linden Rose Investment LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ea1004d44bc1b750997aef7ed9326b3148d9b2b4c1ba0dea29e078f0782664f7"}
{"Ticker":"GOOGL","Date":1641923854,"Headline":"Here's Why Dropbox Stock Rose 10% in 2021","Source":"Yahoo","Summary":"Solid growth drove Dropbox higher last year -- until November, when investors generally started to lose their enthusiasm for work-from-home stocks."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9b6f92ddf47522eb2aa6c1d0445ab8d4f15a7e7344aca7faabb5a862cd7d33ef"}
{"Ticker":"GOOGL","Date":1641920160,"Headline":"Android CEO Wants Apple To Join Hands","Source":"Nasdaq","Summary":"(RTTNews) - The feud between android and Apple Inc (AAPL) about the \"blue bubble\"  has apparently subsided as Hiroshi Lockheimer has now taken a milder route to ask Apple to join hands."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e156c67b0f376560cfa730b27bda4580a632b1307c5080168514072d1579420f"}
{"Ticker":"GOOGL","Date":1641920121,"Headline":"Apple's Tim Cook made $98M in 2021 — how that compares to other tech CEOs","Source":"Yahoo","Summary":"Apple CEO Tim Cook made $98 million in 2021. Here's how that compares to other major tech CEOs."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=83476b2936ed1a93f5564b75ba25716a7699a7dfff77a5269b17b69a7bb2a643"}
{"Ticker":"GOOGL","Date":1641918988,"Headline":"Two of Sen. Kyrsten Sinema's former aides have lobbied for corporate giants looking to influence Joe Biden's agenda","Source":"CNBC","Summary":"Two of Sen. Kyrsten Sinema's former aides have become key aides for corporate giants looking to impact President Joe Biden's agenda. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=111d6e9729960e1e46abdebcd8343a198181d97fb8199a6e39514c548ccced61"}
{"Ticker":"GOOGL","Date":1641916800,"Headline":"4 Stocks I'm Watching This Week as Potential Buys","Source":"Yahoo","Summary":"Today's video focuses on the following four stocks I am keeping my eye on this week: Roku (NASDAQ: ROKU), Meta Platforms (NASDAQ: FB) (formerly known as Facebook), Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG), and Roblox (NYSE: RBLX)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa885ce86141c32c4adb32e2cd3bcfc579a1f971d8cac63676f67db383d8acf7"}
{"Ticker":"GOOGL","Date":1641916560,"Headline":"FUBO Stock Price Predictions: Where Will fuboTV Head in 2022 and Beyond?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46d1725aae043215b1fb6a815316ec1d0964d33b794f8e912f1cda748111870f"}
{"Ticker":"GOOGL","Date":1641913980,"Headline":"Best Stocks To Buy Right Now? 3 Automotive Stocks In Focus","Source":"Nasdaq","Summary":"Top Automotive Stocks To Check Out This WeekAutomotive stocks have been a hot topic of discussion among investors over the past few years. The stock market offers plenty of exciting prospects and the automotive industry is at the top of the list. Whether it is electric vehicles ("," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ccb4c6b42d3f7c39110f080925fdfd07a393b463be2575d30d5199266f159fb9"}
{"Ticker":"GOOGL","Date":1641913800,"Headline":"Twitter Could Lose Market Share to Growing Alternative Social Media","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d5c97ff9cce233d427846d6f98506799918a4df1a186bcf83be16d6cda0cd631"}
{"Ticker":"GOOGL","Date":1641913683,"Headline":"Apple (AAPL) App Store Revenues Reach $60 Billion in 2021","Source":"Yahoo","Summary":"Apple (AAPL) App Developers have generated revenues worth $260 billion from the App Store since its launch in 2008"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=34dd486c8a50a280933adc4d5e02de331b8368e2e6853b41644b02941ab2694d"}
{"Ticker":"GOOGL","Date":1641911569,"Headline":"Recalibrated Fed expectations have ‘shaken the confidence of markets’: Strategist","Source":"Yahoo","Summary":"Kate Moore, BlackRock head of thematic strategy for the global allocation team, joins Yahoo Finance Live’s Julie Hyman and Brian Sozzi to discuss the outlook for the 2022 stock market, prospects for growth, changes in the consumer, major investment themes, and digital transformation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=95439b536b182acf3e831de343bd0350e931e80500e5b7d5e2e49df12b329d93"}
{"Ticker":"GOOGL","Date":1641911220,"Headline":"Noteworthy Tuesday Option Activity: AMZN, CMG, GOOGL","Source":"Nasdaq","Summary":"Among the underlying components of the S&P 500 index, we saw noteworthy options trading volume today in Amazon.com Inc (Symbol: AMZN), where a total of 201,757 contracts have traded so far, representing approximately 20.2 million underlying shares.  That amounts to about 69"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=88a05101f7418ab3218c777be96dac7c25adc30dfe92028aeb4c46c52ca5c3c6"}
{"Ticker":"GOOGL","Date":1641909966,"Headline":"These 2 Stocks Could Threaten Tuesday's Market Bounce","Source":"Yahoo","Summary":"Investors have been surprised by the way 2022 has started, with steep drops on most stock market indexes.  Wall Street tried to mount a comeback on Tuesday morning, though, in the hopes of getting back on a bullish path.  S&P 500 (SNPINDEX: ^GSPC) futures had picked up 15 points to 4,678, while Nasdaq Composite (NASDAQINDEX: ^IXIC) futures had risen 79 points to 15,687."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=48306180f25af87ec2b21b56879e9117159f0f41ca37ae6346b688f09d6218a7"}
{"Ticker":"GOOGL","Date":1641908634,"Headline":"Google starts public fight with Apple over ‘blue bubbles’ on iMessage","Source":"Yahoo","Summary":"Google has started a public fight with Apple over the “green bubbles” that appear when their users message each other.  The system is intended at least in part to distinguish between iMessages, which are sent over the internet, and traditional texts.  After that report was published, Google seized on its to criticise Apple for not playing its part in making messages easier to send between different operating systems."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8ded946f29711047195369b70018418e1b1523cfada13286cc5fdd7e1e2044b2"}
{"Ticker":"GOOGL","Date":1641904620,"Headline":"Google Faces Shareholder Pressure to Amend Repairs Policy","Source":"Finnhub","Summary":"By Maitane Sardon Alphabet Inc., the parent company of Google, is facing pressure from an environmentally-focused investor to allow customers to fix their own devices to reduce electronic... | January 11, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=653d27b8a569b45a4b461564e92521868a667725429f7ba636ea843f29690694"}
{"Ticker":"GOOGL","Date":1641903779,"Headline":"Arista Networks: Long Play On The Future Of Virtual Machines","Source":"SeekingAlpha","Summary":"Arista Networks is a full-service data center supplier well-positioned for 2022. Demand remains high due to data center demand. Read what this means for ANET."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=636b51ffa2ff326fadae9eca5b6a4b9c1f567e938f3414979bdbd82db75d1f9f"}
{"Ticker":"GOOGL","Date":1641901800,"Headline":"Digital ad hogs leave room at the trough","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     Alphabet’s Google and Meta Platforms’ Facebook are the big hogs at the digital advertising trough. But smaller online players needn’t to starve as the pie is expanding rapidly. That’s an"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=720c2402413d2585c05a5b498e55abaec805d10366b693c194a26d8497372eef"}
{"Ticker":"GOOGL","Date":1641900868,"Headline":"10 Best Low Cost Tech Stocks to Buy Right Now","Source":"Yahoo","Summary":"In this article, we discuss the 10 best low cost tech stocks to buy right now. If you want to skip our detailed analysis of the tech sector, go directly to 5 Best Low Cost Tech Stocks to Buy Right Now. Over the last two decades, the stock market has owed much of its gains […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6aab12e345baff5a3f3163c59ff09e67e1ff1e4ef0b22651a04858da9b57c94f"}
{"Ticker":"GOOGL","Date":1641896740,"Headline":"How DigitalOcean Stock Could Grow 10x In 10 Years","Source":"SeekingAlpha","Summary":"DigitalOcean is a relatively small company with a huge opportunity in the fast growing SMB IaaS\/PaaS space. Learn more about DOCN stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c8a649792836873cf4452789b960902aeadbcb2c468ff9010d215a6c4542420"}
{"Ticker":"GOOGL","Date":1641895800,"Headline":"3 Top Tech Stocks Under $20 Per Share","Source":"Nasdaq","Summary":"You don't need to have thousands of dollars to begin investing. If you have only $20, you can still buy shares of high-quality stocks. Your future self might thank you for investing that $20 instead of buying pizza tonight -- because investing $100 or even $20 can help you build"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=273f335370a49ff4d6981b68b275d9bf1700cdc38417caa366b87ecfc99b6d9f"}
{"Ticker":"GOOGL","Date":1641895200,"Headline":"Huawei Ranks No. 5 in U.S. Patents in Sign of Chinese Growth","Source":"Yahoo","Summary":"(Bloomberg) -- Huawei Technologies Co. is continuing to move up the list of companies getting the most U.S. patents, according to a new study of patenting activity that shows Chinese firms are increasingly responsible for a greater share of the world’s innovation.Most Read from BloombergCypriot Scientist Says Deltacron Covid Variant Isn’t ErrorWorld’s Biggest Crypto Fortune Began With a Friendly Poker GameSingapore Breaks Down Covid Deaths by Vaccine, With Moderna Seeing Lowest RateDip Buyers Dr"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=16155b7f08314bb1dffdc77cefc43e4541c63354e25a59a81213ac2b00605b90"}
{"Ticker":"GOOGL","Date":1641883300,"Headline":"UPDATE 1-Apple submits plans to allow alternative payment systems in S.Korea - regulator","Source":"Yahoo","Summary":"South Korea's telecommunications regulator said on Tuesday that Apple had submitted plans to allow third-party payment systems on its app store, to comply with a law banning major app store operators from forcing software developers to use their payments systems.  The Korea Communications Commission (KCC) had requested Apple Inc and Alphabet's Google to submit compliance plans after the bill was passed in August last year."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0b30097e063464ec264b8ee13aee13ea0fd58747b53718f6400d529b43090b32"}
{"Ticker":"GOOGL","Date":1641881700,"Headline":"Will Investors See a Tech Sector Market Top in 2022?","Source":"Nasdaq","Summary":"The tech sector is extremely broad. It is filled with trillion-dollar behemoths like Microsoft (NASDAQ: MSFT), legacy providers like IBM (NYSE: IBM), and fast-growing upstarts like Crowdstrike (NASDAQ: CRWD). It spans hardware, software, cybersecurity, financial technology, and m"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aadf7928707d36b2da8a985b1e48a1022a2a724fa7844604ab2b066147c246a2"}
{"Ticker":"GOOGL","Date":1641880380,"Headline":"Apple Holding Back Improved Text Messaging For Both iOS and Android Users, Alleges Google Exec","Source":"Benzinga","Summary":"Apple Inc (NASDAQ: AAPL) is holding back evolved Text messaging by not incorporating the “industry standard” on iMessage, a Google executive said Monday.\nWhat..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e02683b9fab52345490e297890cdb2e0c131f98b9351a248adc60d7b0f911602"}
{"Ticker":"GOOGL","Date":1641870600,"Headline":"10 Things Will Define The Digital Transformation In 2022","Source":"SeekingAlpha","Summary":"Consumers are shopping more online for retail products – some 30 percent of them, according to the latest PYMNTS study."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dea48832fe876dfa054ba255ece49c55d1bcc8d013133b853fb061cef663ec54"}
{"Ticker":"GOOGL","Date":1641865260,"Headline":"Apple submits plans to allow alternative payment systems in S.Korea - regulator","Source":"Nasdaq","Summary":"South Korea's telecommunications regulator said on Tuesday that Apple had submitted plans to allow third-party payment systems on its app store, to comply with a law banning major app store operators from forcing software developers to use their payments systems."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=706ac8ff625fa102294a35c07c49ff252b28ca53a444aa6055a81f55ae671946"}
{"Ticker":"GOOGL","Date":1642027094,"Headline":"Stonnington Group, Llc Buys Microsoft Corp, The Home Depot Inc, UnitedHealth Group Inc, Sells ...","Source":"Yahoo","Summary":"Investment company Stonnington Group, Llc (Current Portfolio) buys Microsoft Corp, The Home Depot Inc, UnitedHealth Group Inc, Costco Wholesale Corp, Alphabet Inc, sells Upstart Holdings Inc, Apollo Global Management Inc, Roku Inc, DoorDash Inc, Monster Beverage Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Stonnington Group, Llc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b78ddc4f98b2819742b97de1ab27d93ba49ad0f88c445ae08188fdc3b07c9fc6"}
{"Ticker":"GOOGL","Date":1642027082,"Headline":"White Lighthouse Investment Management Inc. ...","Source":"Yahoo","Summary":"Investment company White Lighthouse Investment Management Inc. (Current Portfolio) buys iShares Short Treasury Bond ETF, iShares MSCI USA ESG Optimized ETF, Pfizer Inc, iShares J.P."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f17ca814b407f1f8fb199a7dc6568d3cd897ace1322f8fc2a96a47541971f014"}
{"Ticker":"GOOGL","Date":1642020728,"Headline":"Alphabet (GOOGL) Boosts Workspace Efforts with New Updates","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google rolls out email update widget, a Picture-in-Picture feature in Meet and shortcuts support on Google Sheets for iOS."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3db1964b254578d0d852b7b11ad3d168adc4d78356bc594a80e662942c044907"}
{"Ticker":"GOOGL","Date":1642018423,"Headline":"Video Highlights – Big Data, Privacy & Advertising: System1 Founder & CEO in Fireside Chat","Source":"Yahoo","Summary":"IPO Edge and the Palm Beach Hedge Fund Association hosted a fireside chat with the CEO & Co-Founder of System1, LLC to discuss an overview of the company, System1’s […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2c6162c120379279a6da2d0dfc6c0e9d6e23b4aca83d559709c3962bb535295d"}
{"Ticker":"GOOGL","Date":1642016954,"Headline":"Microsoft Hires Key Apple Engineer to Work on Custom Chips","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp. lured away a veteran semiconductor designer from Apple Inc. as it looks to expand its own server-chips efforts, according to people with knowledge of the matter. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Starts to Consider Treating Covid Like the FluJ&J Vaccine Gets Additional Warning on Bleeding Side"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49cfd6e269330830547c952747668e3fa8be73f87bb84f880e8818cff8945227"}
{"Ticker":"GOOGL","Date":1642015898,"Headline":"Nancy Pelosi Latest Portfolio: 5 Stocks to Watch","Source":"Yahoo","Summary":"In this article, we discuss the 5 stocks to consider in the latest portfolio of that Nancy Pelosi. If you want to skip our detailed analysis of these stocks, go directly to Nancy Pelosi Latest Portfolio: 2 Stocks to Watch. The stock trading activities of lawmakers on both sides of the aisle have come under […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5d5fa8586b878e9b5888739caea7f705a81f96d3bd3d69d7cae49fbb3a0595d"}
{"Ticker":"GOOGL","Date":1642012687,"Headline":"Eastover Investment Advisors LLC Buys Royal Dutch Shell PLC, iShares Core U.S. ...","Source":"Yahoo","Summary":"Investment company Eastover Investment Advisors LLC (Current Portfolio) buys Royal Dutch Shell PLC, iShares Core U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c18699e8a221bd8706c47c376440cd963969abcc4c4f93ac9b8b317ee9a5ba91"}
{"Ticker":"GOOGL","Date":1642012320,"Headline":"Do Alphabet, Meta, Netflix Represent Value Plays?","Source":"Yahoo","Summary":"Veteran value investor Bill Nygren of Oakmark sees them as good buys, given their strong venture capital and base businesses."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3174fee566a62574f666ffb40a5f928701a8b2897bc1c6545c624c9b8dcf4e31"}
{"Ticker":"GOOGL","Date":1642011253,"Headline":"Amazon must improve this if it wants the stock price to go up: analyst","Source":"Yahoo","Summary":"Amazon needs to be more transparent, says one long-time Wall Street analyst."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=619eb1e62a3cad9b99f16366c6d4478cd9d38aae3fe695cb2a9110027c5e643c"}
{"Ticker":"GOOGL","Date":1642008805,"Headline":"U.S. trade official raises concerns about Canada's proposed digital services tax","Source":"Finnhub","Summary":"Deputy U.S. TradeRepresentative Jayme White expressed Washington's ongoingconcern about Canada's proposed digital services tax in talks onWednesday with Canada's deputy trade minister, David... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b676c5735e9730dc530bb8dd8d90fc88f5d6e8a1eccc324d705d9ce98b0d90e5"}
{"Ticker":"GOOGL","Date":1642006440,"Headline":"US STOCKS-Wall Street closes higher as inflation data supports Fed bets","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after data showed that while U.S. inflation was at its highest in decades, it largely met economists' expectations, cooling some fears that the Federal Reserve would have to pull back support even more forcibly than already expected."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=33cb30cb6f6514ce6628dbdc37019e3126f7954e55451d67f33db97b06da9579"}
{"Ticker":"GOOGL","Date":1642006440,"Headline":"Google Reportedly Makes Contract Workers Wait For Tests While Full-timers Get High-end Kits","Source":"Nasdaq","Summary":"(RTTNews) - Tech giant Alphabet Inc.'s  (GOOGL) search engine company Google is using discriminatory policies against its contractors regarding Covid-testing. Reports claim that the company sends high-end and more efficient instant test kits to its full-time employees whereas the"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff23aca40355c3af67ad44b384702aee6b5f1bd839a0f8217d8d1ea83b330d11"}
{"Ticker":"GOOGL","Date":1642003298,"Headline":"10 Stocks to Buy According to David Fear’s Thunderbird Partners","Source":"Yahoo","Summary":"In this article, we discuss 10 stocks to buy according to David Fear’s Thunderbird Partners. If you want to skip our detailed analysis of these stocks, go directly to 5 Stocks to Buy According to David Fear’s Thunderbird Partners. Thunderbird Partners is a London-based hedge fund which manages a portfolio worth $834.3 million as of […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1343160ee6d8755e310b640b656f723c742ad8c6e80d5ea4f1502ee6d3f3b874"}
{"Ticker":"GOOGL","Date":1642002911,"Headline":"Shark Tank’s Kevin O’Leary thinks 2022 is the year of NFTs","Source":"Yahoo","Summary":"Shark Tank investor and crypto-convert Kevin O’Leary believes non fungible tokens will be bigger than bitcoin."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0213279793ff92a8b0006f9d3a0b0b48e2cf5fc319f197eb83e8cd5f84f02fef"}
{"Ticker":"GOOGL","Date":1642000560,"Headline":"The 10 Best Closed-End Funds (CEFs) for 2022","Source":"Nasdaq","Summary":"If someone offered to sell you a dollar for 90 cents … well, you'd probably think it was too good to be true. Yet these are exactly the kinds of opportunities that arise in the market's best closed-end funds (CEFs)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be0058210f2b869827bfc940ac739e6712e9a89c183bd688dfbb26f96a6a010a"}
{"Ticker":"GOOGL","Date":1641999113,"Headline":"10 Tech Stocks to Buy According to Select Equity Group","Source":"Yahoo","Summary":"In this article, we discuss 10 tech stocks to buy according to Select Equity Group. If you want to skip our detailed analysis of these stocks, go directly to 5 Tech Stocks to Buy According to Select Equity Group. Select Equity Group is a New York-based employee-owned hedge fund, founded in the early 1990s. The […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4a19132777d02f609a8b2478d35ac88cfddb5008ddc8a40c2bc4c00949c186db"}
{"Ticker":"GOOGL","Date":1641998285,"Headline":"Hikari Power Ltd Buys Alphabet Inc, Vanguard Health Care ETF, Bristol-Myers Squibb Co, Sells ...","Source":"Yahoo","Summary":"Tokyo, M0, based Investment company Hikari Power Ltd (Current Portfolio) buys Alphabet Inc, Vanguard Health Care ETF, Bristol-Myers Squibb Co, Jack Henry & Associates Inc, Parker Hannifin Corp, sells Anheuser-Busch InBev SA\/NV, The Kraft Heinz Co, Amarin Corp PLC, ADMA Biologics Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Hikari Power Ltd."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=60caeec84a5faa632483531474f87a28598d32bb73cc8dea5a5c54451c2816d3"}
{"Ticker":"GOOGL","Date":1641991020,"Headline":"Nuro Unveils 3rd-Gen Autonomous Delivery Vehicle, Expands Partnership with Kroger","Source":"Benzinga","Summary":"This post contains sponsored advertising content. This content is for informational purposes only and not intended to be investing advice.\n\nNuro, the autonomous vehicle maker..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6b2ea9d59df0fa148fdeb04015e364a820b2d00d4ca38684edfb514001d4b915"}
{"Ticker":"GOOGL","Date":1641991020,"Headline":"US STOCKS-Wall St inches up after in-line inflation data eases investor fears","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with megacap technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=744ab1c4ba5e3f04d8360a8f26260ee86c1e11ab5ec99f328d2c421502b59cb5"}
{"Ticker":"GOOGL","Date":1641990000,"Headline":"Apple's (AAPL) Interests Lies in AR Than in the Metaverse","Source":"Nasdaq","Summary":"Apple’s AAPL augmented-reality (“AR”) ambitions are well-known. In fact, CEO Tim Cook is known to be a fan of AR technology. The iPhone-maker’s rumored headset is the most anticipated product in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3850c084579560562cd09b01f37670d705925bb96508bcfc4b7607b957a2ddd4"}
{"Ticker":"GOOGL","Date":1641986520,"Headline":"Decentraland (MANA) Price Predictions: What’s Next for the Fast-Growing Metaverse Play?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7db0afe130b831ed38047ce46d0cc6a49223d913666fbce247743356371a73c8"}
{"Ticker":"GOOGL","Date":1641984720,"Headline":"2 Cryptocurrencies That Have Trounced Bitcoin and Shiba Inu During the Crypto Crash","Source":"Yahoo","Summary":"Bitcoin (CRYPTO: BTC), the biggest cryptocurrency on the market, has bitten the dust so far in the new year.  Cryptocurrency prices, in general, have fallen significantly in recent days.  Here are two cryptocurrencies that have trounced Bitcoin and Shiba Inu during the current crypto crash."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=895a100266e060bac3ac01774569a795682dba957540036afa3bc9def7bfaf60"}
{"Ticker":"GOOGL","Date":1641984420,"Headline":"EXCLUSIVE: Unusual Whales Creates 'Nancy Pelosi ETF' So You Can Track Her Trades","Source":"Benzinga","Summary":"Members of U.S. Congress are permitted to buy and sell stocks and options in public companies as long as they publicly disclose their trades. The rule has come under scrutiny..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a0d4b2e7c9be28b7c1039ff064f903e7f51ebf796fc3314f73bcc06048ded81e"}
{"Ticker":"GOOGL","Date":1641982440,"Headline":"Wall St rises as in-line inflation data calms nerves","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after consumer prices data that largely met expectations eased some concerns about faster-than-expected interest rate hikes, with big technology stocks offering the biggest boost."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d84f0cad02ab8738f6ff4f8c26ddd8c1eb2d45dde9bf40ff37a82dd380bf4cf"}
{"Ticker":"GOOGL","Date":1641980946,"Headline":"German watchdog says Google agrees to remove Showcase from general searches ","Source":"Reuters","Summary":"Alphabet's Google has offered to remove News Showcase content from general search results in a bid to end a competition investigation into the selection of news in the product, Germany's Federal Cartel Office said on Wednesday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=26bcbae8826c262b52018a7de89af648b3f03ad62b9ef652273fcb696f09706d"}
{"Ticker":"GOOGL","Date":1641978953,"Headline":"Roku Got Some Very Good News, Should You Buy?","Source":"SeekingAlpha","Summary":"Roku has two potential paths to profit: advertising and commissions. I am short-term bullish but long-term bearish. Read why I assign a neutral rating to ROKU."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4bd737c944778add6c42d1dc90dba15dfb7349a440b9a6baf3beb45115893474"}
{"Ticker":"GOOGL","Date":1641977710,"Headline":"Airbnb: Expensive, But Worth It","Source":"SeekingAlpha","Summary":"I believe Airbnb's (ABNB) hosting may challenge traditional hotels in coming years. However, check out why I believe ABNB stock is a buy at today's levels."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17187accfe40aa0927547bd8859e3cf5293800f757ecba70d90d61313eee08d4"}
{"Ticker":"GOOGL","Date":1641973306,"Headline":"Watchdog says Google offers to exclude Showcase from general searches in Germany","Source":"Finnhub","Summary":"Google has offered to removeGoogle News Showcase content from general search results inGermany in a bid to end a competition inquiry, the country'sFederal Cartel Office said on Wednesday. ... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3af2c61decd32accac4138c7a6fadc3e1f3b62f9936b3ce2aba1aca7da5454e8"}
{"Ticker":"GOOGL","Date":1641962122,"Headline":"German watchdog says Google agrees to remove Showcase from general searches","Source":"Finnhub","Summary":"Alphabet's Google hasoffered to remove News Showcase content from general searchresults in a bid to end a competition investigation into theselection of news in the product, Germany's Federal... | January 12, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aa6ec409389155f6b14e412816660f63ea356cab9e2dd4f3c60aa4cca7eb4d75"}
{"Ticker":"GOOGL","Date":1641951960,"Headline":"France's OVHcloud picks up speed in Q1, on track for 2022 targets","Source":"Nasdaq","Summary":"French cloud computing company OVHcloud reported on Wednesday a rise of 13.9% in its first-quarter revenue, and said it was on track to achieve its full-year objectives."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0b8f9e42cecf5d8c1e05f10fa15c812956cd99774ddde6362813d43557defe2"}
{"Ticker":"GOOGL","Date":1641949200,"Headline":"Investor Highlights: Square's Acquisition of Afterpay","Source":"Yahoo","Summary":"In this segment of Backstage Pass, recorded on Dec. 17, Fool contributors Toby Bordelon, Travis Hoium, Jason Hall, and Lou Whiteman discuss.  Toby Bordelon: I like this one, Travis, because it's in the news today, or not the deal itself, but the industry we're talking about.  You've got Square and Afterpay, what's going on here?"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=79805c44ee637bc282deef699ac291c0178a72e376ab293618a4239a213000d7"}
{"Ticker":"GOOGL","Date":1642113123,"Headline":"Twitter, Meta Among Companies Subpoenaed in House Riot Probe","Source":"Yahoo","Summary":"(Bloomberg) -- Facebook parent Meta Platforms Inc., Twitter Inc., Alphabet Inc.’s YouTube and Reddit Inc. are being subpoenaed to turn over posts, videos and other material to the House committee investigating the Jan. 6 attack on the U.S. Capitol, the panel’s chairman announced Thursday.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingSupreme Court Blo"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cd40f8c3c43dc939e604d7b6926b4751764785c76c561784cd8dda703e394485"}
{"Ticker":"GOOGL","Date":1642109400,"Headline":"Google, Facebook, Twitter and Reddit subpoenaed by House select committee investigating Jan. 6 Capitol riot","Source":"Yahoo","Summary":"The House select committee investigating the deadly Jan. 6 Capitol riot has subpoenaed the parent companies of Google and Facebook as well as social media companies Twitter Inc. and Reddit Inc., the panel’s chairman said Thursday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a31e8624ccbfe9d6f15ca122b72c103249be4740d845d26b22b844361bf135c8"}
{"Ticker":"GOOGL","Date":1642107987,"Headline":"Gamestop and AMC up to 2022 'greatest win in retail trading history': 40 Finance host","Source":"Yahoo","Summary":"Geoff Beers, host of the 40 Finance YouTube channel, joins Yahoo Finance to discuss the rise of meme stocks like GameStop and AMC over the past year, retail investing trends, energy stocks, earnings season, and the outlook for the stock market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2aae93492dd1568bb2eb77aa68aab3ce021b9be60109299c0db024c175e6e71"}
{"Ticker":"GOOGL","Date":1642107060,"Headline":"Jan. 6 Panel Subpoenas Reddit, Twitter and Parent Companies of Google and Facebook","Source":"DowJones","Summary":"The House select committee investigating last year’s attack on the U.S. Capitol issued subpoenas to Alphabet, Meta Platforms, Reddit and Twitter, after receiving what the committee called inadequate responses to its prior requests for information."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ddb8736f6752fe58ce775619fe0857078118a9c4d94f212f72b959e349bf552a"}
{"Ticker":"GOOGL","Date":1642106760,"Headline":"Jan. 6 Committee Subpoenas Facebook, Twitter, Google and Reddit","Source":"Yahoo","Summary":"Tech giants have failed to turn over information about plotting and coordination of insurrection on their platforms, committee alleges."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=340a5a01642e636b64c39ad961ec80b93bb59d956c783660e2fe79ad9a5042eb"}
{"Ticker":"GOOGL","Date":1642105133,"Headline":"Market check: Nasdaq poised to end three-day streak, tech and health care lag","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down the stock market latest and the sell-off in tech."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e72a88298405fb9115ac2c5731012499107fb979c5450644eb2a5baeec2658e"}
{"Ticker":"GOOGL","Date":1642102779,"Headline":"Why Shopify Stock Cratered on Thursday","Source":"Yahoo","Summary":"Shopify rolled out new algorithms in mid-December that resulted in several updates.  In addition to minor changes to image requirements, it also included significant modifications to how the platform recommends apps that help fill out Shopify's robust ecosystem.  Many developers pay for advertising to drive traffic to their apps in Shopify's App Store."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1adc9c154511641e7b780396d9ede36e48fd469e548187f935b5b6312c622cd0"}
{"Ticker":"GOOGL","Date":1642099123,"Headline":"Several Pittsburgh companies make 2022 JUST Capital rankings","Source":"Yahoo","Summary":"JUST Capital, a firm that works to help companies improve how they serve their stakeholders, released its annual rankings of the most “just” public companies in the country—and several Pittsburgh names made the list."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa6f7390b074658476c71af509497ac3d636516ffce9737bfbab5c3d2320f504"}
{"Ticker":"GOOGL","Date":1642096162,"Headline":"Earnings: ‘Margins are going to be under attack’ in Q1, strategist says","Source":"Yahoo","Summary":"John Hancock Investment Management Co-Chief Investment Strategist Matt Miskin joins Yahoo Finance Live’s Zack Guzman and Akiko Fujita to discuss inflation, supply chain disruptions, and the earnings growth outlook for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e6fb3c9fb3fbd5a792766b323d69f4ea8d91696305bc86e945aa1be879ceaef"}
{"Ticker":"GOOGL","Date":1642096074,"Headline":"3 mega-cap tech stocks that will gain big as interest rates rise: analyst","Source":"Yahoo","Summary":"Shopping for some tech bargains ahead of the Federal Reserve's rate hikes? Try these on for size, says one veteran tech analyst."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=569765feba01b1a8d5da367ab5155adf45eef5ced093958a61b080de449f33cb"}
{"Ticker":"GOOGL","Date":1642093581,"Headline":"10 Energy Dividend Stocks to Buy According to Billionaire Jim Simons’ Portfolio","Source":"Yahoo","Summary":"In this article, we discuss 10 energy dividend stocks to buy according to billionaire Jim Simons’ portfolio. If you want to skip our detailed analysis of these stocks, go directly to 5 Energy Dividend Stocks to Buy According to Billionaire Jim Simons’ Portfolio. Jim Simons, an American billionaire hedge fund manager, founded Renaissance Technologies in […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1e74183fd43e900c17b33ea51801923be9b4959f528b8af73cfdd6a878d6dfc"}
{"Ticker":"GOOGL","Date":1642092011,"Headline":"Supreme Court vaccine mandate ruling won't bar companies from demanding Covid shots for workers — Biden vows to advocate for that","Source":"CNBC","Summary":"President Biden urged companies to voluntarily impose Covid vaccination rules on workers after the Supreme Court blocked a government order to do that."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=02855b44c057214e24defd3ad2d6a77304657e1178951553d53f39e861729cea"}
{"Ticker":"GOOGL","Date":1642091400,"Headline":"U.S. House panel subpoenas social media firms in Jan. 6 attack probe","Source":"Nasdaq","Summary":"The U.S. House committee investigating the Jan. 6 attack on the Capitol subpoenaed Meta, Alphabet, Twitter and Reddit on Thursday, seeking information about how their social media platforms were used to help fuel misinformation in a failed bid to overturn the 2020 presidential election."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff13e44753549b7d4e8fb6ab98be9c653cf618201a21b63c591dc9ad253358ed"}
{"Ticker":"GOOGL","Date":1642089840,"Headline":"Amazon Is the Latest Fall of the Cloud Czars","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=de9868bcd095950c7a02144d02b79bba93743db6b17bd0deaad4114ab18569f9"}
{"Ticker":"GOOGL","Date":1642089824,"Headline":"S&P 500 Slides as Tech Rally Fizzles","Source":"Yahoo","Summary":"By Yasin Ebrahim"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=62d9cfb2829a5a9c04b5cb01c0b4fd4e4e216a8d729122e18d343bb2d4d87b70"}
{"Ticker":"GOOGL","Date":1642089180,"Headline":"Breakthrough Transplants Signal BIG Opportunity","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3b414f2b4b2ab564c5eac1af38b2282f7246d8bec2dd1878c246e536d9f0265c"}
{"Ticker":"GOOGL","Date":1642089056,"Headline":"S&P 500 Stumbles as Tech Wreck Resumes","Source":"Yahoo","Summary":"By Yasin Ebrahim"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0b4d60ef27fddb052cb1179736a666353e5ccdb6acbcdfbb0c5faa09bf3e7d5a"}
{"Ticker":"GOOGL","Date":1642087320,"Headline":"Competition Everywhere: The Fall of FuboTV Stock","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=346c1e889c605a8134f684e0e56e6bec7f27b85018c2f875ba104545cfe71f7f"}
{"Ticker":"GOOGL","Date":1642086829,"Headline":"Workers ‘should be able to organize without any interference’: U.S. Labor Secretary","Source":"Yahoo","Summary":"U.S. Labor Secretary Marty Walsh sits down with Yahoo Finance's Editor-in-Chief Andy Serwer to discuss workers unionizing at companies like Starbucks and Amazon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afa3f3aad8bd460ebec99a2e066492415a33965c9302711f5891a36d99c0b2b0"}
{"Ticker":"GOOGL","Date":1642083337,"Headline":"Here’s Why You Should Think About Investing in Alphabet (GOOG)","Source":"Yahoo","Summary":"Guardian Fund, an investment management firm, published its fourth-quarter 2021 investor letter – a copy of which can be downloaded here. In 2021, the return of the Guardian Fund was 3.27%, measured in euros and net of fees and expenses. This compares to 28.71% for the S&P 500 Index, measured in U.S. dollars, and including […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55596f840d01f3b5c9da64e60ca6978f76b6f8a6898bf1358b6d514a07ec081c"}
{"Ticker":"GOOGL","Date":1642082400,"Headline":"4 Reasons to Invest in Nvidia's AI in 2022","Source":"Yahoo","Summary":"Nvidia (NASDAQ: NVDA) has a long history of creating innovative and in-demand technology, and it's doing it again with artificial intelligence.  In this Backstage Pass clip from \"The AI\/ML Show\" recorded on Jan. 5, Motley Fool contributor Danny Vena explains why Nvidia is a top pick for investors interested in this space.  Danny Vena: When you talk about a company that's been around for a while, Nvidia actually is one of the pioneers in graphics processing."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f9fd66a1f88b5d13ed9c9c85da77244f38d52a3ab84670e2dc8e0800d15b08d7"}
{"Ticker":"GOOGL","Date":1642078800,"Headline":"7 Amazing Companies to Watch in 2022","Source":"Yahoo","Summary":"A positive work environment can lead to long employee retention rates, boost office morale, and improve production and workflow. Today's video focuses on seven companies with high Glassdoor ratings, ranking them as some of the best companies to work for in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a1819a9548be60b482c43491b9b68b15e9f808e8947d54d93dadfca6dfc5be7a"}
{"Ticker":"GOOGL","Date":1642077422,"Headline":"Long Live The Long Bond Or: How Stock Investors Can Learn To Stop Worrying About Inflation And Love U.S. Treasuries","Source":"SeekingAlpha","Summary":"Stock investors dismiss the long bond at the peril of their portfolios. In many ways, it holds the key to your stock total return dreams. Read why here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=acad0cd68fc4f10fddee8dcb9be93e7042a27cb3d3964b4672a16ab2588bfb45"}
{"Ticker":"GOOGL","Date":1642075500,"Headline":"Better Buy: Microsoft vs. Alphabet","Source":"Yahoo","Summary":"Microsoft (NASDAQ: MSFT) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) were two of the best-performing tech stocks of 2021.  Over the past 12 months, Microsoft's stock price rallied 45% as Alphabet's stock advanced 59%.  Microsoft splits its sprawling business into three main segments: Productivity and Business Processes (Office, Dynamics, and LinkedIn), Intelligent Cloud (Azure and its other cloud services), and More Personal Computing (Windows, Xbox, Surface, Bing, and online advertising)."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=867b4d9364ab5647d34c81ec19b5d11e5af26b5adc42f54b41472d265a90c973"}
{"Ticker":"GOOGL","Date":1642074660,"Headline":"Some Big Companies Have Plenty of Covid-19 Tests for Employees. Others Aren’t So Lucky.","Source":"DowJones","Summary":"Google, Salesforce.com and other companies have secured tests to allow some workers to keep coming into the office during Omicron, while some have struck out. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=63123e058c932456d9a757d97975937bfca81965df3d42a7504fa580cdb4d94b"}
{"Ticker":"GOOGL","Date":1642072200,"Headline":"Where Will Zoom Video Communications Be in 3 Years?","Source":"Yahoo","Summary":"Zoom Video Communications (NASDAQ: ZM) has gone on a wild ride since its IPO in April 2019.  The video conferencing company went public at $36 per share, and its shares started trading at $65 on the first day.  Zoom's stock subsequently skyrocketed in 2020 as its brand became synonymous with video calls throughout the pandemic, and its shares hit an all-time high of $588.84 that October."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=863771f76d6535cb63e8f03558d7bbf78565256f7d0aa343d47ab80aed1e6588"}
{"Ticker":"GOOGL","Date":1642068363,"Headline":"Google will finally make smart watches better for left-handed people - but only if you buy a new one","Source":"Yahoo","Summary":"‘Our development team has implemented the feature you have requested and will be available on future new devices’, a Google employee said"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7600861f624daee2603ab5e755b18097afe1e0709ece8b97b523de26d928b9ab"}
{"Ticker":"GOOGL","Date":1642068128,"Headline":"White House will meet execs from Apple, Amazon, IBM to discuss software security","Source":"Yahoo","Summary":"The White House will meet executives from leading tech firms, including Alphabet-owned Google, Apple Inc and Amazon.com Inc, on Thursday to discuss software security after the United States suffered several major cyberattacks last year.  In December, White House National Security Advisor Jake Sullivan sent a letter to chief executives of tech firms after the discovery of a security vulnerability in open-source software called Log4j that organizations around the world use to log data in their applications.  In the letter, Sullivan noted that such open source software is broadly used and maintained by volunteers and is a \" key national security concern.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f308595ee4942af67a6996c764dc04079bb1cea3744689450a11984e9cfc298"}
{"Ticker":"GOOGL","Date":1642067337,"Headline":"Top Stocks Not To Miss From Glassdoor's 2022 Rankings","Source":"SeekingAlpha","Summary":"Since 2009, Glassdoor has released a yearly ranking of the Best Places To Work. Glassdoor just revealed its 2022 ranking. See the top stocks from the rankings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=75fc4555b24e4e1610d94a57bfe12fa6cacaacb09798029f1650d6eaea39d66c"}
{"Ticker":"GOOGL","Date":1642066280,"Headline":"Alphabet : Statement of Changes in Beneficial Ownership (Form 4)","Source":"Finnhub","Summary":"Ownership Submission FORM 4 Check this box if no longer... | January 13, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=68c6cf39e7d53ad9c727c6f99190a813e3898f3fb8ff6f5a04885f404b615af6"}
{"Ticker":"GOOGL","Date":1642062600,"Headline":"Dividend Harvesting Week 45 Update, $4,500 Allocated, $298.44 In Annual Dividends Yielding 6.25% Across 60 Positions","Source":"SeekingAlpha","Summary":"Even though 2021 was a strong year for the markets overall, some segments got decimated. Check out Dividend Harvesting for week 45 and my game plan for week 46."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d614f381216d8d40a8755032fbd6ac8d73b317e559e39f06d0b7d042daa81374"}
{"Ticker":"GOOGL","Date":1642061580,"Headline":"3 Reasons Asana Can Be a Long-Term Winner","Source":"Nasdaq","Summary":"Since its debut to the public markets in September 2021, work management software specialist Asana (NYSE:ASAN) has taken investors on a roller coaster ride.  Despite that turbulence, Asana's business has been thriving, and the company looks poised to be a long term winner for thr"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=edbcc17e36d7151944f4f55502f30cadb8996c290bd29c0df8e9e008ec89e9e6"}
{"Ticker":"GOOGL","Date":1642060020,"Headline":"10 Best Stocks to Buy on the Nasdaq Right Now","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=672305cc27e23c02e77618b6f63164e50d0aa0c83aaec25d2dde137f5f293d38"}
{"Ticker":"GOOGL","Date":1642059180,"Headline":"US STOCKS-Futures muted ahead of data; Delta Air rises on strong earnings","Source":"Nasdaq","Summary":"U.S. stock index futures were muted on Thursday ahead of jobless claims data and fresh inflation figures that are expected to give more cues on the Federal Reserve's tightening policy, while Delta Air Lines led gains among carriers on strong earnings."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2ada7d2bbc3c3c06d8fb802f0e1207915990089e8931fe7d99ebf16da29be555"}
{"Ticker":"GOOGL","Date":1642056300,"Headline":"My Favorite Metaverse Stock for 2022 Has 25% Upside","Source":"Nasdaq","Summary":"One of the world's largest companies underwent a complete makeover in 2021. Social network titan Facebook changed its name to Meta Platforms (NASDAQ: FB) and pointed its focus at developing the metaverse. Some people believe it's the next frontier, a digital economy where the phy"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cb6521122c0b4623a539b95ff7bb3e28e285e52983dd685185409c6695874dc1"}
{"Ticker":"GOOGL","Date":1642044775,"Headline":"Finally, I Found Alpha In 2021","Source":"SeekingAlpha","Summary":"Finding alpha regularly is not easy. Read this article to know how my portfolio performed in 2021 and check out my plans for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=450786c52f5f27ee9f1f8943fe754036a0667f53adadc9e4d26ed317c9d198c9"}
{"Ticker":"GOOGL","Date":1642020887,"Headline":"House Leaders Near Deal on Stalled China Competition Bill","Source":"Yahoo","Summary":"(Bloomberg) -- The U.S. House of Representatives is preparing to move forward on a China competitiveness bill that would authorize billions of dollars in funding to boost U.S. research and development as well as aid for the domestic semiconductor industry, according to a leadership aide.Most Read from BloombergFrequent Boosters Spur Warning on Immune ResponseCannabis Compounds Prevented Covid Infection in Laboratory StudySay Goodbye to Self-Isolating, WFH Mandates, Mass TestingEurope Slowly Star"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d625b3db269b01523b4ea654297c5a15df5dcc5877779de88b56ebec19bdda7f"}
{"Ticker":"GOOGL","Date":1642036200,"Headline":"YouTube allows misinformation to thrive, fact-checkers say","Source":"Yahoo","Summary":"More than 80 fact checking organizations are calling on YouTube to address what they say is rampant misinformation on the platform.  In a letter to CEO Susan Wojcicki published Wednesday, the groups say the Google-owned  (GOOG)  video platform is “one of the major conduits of online disinformation and misinformation worldwide.”  YouTube’s efforts to address the problem, they say, are proving insufficient."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9f8ad04e48ded928f40b564833056e968ca30eb9704811705b9daf231189199c"}
{"Ticker":"GOOGL","Date":1642202338,"Headline":"Google is mandating temporary Covid-19 testing at its U.S. offices","Source":"Yahoo","Summary":"Planning to go into a Google office in the near future, either as an employee or a visitor? Then plan on taking a weekly Covid-19 test and prepared to wear a mask while you're there."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b8e650c566a4b522a348d4cd3810d32499a7e88944e0b466f81c05a9d4cb4664"}
{"Ticker":"GOOGL","Date":1642200709,"Headline":"Google mandates weekly COVID-19 tests for people entering U.S. offices","Source":"Reuters","Summary":"Alphabet Inc's Google is temporarily mandating weekly COVID-19 tests for any person entering Google offices or facilities in the United States, the tech giant said on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d8ec8566c7526976aaa08705e838a191aa9363af8058446491fb3078801a9f1f"}
{"Ticker":"GOOGL","Date":1642200573,"Headline":"UPDATE 1-Google mandates weekly COVID-19 tests for people entering U.S. offices","Source":"Yahoo","Summary":"Alphabet Inc's Google is temporarily mandating weekly COVID-19 tests for any person entering Google offices or facilities in the United States, the tech giant said on Friday.  Anyone who comes into Google's U.S. work sites will require a negative test and be required to wear surgical-grade masks while at the office, the company said.  \"To help prevent the further spread of COVID-19 during this period of heightened risk, we’re implementing new temporary health and safety measures for anyone accessing our sites in the U.S.,\" a Google spokesperson said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d64f0e0eca4e4aec6f37689f73a792585dd2edfee4585c287b7cad2a0d38766d"}
{"Ticker":"GOOGL","Date":1642199900,"Headline":"Butensky & Cohen Financial Security, Inc Buys Atmos Energy Corp, Micron Technology Inc, MSC ...","Source":"Yahoo","Summary":"Ponte Vedra Beach, FL, based Investment company Butensky & Cohen Financial Security, Inc (Current Portfolio) buys Atmos Energy Corp, Micron Technology Inc, MSC Industrial Direct Co Inc, Merck Inc, Invesco BulletShares 2030 Corporate Bond ETF, sells Infosys, PPL Corp, Pinnacle West Capital Corp, Invesco BulletShares 2021 Corporate Bond ETF, Sylvamo Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Butensky & Cohen Financial Security, Inc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=327afc7e26aec5245700d8cc89db6e181df790d61e7e236d54f9d03244cd9ec3"}
{"Ticker":"GOOGL","Date":1642199884,"Headline":"Garrett Investment Advisors LLC Buys Vanguard Total Stock Market ETF, Vanguard FTSE Developed ...","Source":"Yahoo","Summary":"Investment company Garrett Investment Advisors LLC (Current Portfolio) buys Vanguard Total Stock Market ETF, Vanguard FTSE Developed Markets ETF, iShares Core S&P 500 ETF, SPDR Portfolio Intermediate Term Treasury ETF, SPDR Portfolio S&P 500 Growth ETF, sells BTC iShares MSCI USA Momentum Factor ETF, Vanguard Dividend Appreciation FTF, Vanguard Small Cap ETF, JPMorgan Ultra-Short Income ETF, SPDR SSgA Ultra Short Term Bond ETF during the 3-months ended 2021Q4, according to the most recent filing"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1be9b2027ee33fe9d7043c129a4c90513ac5013fda027c772907f65ac1888b7"}
{"Ticker":"GOOGL","Date":1642198994,"Headline":"Google mandates weekly COVID-19 tests for people entering U.S. offices - CNBC","Source":"Reuters","Summary":"Alphabet Inc's Google is temporarily mandating weekly COVID-19 tests for any person entering Google offices or facilities in the United States, CNBC reported on Friday, citing a memo obtained by the news channel."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2db8ec675c94fb65bd4a1d672ea0d839f5fd5b935c587560a54ac671e06d30c0"}
{"Ticker":"GOOGL","Date":1642198882,"Headline":"Spotify Pressured by 270 Scientists, Medical Professionals Over Joe Rogan Episode","Source":"Yahoo","Summary":"(Bloomberg) -- A coalition of 270 scientists and medical professionals this week issued an open letter to Spotify Technology SA, urging the streaming platform to establish a misinformation policy after an episode of the Joe Rogan Experience, among its most listened-to podcasts, promoted what they said were “baseless conspiracy theories” about the pandemic.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyDirecTV to Drop One America News in Blow to Conservati"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e13e913510086b2063a11a807a9dd6f42a8bf8b5d7468a011d246a310771d9c5"}
{"Ticker":"GOOGL","Date":1642197000,"Headline":"Google Misled Publishers and Advertisers, Unredacted Lawsuit Alleges","Source":"Yahoo","Summary":"Google misled publishers and advertisers for years about the pricing and processes of its ad auctions, creating programs that deflated sales for some companies while increasing prices for buyers, according to newly unredacted allegations in a lawsuit filed by states."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=54bee105660096d66aeb44704f7d8245ea7e2bbe210504dad5002fee4ffda3b0"}
{"Ticker":"GOOGL","Date":1642190729,"Headline":"Google CEO Approved Illegal Ad Deal With Facebook, States Claim","Source":"Yahoo","Summary":"(Bloomberg) -- Sundar Pichai, chief executive officer of Google and its parent Alphabet Inc., personally approved what state attorneys general say was an illegal agreement with Facebook to manipulate the digital advertising market, according to a new court filing by the states.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyDirecTV to Drop One America News in Blow to Conservative ChannelCovid Pandemic May Shift to Endemic in 2022, Moderna Chair SaysScienti"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d72594b5bf18fcf4123c4a7f2785824a759695ae4ae74b219115271a94e2e247"}
{"Ticker":"GOOGL","Date":1642188679,"Headline":"Meta’s Oculus Unit Faces FTC-Led Probe of Competition Practices","Source":"Yahoo","Summary":"(Bloomberg) -- The U.S. Federal Trade Commission and multiple states are investigating Meta Platforms Inc.’s virtual reality unit Oculus over potential anti-competitive practices, according to people with knowledge of the matter. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingDjokovic’s Austral"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b018ae75caaf13d1da0aa880219348b6c29af5d681f1ac75d5d8d899ab204960"}
{"Ticker":"GOOGL","Date":1642185487,"Headline":"John W. Brooker & Co., CPAs Buys Vanguard Ultra-Short Bond ETF, iShares MSCI ACWI Index ...","Source":"Yahoo","Summary":"Investment company John W. Brooker & Co., CPAs (Current Portfolio) buys Vanguard Ultra-Short Bond ETF, iShares MSCI ACWI Index Fund, iShares Short Treasury Bond ETF, BTC iShares MSCI USA Value Factor ETF, T."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b18b24d18e132bee043f0dded2204da10ddcce03d98c4a74f28398b074d22663"}
{"Ticker":"GOOGL","Date":1642182252,"Headline":"Jan. 6 committee subpoenas Google, Facebook, Twitter, Reddit","Source":"Yahoo","Summary":"Yahoo Finance's Rick Newman details the House Select Committee subpoenaing tech and social media platforms as part of their Jan. 6 investigation."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d9f3cb66730ba120df78e40c9ff32fb220fac10a37221ebb7e6b9bbd6f16a600"}
{"Ticker":"GOOGL","Date":1642181760,"Headline":"Waymo and Trucker J.B. Hunt Partner Up. This Isn’t Just About Self-Driving Vehicles.","Source":"Yahoo","Summary":"The agreement gives both companies two ways to benefit, but shares of the trucking company were lower on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d0b38786d4ea9ee15533d77f01a12eb0e6f67dbdcabc247e6d6111d7bb60ff69"}
{"Ticker":"GOOGL","Date":1642181498,"Headline":"UPDATE 2-Facebook, Google CEOs aware of formal advertising market deal -- court filing","Source":"Yahoo","Summary":"Chief executives of Alphabet Inc's Google and Facebook were aware of a deal to carve up part of the online advertising market, according to an amended antitrust complaint filed by Texas and 15 other states against Google.  The deal with Facebook, which Google dubbed \"Jedi Blue,\" was \"signed off\" by Google Chief Executive Sundar Pichai while Facebook CEO Mark Zuckerberg was on an email thread discussing it, they said in their third amended complaint."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=64885aafd0dda318e45747ac1d95c37afd853acff44114353e473e4c80814450"}
{"Ticker":"GOOGL","Date":1642168800,"Headline":"Waymo, J.B. Hunt Sign Deal to Use Self-Driving Trucks in Texas","Source":"Yahoo","Summary":"(Bloomberg) -- Alphabet Inc.’s Waymo signed a multiyear deal with J.B. Hunt Transport Services Inc. to haul freight using autonomous trucks in Texas, its latest bid to reshape transportation with self-driving technology. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass TestingDjokovic’s Australian Visa"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=162317ccef3fce7594bebd50f08c7e55307f31fd17bd96434c9948bbeab08169"}
{"Ticker":"GOOGL","Date":1642181254,"Headline":"Market check: Stocks choppy in intraday trading, tech stocks turn green","Source":"Yahoo","Summary":"Yahoo Finance's Jared Blikre breaks down how stocks are trading on Friday afternoon."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e5f9a6e9eccfd68ac739a7dad7698de79c8c371b89443061916996c91400bb4f"}
{"Ticker":"GOOGL","Date":1642179932,"Headline":"Data-driven digital business is ‘in its first chapter,’ NetApp CEO says","Source":"Yahoo","Summary":"NetApp CEO George Kurian joins Yahoo Finance’s Akiko Fujita and Brian Sozzi to discuss the outlook on cloud computing, chip supply disruptions, and digital transformations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a11c3f3dcbcee0acc579dbd8a62936cf531203bc51efee8579a0cd17f225c720"}
{"Ticker":"GOOGL","Date":1642177433,"Headline":"Facebook, Google CEOs aware of formal advertising market deal -- court filing","Source":"Yahoo","Summary":"WASHINGTON (Reuters) -Chief executives of Alphabet Inc's Google and Facebook were aware of a deal to carve up part of the online advertising market, according to an amended antitrust complaint filed by Texas and 15 other states against Google.  The deal with Facebook, which Google dubbed \"Jedi Blue,\" was \"signed off\" by Google Chief Executive Sundar Pichai while Facebook CEO Mark Zuckerberg was on an email thread discussing it, they said in their third amended complaint."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53487eecc9d98c8ac40812290314e4feb0bec24f29246cd6fe067bfae6a1d169"}
{"Ticker":"GOOGL","Date":1642176116,"Headline":"Apple’s New VR\/AR Headset Risks Being Delayed Until 2023","Source":"Yahoo","Summary":"(Bloomberg) -- Apple Inc. is considering pushing back the debut of its mixed-reality headset by at least a few months, potentially delaying its first major new product since the Apple Watch in 2015, according to people familiar with the situation. Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyFrequent Boosters Spur Warning on Immune ResponseSupreme Court Blocks Biden’s Shot-or-Test Rule for WorkersSay Goodbye to Self-Isolating, WFH Mandates, Mass Testing"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=08b6f1607d85f23d849d2093d9c57f48f6ca93f20c1f6aa258ad4c0928fe2aa1"}
{"Ticker":"GOOGL","Date":1642176095,"Headline":"Top 10 Stock Picks of John Armitage’s Egerton Capital","Source":"Yahoo","Summary":"In this article, we discuss the top 10 stock picks of John Armitage’s Egerton Capital. If you want to skip our detailed analysis of these stocks, go directly to the Top 5 Stock Picks of John Armitage’s Egerton Capital. John Armitage is a British-Irish billionaire who founded Egerton Capital in 1994, and currently serves as […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5d5eb2fbc0881afe5f80d6256054dae2f025750839d088c519a4d536467efa71"}
{"Ticker":"GOOGL","Date":1642176060,"Headline":"States ask U.S. court to reinstate Facebook antitrust lawsuit","Source":"Nasdaq","Summary":"Dozens of states led by New York asked a U.S. federal appeals court on Friday to reinstate an antitrust lawsuit filed against Facebook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c5a25b246124495bc5fcd6830c74bea33860d55f900cc9728a5a4b468dde777f"}
{"Ticker":"GOOGL","Date":1642175302,"Headline":"Is Google About to Accelerate Development of the Quantum Computing Industry?","Source":"Yahoo","Summary":"Quantum computing had a watershed year in 2021.  The first quantum computing pure-play company went public via special purpose acquisition company (SPAC), IonQ (NYSE: IONQ).  Now, according to a recent report from Business Insider, Google parent Alphabet (NASDAQ: GOOGL)(NASDAQ: GOOG) might be getting ready to unleash one of its seed-stage quantum projects into the wild."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c552b8fc27e27cc002fa13f70673a0367ab388f1cb228c7a5d242a49b0a61379"}
{"Ticker":"GOOGL","Date":1642170660,"Headline":"Baby Shark Doo Doo Doo Doo Doo Doo: YouTube Video Hits Huge Milestone Bigger Than Entire World Population","Source":"Benzinga","Summary":"If the song “Baby Shark” was finally out of your head, the bad news is it could be coming back: the song hit a new YouTube milestone and is going to get some news..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7bcc1cc4f05f897fca137b404099e2385664cfbf57f6f84083a01127519a6b7a"}
{"Ticker":"GOOGL","Date":1642169727,"Headline":"Waymo, J.B. Hunt expand tie-up to commercialize autonomous trucking technology","Source":"Reuters","Summary":"U.S. truck fleet operator J.B. Hunt Transport Services and Alphabet Inc's self-driving unit Waymo are expanding their alliance to deploy fully autonomous trucking operations in Texas in the next few years, the companies said on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c08df65d3272fc401e8741af604ce8a2df01c4bed5a48e065547efe5264b9777"}
{"Ticker":"GOOGL","Date":1642168080,"Headline":"The Best Cryptocurrencies for 2022","Source":"Nasdaq","Summary":"In investing, the trend is your friend – until it isn't. That proved true for digital currencies last year, and it could very well define the outlook for the best cryptocurrencies of 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c2fcb7f65cb49d630aef2552dcb2c2686e53b649079585fef3a99cdb15b814fe"}
{"Ticker":"GOOGL","Date":1642165800,"Headline":"Teladoc Stock Is Returning to Long-Term Pivotal Zones","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5faa0350b090bdcf1f3a14953b8aaae10592124532e755ec3ab7bdb977210431"}
{"Ticker":"GOOGL","Date":1642165620,"Headline":"The Case Of Fake Pokemon Cards: How Logan Paul Got Duped For $3.5M And What's Next","Source":"Benzinga","Summary":"Sealed packs, boxes and cases of Pokemon cards have risen in value, but also come with questions of authenticity, which played itself out in a viral story this week.\nWhat Happened..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=76d6f243dca6f5f7183fc2ae954ff38191fc3153215ede3f459fce2f578d9131"}
{"Ticker":"GOOGL","Date":1642164039,"Headline":"Rumble Pre-IPO: Creator-Friendly Platform, A Necessary Rival, An Interesting Buy","Source":"SeekingAlpha","Summary":"Rumble provides interesting alternatives in a Big Tech\/media landscape increasingly perceived as partisan and censorious in the U.S. Read more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cffe861f34ded5101ec5a1a325ace7be98beb8d999c3aacc73b02bf35badd47b"}
{"Ticker":"GOOGL","Date":1642163186,"Headline":"Closed-End Funds: A Look At 2021, And Looking Forward To 2022","Source":"SeekingAlpha","Summary":"The market can continue to run higher, though I would temper expectations for the year. Read more to find out why I'm cautiously optimistic heading into 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d43263fc71c940f326b02eddeb9f475822cfe34ea6c6e86f6b835f211a641f24"}
{"Ticker":"GOOGL","Date":1642162560,"Headline":"Google Buys London Office Property For $1B: What You Need To Know","Source":"Benzinga","Summary":"Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) is acquiring an office property in London for $1 billion.\nWhat Happened: According to a report in the trade journal Building..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=830642375d073b7cebd73108f1685aed958789d65a23cd8e5452c84551ac1d92"}
{"Ticker":"GOOGL","Date":1642160554,"Headline":"GOOGLE SPOKESPERSON SAYS COMPANY INTENDS TO FILE MOTION TO DISMISS STATES' DIGITAL ADS ANTITRUST LAWSUIT NEXT WEEK","Source":"Finnhub","Summary":"GOOGLE SPOKESPERSON SAYS COMPANY INTENDS TO FILE MOTION TO DISMISS STATES' DIGITAL ADS ANTITRUST LAWSUIT NEXT WEEK ... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ba9c9402955b84896605177ae218a9821e3cd6be840048660662cef78c8a94b8"}
{"Ticker":"GOOGL","Date":1642160040,"Headline":"3 Popular ESG Indexes and How to Invest in Them","Source":"Nasdaq","Summary":"Here’s a look at three ESG indexes (based on the prominent parent indexes) and the ways to invest in them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cec46e63c16bf5065a8b188d6144ec2f913ce6362f996502530a91a2783dca34"}
{"Ticker":"GOOGL","Date":1642158000,"Headline":"Google Misled Publishers and Advertisers, Unredacted Lawsuit Alleges ","Source":"DowJones","Summary":"Google misled publishers and advertisers for years about the pricing and processes of its ad auctions, creating programs that deflated sales for some companies while increasing prices for buyers, according to newly unredacted allegations in a lawsuit filed by states. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fa6470111861e71d0f5f3c4b71e339ebd387359ae0291b1d353bf6d4fd36df2c"}
{"Ticker":"GOOGL","Date":1642157194,"Headline":"TINA Was Wrong, Cash Is Not Trash, And There Is An Alternative","Source":"SeekingAlpha","Summary":"Despite high rates of inflation, recent CPI readings register a 7.0% inflation rate, many stock prices have deteriorated faster than cash prices. See more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=275cbeb7c370c77bb3a0b3caa6e4e2f66d626e6ad8d9d3de4124805d99c278af"}
{"Ticker":"GOOGL","Date":1642156260,"Headline":"Google Doubles Down on the Office, Buying London Site for $1 Billion ","Source":"DowJones","Summary":"The purchase of the site, near the British Museum, comes as the Alphabet unit is building a separate, massive new U.K. headquarters about a mile and a half away."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f453affb185427256aaac2a230a92fc735e76f165c09ad43f5717ce14749e62"}
{"Ticker":"GOOGL","Date":1642155900,"Headline":"Meta Platforms (FB) Faces Multibillion-Pound Legal Claim in UK","Source":"Nasdaq","Summary":"Meta Platforms FB is facing a class-action lawsuit at the Competition Appeal Tribunal in London, the U.K. The legal claim has been made by competition law expert Liza Lovdahl Gormsen.The lawsuit claims that Meta is misusing its market dominance and generating revenues fro"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f848a879e7b89c80a9de51107e8fb8855bb2d4536ccf19c8498a815c9e17af4e"}
{"Ticker":"GOOGL","Date":1642150222,"Headline":"Spotify: Content King In Audio Streaming","Source":"SeekingAlpha","Summary":"Spotify is down roughly 40% from all-time highs set in February of last year. This drawdown has allowed for valuations to normalize, in my opinion."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7f98ae9d1cb74cdff60f58c6069bd5bb165f8053960086ea5bb4525890f3d184"}
{"Ticker":"GOOGL","Date":1642149900,"Headline":"Verizon Stock: Outsized Returns With Extended 5G Rollouts In 2022","Source":"SeekingAlpha","Summary":"This will be a pivotal year for 5G and Verizon is well-poised to becoming a market share gainer in 2022. Read more to see the outlook for VZ stock."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9d1b491fb839b0dd91709982acf89624dad4de88e7189555f3c2645e537f0aaf"}
{"Ticker":"GOOGL","Date":1642147740,"Headline":"Can Spotify Become the Next Google?","Source":"Nasdaq","Summary":"Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG), the parent company of the search giant Google, has delivered remarkable financial results over the last two decades and today sits at a market cap of roughly $1.9 trillion. While there are certainly a number of factors that have helped Alp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b00303a9d6641d52936ae3388b38dd939a551cd66393d93df1bb7d5346f4ec9a"}
{"Ticker":"GOOGL","Date":1642145760,"Headline":"Prediction: Amazon Stock Will Be Worth More Than Apple in 10 Years","Source":"Nasdaq","Summary":"Most people think of Amazon (NASDAQ: AMZN) as an e-commerce company, and for good reason. It has become the online marketplace of choice for millions of consumers around the world. But the company also participates in two other expanding industries, both of which could fuel signi"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=979db8a8df2d249c2495a23c70791dca1abfac126b61c8a6802ed2e9a1681bb5"}
{"Ticker":"GOOGL","Date":1642136749,"Headline":"Oakmark Funds: “We See a Strong Analogy to Netflix (NFLX) Today”","Source":"Yahoo","Summary":"Oakmark Funds, an investment management firm, published its “Bill Nygren Market Commentary” fourth-quarter 2021 investor letter – a copy of which can be seen here. In the letter, Bill Nygren talked about Oakmark’s view on cryptocurrency, and why Oakmark calls itself a value investor. They also talked about the current investment opportunity, as well as how […]"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d7a1067f8bf7645a7651bee2faab84f619f343529dabacc07576256b0442d76d"}
{"Ticker":"GOOGL","Date":1642131220,"Headline":"Google shows faith in office with $1 billion London deal","Source":"Finnhub","Summary":"Tech giant Google has spent $1billion to buy a central London building where it is currentlya tenant, showing its confidence in the future of the office asa place to work, the company said on... | January 14, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a57964a8711700f7cb6b24a40768f74a17b34e9dfbbbf3f9681f9214585b4528"}
{"Ticker":"GOOGL","Date":1642128480,"Headline":"Google buys London site for $1 billion","Source":"Nasdaq","Summary":"Tech giant Google has spent $1 billion to buy a central London building where it is currently a tenant, showing its confidence in the future of the office as a place to work, the company said on Friday."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=200ca22c32c8cb8ff50f99019ed2ecfe839516a14139db308ba687922d14e3be"}
{"Ticker":"GOOGL","Date":1642122391,"Headline":"U.S. House panel subpoenas social media firms in Jan. 6 attack probe","Source":"Reuters","Summary":"By Jan Wolfe, Sarah N. Lynch, Elizabeth Culliford and Paresh Dave"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a605aa192f6bb0bcb68ee2a4d9f06ea638d05654f2cb113d6d2831c1b46ba7e"}
{"Ticker":"GOOGL","Date":1642123094,"Headline":"Google announces £762m investment to buy UK office site","Source":"Yahoo","Summary":"The tech giant is to buy an office site in London where it has been a tenant."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4c26e4ccd51a664077f776c38975e3fd3d28de9ee8e2157f909fef09344d82ec"}
{"Ticker":"GOOGL","Date":1642254600,"Headline":"Apple to require employee proof of COVID-19 booster -The Verge","Source":"Nasdaq","Summary":"Apple Inc will require retail and corporate employees to provide proof of a COVID-19 booster shot, The Verge reported on Saturday, citing an internal email."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d4a8888c954dc93691ed6e6f7581121da0185a933d0bea20f345c922e160b080"}
{"Ticker":"GOOGL","Date":1642252500,"Headline":"Even After Big Price Cuts, These Tech Stocks Are No Bargains","Source":"Yahoo","Summary":"(Bloomberg) -- To see why a leveling of tech valuations has the capacity to terrify even staunch stock bulls, consider the hyper-speculative software makers at the center of the recent equity storm.Most Read from BloombergCannabis Compounds Prevented Covid Infection in Laboratory StudyDirecTV to Drop One America News in Blow to Conservative ChannelCovid Pandemic May Shift to Endemic in 2022, Moderna Chair SaysFrequent Boosters Spur Warning on Immune ResponseScientists Discover Gene That Increase"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4451552330bb81c9f1626c03c1223a5dffcc48b37623304bfd99d09e80db5102"}
{"Ticker":"GOOGL","Date":1642234080,"Headline":"Wall Street Breakfast: What Moved Markets","Source":"SeekingAlpha","Summary":"Listen on the go! A daily podcast of Wall Street Breakfast will be available this morning on Seeking Alpha, iTunes, Stitcher and Spotify."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a6c9363b005d2b1bb3c8ad6ace6f173c885199ae39ec886bd26fe423e0b3de0a"}
{"Ticker":"GOOGL","Date":1642231800,"Headline":"Is This Tech Stock the Square of Cloud Computing?","Source":"Nasdaq","Summary":"In this segment of Motley Fool Live, recorded on Jan. 6, Fool contributor Trevor Jennewine explores how DigitalOcean (NYSE: DOCN) has been able to gain some significant traction in the crowded cloud computing space."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c7c5cbbae294408d774663d6e04011534f9d96deec59a048dc3b3e211928d110"}
{"Ticker":"GOOGL","Date":1642229429,"Headline":"Confounded's Complete Aggressive Growth Portfolio After A Brutal Beatdown","Source":"SeekingAlpha","Summary":"I have reduced my number of holdings in portfolio to 25 and have begun to concentrate my holdings among a few. Check out my current aggressive growth portfolio."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d90fb5b50c198f00685ab7386bb327fb17b396c3e36378fe2fcca87be2bd3665"}
{"Ticker":"GOOGL","Date":1642227000,"Headline":"Want a 54% to 244% Return? Try These Growth Stocks, Wall Street Says","Source":"Nasdaq","Summary":"The new year is still fresh, but the stock market is off to a bumpy start to 2022. The S&P 500 index, which is followed for its diverse array of sectors, has already fallen by 2.4% since Jan. 1. The technology sector has fared even worse, but that presents some opportunities"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=85a5689da1bed51549875bd954ed948b36d9ce49a420727992c3c3575605c596"}
{"Ticker":"GOOGL","Date":1642214283,"Headline":"Gateway Advisory, LLC Buys BTC BlackRock Ultra Short-Term Bond ETF, Invesco DWA Momentum ETF, ...","Source":"Yahoo","Summary":"Westfield, NJ, based Investment company Gateway Advisory, LLC (Current Portfolio) buys BTC BlackRock Ultra Short-Term Bond ETF, Invesco DWA Momentum ETF, iShares iBonds Dec 2025 Term Muni Bond ETF, iShares iBonds Dec 2023 Term Muni Bond ETF, iShares iBonds Dec 2022 Term Muni Bond ETF, sells BTC iShares MSCI USA Min Vol Factor ETF, iShares iBoxx USD High Yield Corporate Bond ETF, iShares iBonds Dec 2021 Term Corporate ETF, iShares iBonds Dec 2021 Term Muni Bond ETF, Dow Inc during the 3-months en"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=df0ff3a6a250c57f059d1940f68e768bd110129ec9e2a841029677b8e76f5f01"}
{"Ticker":"GOOGL","Date":1642205880,"Headline":"Google and Facebook CEOs colluded in online-ad sales scheme, unredacted antitrust lawsuit alleges","Source":"Yahoo","Summary":"Google hoodwinked advertisers and publishers for years on pricing of its ad auctions, then pocketed the difference and used the resulting pool of money to manipulate future auctions to expand its digital monopoly, according to newly unredacted details Friday from a suit from state attorneys general led by Texas AG Ken Paxton."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec7a95e50b82c62df84f1b24c54e44c60ccf9d54572d30e7be03a0d81aee72c3"}
{"Ticker":"GOOGL","Date":1642351757,"Headline":"Trouble For Technology","Source":"SeekingAlpha","Summary":"It has been a rough start for the NASDAQ and technology so far in 2022. These challenges can be traced back as far as mid-2021."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11ddbe29f435f922afd47387dc50b8cf9a2266bc61b2967424cf24c5d3165fbd"}
{"Ticker":"GOOGL","Date":1642323600,"Headline":"How to Use a Free Password Manager—and Make Your Logins Safer","Source":"DowJones","Summary":"Reusing passwords on different sites and apps is dangerous. Here’s a guide to safer logins and better cybersecurity, starting with setting up a free password manager."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c45258ba4b698a50a861aefc44e7269880baebd37e1f3d4a15a2475486b90447"}
{"Ticker":"GOOGL","Date":1642320780,"Headline":"Could Nvidia Be a Great Stock to Buy in 2022?","Source":"Nasdaq","Summary":"In a recent episode of \"The Rank\" on Fool Live, three of our top contributors discussed their highest-conviction stocks for 2022. In this clip, recorded on Jan. 10, Fool.com contributor Danny Vena explains why Nvidia (NASDAQ: NVDA) is one of his top stocks to buy in 2022, and why"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ea88ae85d4d655c08e4d5323df0cef87ef646f18cee1b752ded77758297f6088"}
{"Ticker":"GOOGL","Date":1642311000,"Headline":"Big Tech Braces for a Wave of Regulation","Source":"DowJones","Summary":"Unlike in the past, this new scrutiny could have an impact on the bottom line."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d4cd64bf5fd7d017d8788567c48ec8c0668c4dc071c826b4809c17ba5cf71128"}
{"Ticker":"GOOGL","Date":1642456020,"Headline":"U.S. Senate panel to debate app store reform bill","Source":"Nasdaq","Summary":"A U.S. Senate panel is set on Thursday to debate a bill that aims to rein in app stores of companies that some lawmakers say exert too much market control, including Apple Inc and Alphabet Inc's Google."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1f3ed8a788394f9f271dba3f0d5abe16b9a767cb9c8a02101d1a5c98de06d5fd"}
{"Ticker":"GOOGL","Date":1642442100,"Headline":"Alphabet (GOOGL) Outpaces Stock Market Gains: What You Should Know","Source":"Nasdaq","Summary":"In the latest trading session, Alphabet (GOOGL) closed at $2,789.61, marking a +0.64% move from the previous day. This move outpaced the S&P 500's daily gain of 0.08%. Meanwhile, the Dow lost 0.56%, and the Nasdaq, a tech-heavy index, lost 4.81%."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1111361fecdda5dd19c63fc821f5c2d523f4b76c46d7c283b58d260da9e19e27"}
{"Ticker":"GOOGL","Date":1642419054,"Headline":"IYW: Technology Dashboard For January","Source":"SeekingAlpha","Summary":"Hardware is the most attractive tech industry regarding valuation, quality, and momentum. See why I think IYW ETF is an alternative to XLK ETF."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d95e23e85cf5f43d8169385bd104a14bb94de0a1c90cb8d6b4f6a684b435037a"}
{"Ticker":"GOOGL","Date":1642404213,"Headline":"Insider Weekends: Daniel Springer Buys More DocuSign","Source":"SeekingAlpha","Summary":"Daniel Springer buys shares of DocuSign again. Another interesting SaaS insider purchase last week relates to SmartSheet by its Director James White. Click here to know more."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46e5df67254d00d39c7937790c8eeddd2899b3b492b629168e0013989f7ca34b"}
{"Ticker":"GOOGL","Date":1642401900,"Headline":"3 Stocks I'm Buying During a Tech Stock Correction","Source":"Nasdaq","Summary":"Tech stocks have gotten off to a rough start this year. For instance, the tech-heavy Nasdaq Composite index is down 5% so far."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=966415edcbcc4e1f1352efc19e843c25acf1785f3b197de947cf3dd80761a689"}
{"Ticker":"GOOGL","Date":1642400760,"Headline":"How are Adtech Companies Preparing for a Cookieless World?","Source":"Nasdaq","Summary":"Cookies have been around for decades. In the mid-1990s, advertising cookies were created to collect data on users so that advertisers could place targeted ads on screens. These cookies did not focus on privacy, and they could track a consumers' data."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1077006abcd9a63e3a746038c72d1719c2e31f4fbd0e30207d871e412fcf720c"}
{"Ticker":"GOOGL","Date":1642550358,"Headline":"Apple, Google Tell U.S. Senators That Tech Bills Will Harm Privacy","Source":"Yahoo","Summary":"(Bloomberg) -- Apple Inc. and Google warned U.S. lawmakers Tuesday that bipartisan antitrust legislation aimed at curbing the power of big technology companies will threaten the privacy and security of users.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Tensions, Roil Oil MarketOlymp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=51ae58ef254bd5b806e6002d12489fb65b95f4720b7872d1a2443bbae57be5da"}
{"Ticker":"GOOGL","Date":1642545512,"Headline":"Hoese & Co LLP Buys Ecolab Inc, AerCap Holdings NV, UnitedHealth Group Inc, Sells Manulife ...","Source":"Yahoo","Summary":"Investment company Hoese & Co LLP (Current Portfolio) buys Ecolab Inc, AerCap Holdings NV, UnitedHealth Group Inc, Alphabet Inc, NVIDIA Corp, sells Manulife Financial Corp, Paychex Inc, Diageo PLC, National Grid PLC, Kinder Morgan Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Hoese & Co LLP."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bf58df6e87732f741bee388138705ad2f7570058e2e98d4018813d34de667f9"}
{"Ticker":"GOOGL","Date":1642545496,"Headline":"Fairhaven Wealth Management, LLC Buys Alphabet Inc, CDW Corp, Costco Wholesale Corp, Sells ARK ...","Source":"Yahoo","Summary":"Investment company Fairhaven Wealth Management, LLC (Current Portfolio) buys Alphabet Inc, CDW Corp, Costco Wholesale Corp, O'Reilly Automotive Inc, Arthur J."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=77b5fca68419981465c7c18ec96efa72370b63799b7727af98212d2329556151"}
{"Ticker":"GOOGL","Date":1642545490,"Headline":"Parkside Investments, LLC Buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, ...","Source":"Yahoo","Summary":"Investment company Parkside Investments, LLC (Current Portfolio) buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, Penn National Gaming Inc, Element Solutions Inc, sells Texas Instruments Inc, Citigroup Inc, Advanced Micro Devices Inc, VanEck Gold Miners ETF, JPMorgan Ultra-Short Income ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Parkside Investments, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bedee201d006d77e0a17fb17dd9344d4836516c0c5a00fcf76b5d0e4d00809f7"}
{"Ticker":"GOOGL","Date":1642545489,"Headline":"Smith & Howard Wealth Management, LLC Buys iShares National Muni Bond ETF, Vanguard ...","Source":"Yahoo","Summary":"Atlanta, GA, based Investment company Smith & Howard Wealth Management, LLC (Current Portfolio) buys iShares National Muni Bond ETF, Vanguard Short-Term Government Bond ETF, ISHARES TRUST, iShares Short-Term National Muni Bond ETF, Vanguard Large Cap ETF, sells Schwab Short-Term U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11f5c8031338d0c873b3b20b7c7f7b8984b22c156d6256d175fd1bdab963639b"}
{"Ticker":"GOOGL","Date":1642545488,"Headline":"Central Bank & Trust Co Buys IQ Hedge Multi-Strategy Tracker ETF, iShares iBoxx USD High ...","Source":"Yahoo","Summary":"Lexington, KY, based Investment company Central Bank & Trust Co (Current Portfolio) buys IQ Hedge Multi-Strategy Tracker ETF, iShares iBoxx USD High Yield Corporate Bond ETF, Charles River Laboratories International Inc, CSX Corp, GLOBALFOUNDRIES Inc, sells Vanguard Emerging Markets Government Bond ETF, Activision Blizzard Inc, FedEx Corp, Communication Services Select Sector SPDR Fund, Vertex Pharmaceuticals Inc during the 3-months ended 2021Q4, according to the most recent filings of the inves"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=74934ea0ce1de43a7378777e8a40a306dac83dc0896a10429eb0e6163d434e0a"}
{"Ticker":"GOOGL","Date":1642543147,"Headline":"Microsoft’s purchase of Activision Blizzard gives it the clear lead in the metaverse","Source":"Yahoo","Summary":"Microsoft's purchase of Activision Blizzard is a major step for its metaverse ambitions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1fd3d5483be44566cd3d09b9b29da73b0b68dcd0617c74ca8b99f85c607c562"}
{"Ticker":"GOOGL","Date":1642542804,"Headline":"Microsoft’s Activision Deal Set to Test Biden’s Antitrust Regime","Source":"Yahoo","Summary":"(Bloomberg) -- Less than three weeks into 2022, President Joe Biden’s antitrust regime is facing its first big test of the year. Microsoft Corp.’s $69 billion all-cash takeover of Activision Blizzard Inc. brings together two major gaming platforms in a deal that directly affects consumers -- and could also raise grievances among some of the tech giant’s biggest rivals.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward O"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e76dd52da6bc0a8c1f54349d40d0c11f4d04cb45fdc07cbf6bf61bfc8ad1b31"}
{"Ticker":"GOOGL","Date":1642539000,"Headline":"YouTube Shuts Division for Original Programming","Source":"Yahoo","Summary":"The unit launched “Cobra Kai,” but most shows never gained traction with viewers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=205e2615c97ec0eaaad3a773299de23043ace1e02920637b851e5fcaaa3684b5"}
{"Ticker":"GOOGL","Date":1642536820,"Headline":"Google users complain its Assistant has changed its white noise and is disturbing their children’s sleep","Source":"Yahoo","Summary":"Google has changed its white noise, users have complained – and it has left children unable to sleep and adults confused.  The Google Assistant inside products like its small Home speakers offers a range of different ambient sounds, aimed at relaxing, sleeping or other users.  One of those is white noise, which users can ask to play if they want help with concentrating or drifting off."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff4ed7077fedb2c4288159da50a4bb3c0a586833ef96404316ec3bada39f1d60"}
{"Ticker":"GOOGL","Date":1642534236,"Headline":"Big Tech sell-off not 'a long-term problem for the sector,' market strategist says","Source":"Yahoo","Summary":"J.P. Morgan Asset Management Global Market Strategist Jack Manley joins Yahoo Finance Live to discuss stocks selling off, fourth quarter earnings for big banks, inflation data, and the Fed."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=880a4366ddecd21b6ebf3fecde0cc36119f88ed382e44cd3173c8bb8488302de"}
{"Ticker":"GOOGL","Date":1642529399,"Headline":"YouTube Scales Back Original Series to Invest in Other Areas","Source":"Yahoo","Summary":"(Bloomberg) -- YouTube is cutting its investment in original programming, ending a six-year experiment with making premium television shows under veteran entertainment executive Susanne Daniels.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Tensions, Roil Oil MarketOlympic Ticket Sale"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ca3ba230ac2928d2fac77d9da31f369698aa5d2b141f75ebc43cae9c51b74ce"}
{"Ticker":"GOOGL","Date":1642529146,"Headline":"Five Reasons Microsoft Is Making Activision Blizzard Its Biggest Deal Ever","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp. is buying Activision Blizzard Inc. in a $68.7 billion all-cash acquisition, uniting two of the biggest forces in video games. It’s the software maker’s biggest deal ever, almost three times as large as the 2016 purchase of LinkedIn. Here are five key reasons why it happened.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasu"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cb0e7b8203d47e4e0037283ed71121e19243bb5f77fbbf15f3a804f57d8b15eb"}
{"Ticker":"GOOGL","Date":1642523520,"Headline":"FOCUS-Cadence Design Systems aims to cash in on new custom-chip era","Source":"Nasdaq","Summary":"Microchip design software maker Cadence Design Systems Inc is betting on growth from automakers and other chip users strapped by global supply shortages who face mounting competition from rivals such as Tesla Inc and Apple Inc that design their own chips."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d72a876fc3da4387a4499c5e99f0de22a7c2cc1511ad37efdcd4578366ad5b7"}
{"Ticker":"GOOGL","Date":1642521054,"Headline":"Stocks Fall to Start Week; Microsoft Buying Activision","Source":"Yahoo","Summary":"Financial news digest for Jan. 18, with stock, bond, cryptocurrency, and markets news. Breaking news on companies, earnings, and interest rates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=801ea1954d173df2de2ed7092b94c013de8e7aa9d3fa7fa24ee7e60a5790c964"}
{"Ticker":"GOOGL","Date":1642520641,"Headline":"Market check: 10-year Treasury yield climbs to 2-year high, Dow falls 500+ points","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre breaks down how the stock and bond markets are performing in early trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e8ff053b63d1a33d90257e0ea8b8c41d36b2654665a02b4ad4942db341e6067"}
{"Ticker":"GOOGL","Date":1642520640,"Headline":"Microsoft-Activision Deal Likely to Face Close Antitrust Scrutiny ","Source":"DowJones","Summary":"The $75 billion acquisition will have to navigate a regulatory environment that has become less friendly to deal making, especially in the tech sector."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d47f71b901ae000e551753bf0d52898ffe4dd73111851959e0e359c1db274f5a"}
{"Ticker":"GOOGL","Date":1642519380,"Headline":"Noteworthy Tuesday Option Activity: CMG, GOOG, GOOGL","Source":"Nasdaq","Summary":"Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Chipotle Mexican Grill Inc (Symbol: CMG), where a total volume of 5,908 contracts has been traded thus far today, a contract volume which is representative of a"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f61b5e03a26b6ad241d6dee92eb90d85228306e17ed8953c685db523521438b1"}
{"Ticker":"GOOGL","Date":1642518963,"Headline":"Alphabet's (GOOGL) Google to Bring Digital Wellbeing Widget","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google gears up to add the digital wellbeing widget for showing users the amount of time they spend on their phone and Android applications."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3294ce03466c687976e26611dce0d506bcf69dfdf9c76f4e63271079fa6e4b8e"}
{"Ticker":"GOOGL","Date":1642516690,"Headline":"Leith Wheeler Investment Counsel Ltd. Buys Booz Allen Hamilton Holding Corp, Henry Schein Inc, ...","Source":"Yahoo","Summary":"Vancouver, A1, based Investment company Leith Wheeler Investment Counsel Ltd. (Current Portfolio) buys Booz Allen Hamilton Holding Corp, Henry Schein Inc, Frontdoor Inc, Global Payments Inc, Accenture PLC, sells Jefferies Financial Group Inc, Hilton Grand Vacations Inc, iShares MSCI EAFE ETF, Charles Schwab Corp, Shopify Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Leith Wheeler Investment Counsel Ltd.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2189282954e77801f0e4dfea770c739efc756033d21827cfc469e95ed216f7b3"}
{"Ticker":"GOOGL","Date":1642516690,"Headline":"Ayalon Holdings Ltd. Buys iShares Russell 2000 ETF, Invesco S&P 500 High Beta ETF, JPMorgan ...","Source":"Yahoo","Summary":"Investment company Ayalon Holdings Ltd. (Current Portfolio) buys iShares Russell 2000 ETF, Invesco S&P 500 High Beta ETF, JPMorgan U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61394d76ad20a3b171e468196c5b8378a70768460213d287bc9828687d7f33a5"}
{"Ticker":"GOOGL","Date":1642512998,"Headline":"Exclusive-U.S. examining Alibaba's cloud unit for national security risks - sources","Source":"Finnhub","Summary":"The Biden administration is reviewing e-commerce giant Alibaba's cloud business to determine whether it poses a risk to U.S. national security, according to three people briefed on the matter, as... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4efaf29d4915f7197662d5b80e8a2093b4ca34f44938e08f5b5f0666c8fdcb1b"}
{"Ticker":"GOOGL","Date":1642512060,"Headline":"Market Update: Why Are Stocks Down Tuesday?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49b17bf9bca8a4d52fab428a901ac95f54ad30c74881ad88b6c4c9f999a1d9bc"}
{"Ticker":"GOOGL","Date":1642510860,"Headline":"Here's How Much $1000 Invested In Alphabet 10 Years Ago Would Be Worth Today","Source":"Benzinga","Summary":"Alphabet (NASDAQ:GOOGL) has outperformed the market over the past 10 years by 11.7% on an annualized basis. \nBuying $1,000 In GOOGL: 10 years ago, an investor could have purchased..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aefa4a4a6ff51b7a1703288c5f8378dbae9356d8da93a449a1ecfd142e1f9c47"}
{"Ticker":"GOOGL","Date":1642510620,"Headline":"Microsoft Buys Activision With One Eye on the Cloud","Source":"Nasdaq","Summary":"Long-suffering shareholders — not to mention canny value investors — were rewarded for their patience in Activision Blizzard (ATVI, $65.39) Tuesday when Microsoft (MSFT, $310.20) agreed to pay $68.7 billion, or $95 a share in cash, for the troubled video game publis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3b4ba8345d73cab5c70dd57a2d5b50d11fdb28c62a8bb9745d9fb872afc86a2"}
{"Ticker":"GOOGL","Date":1642510380,"Headline":"Microsoft’s Activision deal has on virtual goggles","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     Microsoft Chief Executive Satya Nadella’s deal to splash out $69 billion for Activision Blizzard makes a lot of sense, virtually. The software giant is paying a huge premium for its gaming rival, which sh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a004aaa228057fef0f0d124ad7b7237367395dd041d6dbb0d1c264b9ba1a5f74"}
{"Ticker":"GOOGL","Date":1642510200,"Headline":"Why Activision Blizzard Stock Jumped Today","Source":"Nasdaq","Summary":"What happened\nMicrosoft (NASDAQ: MSFT) is buying top video game maker Activision Blizzard (NASDAQ: ATVI) in an all-cash deal worth $68.7 billion. This will bring some of the industry's biggest gaming properties together under one corporate roof, marrying Activision Blizzard's pop"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=460151c3c0b5bca1c1c66d4935aca3148b232e7194f1fd2be8129aa0e24760f5"}
{"Ticker":"GOOGL","Date":1642508580,"Headline":"US STOCKS-Wall St falls on tech drag; GS profit miss triggers bank selloff","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as Goldman Sachs led declines among banks after posting its quarterly profit below expectations, while big technology stocks were slammed by rising Treasury yields."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89bc5965db689e0b8bca9ab7e9f8e71c8249f8107b4879fa9cd43f1d83d8d006"}
{"Ticker":"GOOGL","Date":1642505760,"Headline":"22 Million Reasons to Love Robinhood Stock Again","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41f8250495d77a3737b0e57fee69304dadb53cdae701c675ef77e1d47c62b894"}
{"Ticker":"GOOGL","Date":1642505040,"Headline":"Apple (AAPL) Allows Use of Third-Party Payment in Netherlands","Source":"Nasdaq","Summary":"Apple AAPL will comply with a ruling from the Netherlands’ Authority for Consumers and Markets (ACM) by allowing app developers to utilize third-party payment services within its App Store for the first time in its history.The company has decided to release a pair of enti"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46579bd0163aa828e4483f3d8080074ac6dfdda76d1005460c2614d17fff7d03"}
{"Ticker":"GOOGL","Date":1642504980,"Headline":"GOOGL May 20th Options Begin Trading","Source":"Nasdaq","Summary":"Investors in Alphabet Inc (Symbol: GOOGL) saw new options begin trading today, for the May 20th expiration.  One of the key data points that goes into the price an option buyer is willing to pay, is the time value, so with 122 days until expiration the newly trading contracts r"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8587455b72d0153be02bb3e722c65f5ce7d70e80e76bf41ec2c34b2d8fbf729"}
{"Ticker":"GOOGL","Date":1642503240,"Headline":"See Which Of The Latest 13F Filers Holds Alphabet","Source":"Nasdaq","Summary":"At Holdings Channel, we have reviewed the latest batch of the 21 most recent 13F filings for the 12\/31\/2021 reporting period, and noticed that Alphabet Inc (Symbol: GOOGL) was held by 16 of these funds.  When hedge fund managers appear to be thinking alike, we find it is a good i"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6e1dbd2b3a0b9bdcd35396dada09d933b159c58e0bc67785feb90d821c76a25"}
{"Ticker":"GOOGL","Date":1642502940,"Headline":"VTI, MSFT, TSLA, GOOGL: ETF Inflow Alert","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Vanguard Total Stock Market ETF (Symbol: VTI) where we have detected an approximate $4.9 billion dollar inflow -- that's a 1.7% increase week over w"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e71b33535da36cda57cfcb86ab78458d3090b55d90f0f50938c99e8d4d660019"}
{"Ticker":"GOOGL","Date":1642501511,"Headline":"Microsoft's $68.7 billion deal for Activision once again shows big tech's dominance over legacy media","Source":"CNBC","Summary":"Microsoft takes big $68.7 billion swing on video game company Activision Blizzard while legacy media stays on sidelines"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a5205c04e8f94f2b43d56a1755255b55dd0f87260fc875c098ba3919100852df"}
{"Ticker":"GOOGL","Date":1642500720,"Headline":"US STOCKS-Wall St falls on tech drag; GS results trigger more bank declines","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as big technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17208323599ef5fd4929cb459d94f9b9378823d1ddc75fbf51c769ad93bf9290"}
{"Ticker":"GOOGL","Date":1642496880,"Headline":"US STOCKS-Tech tumble, lackluster GS earnings set to weigh on Wall Street","Source":"Nasdaq","Summary":"Wall Street's main indexes were set to open lower on Tuesday as technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among big banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49c6350d931ef7545f89df775f44860156485dea75f22f8526a173ce415d42fc"}
{"Ticker":"GOOGL","Date":1642496160,"Headline":"PacBio (PACB) to Leverage Google's Deep Learning Technologies","Source":"Nasdaq","Summary":"Pacific Biosciences of California, Inc. PACB, also popularly known as PacBio, recently entered into a research collaboration with Alphabet's GOOGL Google.  PacBio will leverage Google’s genomic analysis, machine learning and algorithm development tools to advance its high"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f65d8363e65585abc6e2d5288169cd4482eee8fdf28dfafa694836b49153dc06"}
{"Ticker":"GOOGL","Date":1642495020,"Headline":"GLOBAL MARKETS-Nasdaq braced for beating as bond markets drive up costs","Source":"Nasdaq","Summary":"Nasdaq traders were braced for a fresh pounding on Tuesday as a seven-year high for oil prices drove up global borrowing costs to pre-COVID levels, with even sub-zero German Bund yields at the brink of positive territory again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46bfd7e196a853c8f1b00ad3cb5e0670092ce9d7f8b57012e30e7b375d012059"}
{"Ticker":"GOOGL","Date":1642494900,"Headline":"Buy The Crash: 2 Tech Stocks For 2022","Source":"SeekingAlpha","Summary":"Many popular tech stocks have dropped 50% or more. Read this article to check out the two tech stocks that we are buying following the recent crash."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f3c2b3cb88b9aa6b9864b89851d92eb555f984ed0589499cb71b97b45900ed5"}
{"Ticker":"GOOGL","Date":1642490040,"Headline":"US STOCKS-Nasdaq futures tumble as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the technology-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c47f9d75ebed20fec74420657aa0c4bdde9232f249eaa14830e28966773d82a9"}
{"Ticker":"GOOGL","Date":1642489800,"Headline":"3 Top Artificial Intelligence Stocks to Buy Right Now","Source":"Nasdaq","Summary":"Artificial intelligence (AI) services can help companies analyze data, optimize their businesses, craft targeted ad campaigns, and even pilot autonomous machines and vehicles. That ongoing shift could enable the global AI market to grow at a compound annual rate of 40.2% from 202"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=038cf8cc33397d936e462368e0e22c702f22c53d712b791f262ab5a77990ea03"}
{"Ticker":"GOOGL","Date":1642485600,"Headline":"Once Top-Ranked IBM’s Been Relegated Among the Second-Tier Outsourcers","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4bd4412129515712e3f499de667197b9af565684c315bf535e175b96db65833f"}
{"Ticker":"GOOGL","Date":1642482120,"Headline":"US STOCKS-Nasdaq futures slump 2% as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the tech-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=87c9114e6bbcf1060c5fc561af38023b8e297269d7e07a4e2e6cbc1c8a27f885"}
{"Ticker":"GOOGL","Date":1642471510,"Headline":"The Trade Desk Stock: Another Great Buy Opportunity With 1 Caveat","Source":"SeekingAlpha","Summary":"Trade Desk is a high-quality advertising tech leader. Read on to know why we believe that investors who didn't manage to get on board TTD stock previously can consider adding now."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6f13fbdf1274dae9ea1c6d750ceb1d1e5572c06ac43c2efd149fe01ef800be3"}
{"Ticker":"GOOGL","Date":1642550358,"Headline":"Apple, Google Tell U.S. Senators That Tech Bills Will Harm Privacy","Source":"Yahoo","Summary":"(Bloomberg) -- Apple Inc. and Google warned U.S. lawmakers Tuesday that bipartisan antitrust legislation aimed at curbing the power of big technology companies will threaten the privacy and security of users.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Tensions, Roil Oil MarketOlymp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=51ae58ef254bd5b806e6002d12489fb65b95f4720b7872d1a2443bbae57be5da"}
{"Ticker":"GOOGL","Date":1642545512,"Headline":"Hoese & Co LLP Buys Ecolab Inc, AerCap Holdings NV, UnitedHealth Group Inc, Sells Manulife ...","Source":"Yahoo","Summary":"Investment company Hoese & Co LLP (Current Portfolio) buys Ecolab Inc, AerCap Holdings NV, UnitedHealth Group Inc, Alphabet Inc, NVIDIA Corp, sells Manulife Financial Corp, Paychex Inc, Diageo PLC, National Grid PLC, Kinder Morgan Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Hoese & Co LLP."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3bf58df6e87732f741bee388138705ad2f7570058e2e98d4018813d34de667f9"}
{"Ticker":"GOOGL","Date":1642545496,"Headline":"Fairhaven Wealth Management, LLC Buys Alphabet Inc, CDW Corp, Costco Wholesale Corp, Sells ARK ...","Source":"Yahoo","Summary":"Investment company Fairhaven Wealth Management, LLC (Current Portfolio) buys Alphabet Inc, CDW Corp, Costco Wholesale Corp, O'Reilly Automotive Inc, Arthur J."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=77b5fca68419981465c7c18ec96efa72370b63799b7727af98212d2329556151"}
{"Ticker":"GOOGL","Date":1642545490,"Headline":"Parkside Investments, LLC Buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, ...","Source":"Yahoo","Summary":"Investment company Parkside Investments, LLC (Current Portfolio) buys SPDR Biotech ETF, SoFi Technologies Inc, SoFi Technologies Inc, Penn National Gaming Inc, Element Solutions Inc, sells Texas Instruments Inc, Citigroup Inc, Advanced Micro Devices Inc, VanEck Gold Miners ETF, JPMorgan Ultra-Short Income ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Parkside Investments, LLC."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bedee201d006d77e0a17fb17dd9344d4836516c0c5a00fcf76b5d0e4d00809f7"}
{"Ticker":"GOOGL","Date":1642545489,"Headline":"Smith & Howard Wealth Management, LLC Buys iShares National Muni Bond ETF, Vanguard ...","Source":"Yahoo","Summary":"Atlanta, GA, based Investment company Smith & Howard Wealth Management, LLC (Current Portfolio) buys iShares National Muni Bond ETF, Vanguard Short-Term Government Bond ETF, ISHARES TRUST, iShares Short-Term National Muni Bond ETF, Vanguard Large Cap ETF, sells Schwab Short-Term U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=11f5c8031338d0c873b3b20b7c7f7b8984b22c156d6256d175fd1bdab963639b"}
{"Ticker":"GOOGL","Date":1642545488,"Headline":"Central Bank & Trust Co Buys IQ Hedge Multi-Strategy Tracker ETF, iShares iBoxx USD High ...","Source":"Yahoo","Summary":"Lexington, KY, based Investment company Central Bank & Trust Co (Current Portfolio) buys IQ Hedge Multi-Strategy Tracker ETF, iShares iBoxx USD High Yield Corporate Bond ETF, Charles River Laboratories International Inc, CSX Corp, GLOBALFOUNDRIES Inc, sells Vanguard Emerging Markets Government Bond ETF, Activision Blizzard Inc, FedEx Corp, Communication Services Select Sector SPDR Fund, Vertex Pharmaceuticals Inc during the 3-months ended 2021Q4, according to the most recent filings of the inves"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=74934ea0ce1de43a7378777e8a40a306dac83dc0896a10429eb0e6163d434e0a"}
{"Ticker":"GOOGL","Date":1642543147,"Headline":"Microsoft’s purchase of Activision Blizzard gives it the clear lead in the metaverse","Source":"Yahoo","Summary":"Microsoft's purchase of Activision Blizzard is a major step for its metaverse ambitions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d1fd3d5483be44566cd3d09b9b29da73b0b68dcd0617c74ca8b99f85c607c562"}
{"Ticker":"GOOGL","Date":1642542804,"Headline":"Microsoft’s Activision Deal Set to Test Biden’s Antitrust Regime","Source":"Yahoo","Summary":"(Bloomberg) -- Less than three weeks into 2022, President Joe Biden’s antitrust regime is facing its first big test of the year. Microsoft Corp.’s $69 billion all-cash takeover of Activision Blizzard Inc. brings together two major gaming platforms in a deal that directly affects consumers -- and could also raise grievances among some of the tech giant’s biggest rivals.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward O"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4e76dd52da6bc0a8c1f54349d40d0c11f4d04cb45fdc07cbf6bf61bfc8ad1b31"}
{"Ticker":"GOOGL","Date":1642539000,"Headline":"YouTube Shuts Division for Original Programming","Source":"Yahoo","Summary":"The unit launched “Cobra Kai,” but most shows never gained traction with viewers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=205e2615c97ec0eaaad3a773299de23043ace1e02920637b851e5fcaaa3684b5"}
{"Ticker":"GOOGL","Date":1642536820,"Headline":"Google users complain its Assistant has changed its white noise and is disturbing their children’s sleep","Source":"Yahoo","Summary":"Google has changed its white noise, users have complained – and it has left children unable to sleep and adults confused.  The Google Assistant inside products like its small Home speakers offers a range of different ambient sounds, aimed at relaxing, sleeping or other users.  One of those is white noise, which users can ask to play if they want help with concentrating or drifting off."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ff4ed7077fedb2c4288159da50a4bb3c0a586833ef96404316ec3bada39f1d60"}
{"Ticker":"GOOGL","Date":1642534236,"Headline":"Big Tech sell-off not 'a long-term problem for the sector,' market strategist says","Source":"Yahoo","Summary":"J.P. Morgan Asset Management Global Market Strategist Jack Manley joins Yahoo Finance Live to discuss stocks selling off, fourth quarter earnings for big banks, inflation data, and the Fed."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=880a4366ddecd21b6ebf3fecde0cc36119f88ed382e44cd3173c8bb8488302de"}
{"Ticker":"GOOGL","Date":1642529399,"Headline":"YouTube Scales Back Original Series to Invest in Other Areas","Source":"Yahoo","Summary":"(Bloomberg) -- YouTube is cutting its investment in original programming, ending a six-year experiment with making premium television shows under veteran entertainment executive Susanne Daniels.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasury Yields Climb: Markets WrapDeadly Drone Strikes on UAE Raise Gulf Tensions, Roil Oil MarketOlympic Ticket Sale"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ca3ba230ac2928d2fac77d9da31f369698aa5d2b141f75ebc43cae9c51b74ce"}
{"Ticker":"GOOGL","Date":1642529146,"Headline":"Five Reasons Microsoft Is Making Activision Blizzard Its Biggest Deal Ever","Source":"Yahoo","Summary":"(Bloomberg) -- Microsoft Corp. is buying Activision Blizzard Inc. in a $68.7 billion all-cash acquisition, uniting two of the biggest forces in video games. It’s the software maker’s biggest deal ever, almost three times as large as the 2016 purchase of LinkedIn. Here are five key reasons why it happened.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsStock Selloff Deepens as Treasu"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cb0e7b8203d47e4e0037283ed71121e19243bb5f77fbbf15f3a804f57d8b15eb"}
{"Ticker":"GOOGL","Date":1642523520,"Headline":"FOCUS-Cadence Design Systems aims to cash in on new custom-chip era","Source":"Nasdaq","Summary":"Microchip design software maker Cadence Design Systems Inc is betting on growth from automakers and other chip users strapped by global supply shortages who face mounting competition from rivals such as Tesla Inc and Apple Inc that design their own chips."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3d72a876fc3da4387a4499c5e99f0de22a7c2cc1511ad37efdcd4578366ad5b7"}
{"Ticker":"GOOGL","Date":1642521054,"Headline":"Stocks Fall to Start Week; Microsoft Buying Activision","Source":"Yahoo","Summary":"Financial news digest for Jan. 18, with stock, bond, cryptocurrency, and markets news. Breaking news on companies, earnings, and interest rates."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=801ea1954d173df2de2ed7092b94c013de8e7aa9d3fa7fa24ee7e60a5790c964"}
{"Ticker":"GOOGL","Date":1642520641,"Headline":"Market check: 10-year Treasury yield climbs to 2-year high, Dow falls 500+ points","Source":"Yahoo","Summary":"Yahoo Finance’s Ines Ferre breaks down how the stock and bond markets are performing in early trading."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0e8ff053b63d1a33d90257e0ea8b8c41d36b2654665a02b4ad4942db341e6067"}
{"Ticker":"GOOGL","Date":1642520640,"Headline":"Microsoft-Activision Deal Likely to Face Close Antitrust Scrutiny ","Source":"DowJones","Summary":"The $75 billion acquisition will have to navigate a regulatory environment that has become less friendly to deal making, especially in the tech sector."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d47f71b901ae000e551753bf0d52898ffe4dd73111851959e0e359c1db274f5a"}
{"Ticker":"GOOGL","Date":1642519380,"Headline":"Noteworthy Tuesday Option Activity: CMG, GOOG, GOOGL","Source":"Nasdaq","Summary":"Looking at options trading activity among components of the Russell 3000 index, there is noteworthy activity today in Chipotle Mexican Grill Inc (Symbol: CMG), where a total volume of 5,908 contracts has been traded thus far today, a contract volume which is representative of a"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f61b5e03a26b6ad241d6dee92eb90d85228306e17ed8953c685db523521438b1"}
{"Ticker":"GOOGL","Date":1642518963,"Headline":"Alphabet's (GOOGL) Google to Bring Digital Wellbeing Widget","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google gears up to add the digital wellbeing widget for showing users the amount of time they spend on their phone and Android applications."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3294ce03466c687976e26611dce0d506bcf69dfdf9c76f4e63271079fa6e4b8e"}
{"Ticker":"GOOGL","Date":1642516690,"Headline":"Leith Wheeler Investment Counsel Ltd. Buys Booz Allen Hamilton Holding Corp, Henry Schein Inc, ...","Source":"Yahoo","Summary":"Vancouver, A1, based Investment company Leith Wheeler Investment Counsel Ltd. (Current Portfolio) buys Booz Allen Hamilton Holding Corp, Henry Schein Inc, Frontdoor Inc, Global Payments Inc, Accenture PLC, sells Jefferies Financial Group Inc, Hilton Grand Vacations Inc, iShares MSCI EAFE ETF, Charles Schwab Corp, Shopify Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Leith Wheeler Investment Counsel Ltd.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2189282954e77801f0e4dfea770c739efc756033d21827cfc469e95ed216f7b3"}
{"Ticker":"GOOGL","Date":1642516690,"Headline":"Ayalon Holdings Ltd. Buys iShares Russell 2000 ETF, Invesco S&P 500 High Beta ETF, JPMorgan ...","Source":"Yahoo","Summary":"Investment company Ayalon Holdings Ltd. (Current Portfolio) buys iShares Russell 2000 ETF, Invesco S&P 500 High Beta ETF, JPMorgan U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=61394d76ad20a3b171e468196c5b8378a70768460213d287bc9828687d7f33a5"}
{"Ticker":"GOOGL","Date":1642512998,"Headline":"Exclusive-U.S. examining Alibaba's cloud unit for national security risks - sources","Source":"Finnhub","Summary":"The Biden administration is reviewing e-commerce giant Alibaba's cloud business to determine whether it poses a risk to U.S. national security, according to three people briefed on the matter, as... | January 18, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4efaf29d4915f7197662d5b80e8a2093b4ca34f44938e08f5b5f0666c8fdcb1b"}
{"Ticker":"GOOGL","Date":1642512060,"Headline":"Market Update: Why Are Stocks Down Tuesday?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49b17bf9bca8a4d52fab428a901ac95f54ad30c74881ad88b6c4c9f999a1d9bc"}
{"Ticker":"GOOGL","Date":1642510860,"Headline":"Here's How Much $1000 Invested In Alphabet 10 Years Ago Would Be Worth Today","Source":"Benzinga","Summary":"Alphabet (NASDAQ:GOOGL) has outperformed the market over the past 10 years by 11.7% on an annualized basis. \nBuying $1,000 In GOOGL: 10 years ago, an investor could have purchased..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=aefa4a4a6ff51b7a1703288c5f8378dbae9356d8da93a449a1ecfd142e1f9c47"}
{"Ticker":"GOOGL","Date":1642510620,"Headline":"Microsoft Buys Activision With One Eye on the Cloud","Source":"Nasdaq","Summary":"Long-suffering shareholders — not to mention canny value investors — were rewarded for their patience in Activision Blizzard (ATVI, $65.39) Tuesday when Microsoft (MSFT, $310.20) agreed to pay $68.7 billion, or $95 a share in cash, for the troubled video game publis"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e3b4ba8345d73cab5c70dd57a2d5b50d11fdb28c62a8bb9745d9fb872afc86a2"}
{"Ticker":"GOOGL","Date":1642510380,"Headline":"Microsoft’s Activision deal has on virtual goggles","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     Microsoft Chief Executive Satya Nadella’s deal to splash out $69 billion for Activision Blizzard makes a lot of sense, virtually. The software giant is paying a huge premium for its gaming rival, which sh"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a004aaa228057fef0f0d124ad7b7237367395dd041d6dbb0d1c264b9ba1a5f74"}
{"Ticker":"GOOGL","Date":1642510200,"Headline":"Why Activision Blizzard Stock Jumped Today","Source":"Nasdaq","Summary":"What happened\nMicrosoft (NASDAQ: MSFT) is buying top video game maker Activision Blizzard (NASDAQ: ATVI) in an all-cash deal worth $68.7 billion. This will bring some of the industry's biggest gaming properties together under one corporate roof, marrying Activision Blizzard's pop"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=460151c3c0b5bca1c1c66d4935aca3148b232e7194f1fd2be8129aa0e24760f5"}
{"Ticker":"GOOGL","Date":1642508580,"Headline":"US STOCKS-Wall St falls on tech drag; GS profit miss triggers bank selloff","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as Goldman Sachs led declines among banks after posting its quarterly profit below expectations, while big technology stocks were slammed by rising Treasury yields."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=89bc5965db689e0b8bca9ab7e9f8e71c8249f8107b4879fa9cd43f1d83d8d006"}
{"Ticker":"GOOGL","Date":1642505760,"Headline":"22 Million Reasons to Love Robinhood Stock Again","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41f8250495d77a3737b0e57fee69304dadb53cdae701c675ef77e1d47c62b894"}
{"Ticker":"GOOGL","Date":1642505040,"Headline":"Apple (AAPL) Allows Use of Third-Party Payment in Netherlands","Source":"Nasdaq","Summary":"Apple AAPL will comply with a ruling from the Netherlands’ Authority for Consumers and Markets (ACM) by allowing app developers to utilize third-party payment services within its App Store for the first time in its history.The company has decided to release a pair of enti"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46579bd0163aa828e4483f3d8080074ac6dfdda76d1005460c2614d17fff7d03"}
{"Ticker":"GOOGL","Date":1642504980,"Headline":"GOOGL May 20th Options Begin Trading","Source":"Nasdaq","Summary":"Investors in Alphabet Inc (Symbol: GOOGL) saw new options begin trading today, for the May 20th expiration.  One of the key data points that goes into the price an option buyer is willing to pay, is the time value, so with 122 days until expiration the newly trading contracts r"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8587455b72d0153be02bb3e722c65f5ce7d70e80e76bf41ec2c34b2d8fbf729"}
{"Ticker":"GOOGL","Date":1642503240,"Headline":"See Which Of The Latest 13F Filers Holds Alphabet","Source":"Nasdaq","Summary":"At Holdings Channel, we have reviewed the latest batch of the 21 most recent 13F filings for the 12\/31\/2021 reporting period, and noticed that Alphabet Inc (Symbol: GOOGL) was held by 16 of these funds.  When hedge fund managers appear to be thinking alike, we find it is a good i"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6e1dbd2b3a0b9bdcd35396dada09d933b159c58e0bc67785feb90d821c76a25"}
{"Ticker":"GOOGL","Date":1642502940,"Headline":"VTI, MSFT, TSLA, GOOGL: ETF Inflow Alert","Source":"Nasdaq","Summary":"Looking today at week-over-week shares outstanding changes among the universe of ETFs covered at ETF Channel, one standout is the Vanguard Total Stock Market ETF (Symbol: VTI) where we have detected an approximate $4.9 billion dollar inflow -- that's a 1.7% increase week over w"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e71b33535da36cda57cfcb86ab78458d3090b55d90f0f50938c99e8d4d660019"}
{"Ticker":"GOOGL","Date":1642501511,"Headline":"Microsoft's $68.7 billion deal for Activision once again shows big tech's dominance over legacy media","Source":"CNBC","Summary":"Microsoft takes big $68.7 billion swing on video game company Activision Blizzard while legacy media stays on sidelines"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a5205c04e8f94f2b43d56a1755255b55dd0f87260fc875c098ba3919100852df"}
{"Ticker":"GOOGL","Date":1642500720,"Headline":"US STOCKS-Wall St falls on tech drag; GS results trigger more bank declines","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Tuesday as big technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=17208323599ef5fd4929cb459d94f9b9378823d1ddc75fbf51c769ad93bf9290"}
{"Ticker":"GOOGL","Date":1642496880,"Headline":"US STOCKS-Tech tumble, lackluster GS earnings set to weigh on Wall Street","Source":"Nasdaq","Summary":"Wall Street's main indexes were set to open lower on Tuesday as technology stocks were slammed by rising Treasury yields, while Goldman Sachs led declines among big banks after posting its quarterly profit below expectations."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=49c6350d931ef7545f89df775f44860156485dea75f22f8526a173ce415d42fc"}
{"Ticker":"GOOGL","Date":1642496160,"Headline":"PacBio (PACB) to Leverage Google's Deep Learning Technologies","Source":"Nasdaq","Summary":"Pacific Biosciences of California, Inc. PACB, also popularly known as PacBio, recently entered into a research collaboration with Alphabet's GOOGL Google.  PacBio will leverage Google’s genomic analysis, machine learning and algorithm development tools to advance its high"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f65d8363e65585abc6e2d5288169cd4482eee8fdf28dfafa694836b49153dc06"}
{"Ticker":"GOOGL","Date":1642495020,"Headline":"GLOBAL MARKETS-Nasdaq braced for beating as bond markets drive up costs","Source":"Nasdaq","Summary":"Nasdaq traders were braced for a fresh pounding on Tuesday as a seven-year high for oil prices drove up global borrowing costs to pre-COVID levels, with even sub-zero German Bund yields at the brink of positive territory again."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46bfd7e196a853c8f1b00ad3cb5e0670092ce9d7f8b57012e30e7b375d012059"}
{"Ticker":"GOOGL","Date":1642494900,"Headline":"Buy The Crash: 2 Tech Stocks For 2022","Source":"SeekingAlpha","Summary":"Many popular tech stocks have dropped 50% or more. Read this article to check out the two tech stocks that we are buying following the recent crash."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f3c2b3cb88b9aa6b9864b89851d92eb555f984ed0589499cb71b97b45900ed5"}
{"Ticker":"GOOGL","Date":1642490040,"Headline":"US STOCKS-Nasdaq futures tumble as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the technology-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c47f9d75ebed20fec74420657aa0c4bdde9232f249eaa14830e28966773d82a9"}
{"Ticker":"GOOGL","Date":1642489800,"Headline":"3 Top Artificial Intelligence Stocks to Buy Right Now","Source":"Nasdaq","Summary":"Artificial intelligence (AI) services can help companies analyze data, optimize their businesses, craft targeted ad campaigns, and even pilot autonomous machines and vehicles. That ongoing shift could enable the global AI market to grow at a compound annual rate of 40.2% from 202"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=038cf8cc33397d936e462368e0e22c702f22c53d712b791f262ab5a77990ea03"}
{"Ticker":"GOOGL","Date":1642485600,"Headline":"Once Top-Ranked IBM’s Been Relegated Among the Second-Tier Outsourcers","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4bd4412129515712e3f499de667197b9af565684c315bf535e175b96db65833f"}
{"Ticker":"GOOGL","Date":1642482120,"Headline":"US STOCKS-Nasdaq futures slump 2% as rising yields spark tech rout","Source":"Nasdaq","Summary":"Futures tracking the tech-heavy Nasdaq 100 index slumped almost 2% on Tuesday as traders returned from a long holiday weekend to position for a more hawkish Federal Reserve ahead of a policy meeting next week."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=87c9114e6bbcf1060c5fc561af38023b8e297269d7e07a4e2e6cbc1c8a27f885"}
{"Ticker":"GOOGL","Date":1642471510,"Headline":"The Trade Desk Stock: Another Great Buy Opportunity With 1 Caveat","Source":"SeekingAlpha","Summary":"Trade Desk is a high-quality advertising tech leader. Read on to know why we believe that investors who didn't manage to get on board TTD stock previously can consider adding now."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c6f13fbdf1274dae9ea1c6d750ceb1d1e5572c06ac43c2efd149fe01ef800be3"}
{"Ticker":"GOOGL","Date":1642636800,"Headline":"Telenor partners with Amazon to modernise systems, offer services","Source":"Nasdaq","Summary":"Norway's Telenor said on Thursday it had partnered with Amazon Web Services (AWS) to speed up the modernisation of its telecoms systems, boosting the use of cloud technology to offer 5G and low-latency data services to professional customers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b9a4210dc593ae8fd4aafdaaf89304173631e9621ea2cc85e4e881c10856ca19"}
{"Ticker":"GOOGL","Date":1642633478,"Headline":"Google Forms Blockchain Group Under Newly Appointed Executive","Source":"Yahoo","Summary":"(Bloomberg) -- Google is forming a group dedicated to the blockchain and related technologies under a newly appointed executive who has spent more than a decade on the company’s core business of search advertising.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessWhy Some Vaccinated People Resist Omicron and Others Don’tStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapBiden Expects Russia to ‘Move In’ on Ukraine; Warns of SanctionsMicrosoft Buys Scand"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c1ff47e636192f86dfaab7e2b7bef59402c98b1ba3d788d732088679fccd85f1"}
{"Ticker":"GOOGL","Date":1642631902,"Headline":"Bristlecone Advisors, LLC Buys Nike Inc, Alphabet Inc, WisdomTree U.S. ...","Source":"Yahoo","Summary":"Investment company Bristlecone Advisors, LLC (Current Portfolio) buys Nike Inc, Alphabet Inc, WisdomTree U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ab1e1ec5bcb1c27eea1f81c42a6ae0f1eec22be405446c74e81b4714e9fb6449"}
{"Ticker":"GOOGL","Date":1642631900,"Headline":"Madison Wealth Partners, Inc Buys Chevron Corp, iShares Russell Mid-Cap Value ETF, iShares Core ...","Source":"Yahoo","Summary":"Investment company Madison Wealth Partners, Inc (Current Portfolio) buys Chevron Corp, iShares Russell Mid-Cap Value ETF, iShares Core High Dividend ETF, Vanguard S&P 500 ETF, Alphabet Inc, sells Innovator U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d7d19c0ae9ddadca53c3546e997e0b798782b9bebe4ee39556bd1b32e1404fb4"}
{"Ticker":"GOOGL","Date":1642631883,"Headline":"M. Kraus & Co Buys Stanley Black & Decker Inc, Amgen Inc, Alphabet Inc, Sells Vanguard ...","Source":"Yahoo","Summary":"Shelburne, VT, based Investment company M. Kraus & Co (Current Portfolio) buys Stanley Black & Decker Inc, Amgen Inc, Alphabet Inc, Duke Energy Corp, Danaher Corp, sells Vanguard Total Stock Market ETF, Exxon Mobil Corp during the 3-months ended 2021Q4, according to the most recent filings of the investment company, M."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ee1e2875d99f1a169caa3eecf2b79162096d0092da563281f42b7578450d5311"}
{"Ticker":"GOOGL","Date":1642627380,"Headline":"Bills targeting Apple and Google face biggest test yet","Source":"Yahoo","Summary":"Big Tech’s first big showdown for antitrust legislation is about to reach Capitol Hill.  A Senate bill that squarely aims at reining in the power of vast digital platforms from Apple Inc.  (AAPL)  and Google parent Alphabet Inc.  (GOOGL) (GOOG)  will be debated by the Senate Judiciary Committee in a public hearing Thursday.  Amy Klobuchar, D-Minn., and Chuck Grassley, R-Iowa, prevents the likes of Apple, Google and Amazon.com  (AMZN)  from favoring their services over others."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=20b9ef73c460b67c17c75eb9a7e8630083c77229191b442f15d6ad230ce0638f"}
{"Ticker":"GOOGL","Date":1642624533,"Headline":"EXCLUSIVE-Google aims to improve spotty enforcement of children's ads policy ","Source":"Reuters","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search engine that should have been blocked under its efforts to comply with UK regulations..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46c942b5cea955428d60f4936324cea4dd54c13213a24c3563de515ba1d1db7e"}
{"Ticker":"GOOGL","Date":1642623612,"Headline":"Fed may trigger 'bigger corrections' in stock market with its actions: strategist","Source":"Yahoo","Summary":"Brace for stock market volatility, warns this top investing strategist."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=296168cf337dce0aa1d7235e667c6f19283602d4de423ed763d58a4f230b2f2f"}
{"Ticker":"GOOGL","Date":1642623360,"Headline":"White House meets small and mid-sized firms to discuss competition in tech sector","Source":"Nasdaq","Summary":"White House officials met on Wednesday with small and mid-sized companies to discuss competition issues in the tech sector, as momentum grows in the U.S. Congress to rein in large technology companies."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=155c01d4d2b309fe7240e75db30db07bf9709afb07fe492ec1f589ea80ac97a4"}
{"Ticker":"GOOGL","Date":1642621620,"Headline":"How Ad Spending Can Help Alphabet and Meta Stock Keep Climbing","Source":"Yahoo","Summary":"The growth of short video formats, augmented and virtual reality and the creator economy, plus the convergence of e-commerce and advertising and the ongoing impact of Apple’s ad changes, are key themes for 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ae676ed928bf3fc34a061663afae3435d573559899ad60baa316af5b5d87b1fb"}
{"Ticker":"GOOGL","Date":1642620037,"Headline":"Tech Group Warns Biden That Antitrust Bills Carry Political Risk","Source":"Yahoo","Summary":"(Bloomberg) -- A tech-backed group is warning the White House that supporting an antitrust bill designed to curb the power of internet giants isn’t politically popular and could hurt Democrats ahead of November’s midterm elections.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessWhy Some Vaccinated People Resist Omicron and Others Don’tStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapBiden Expects Russia to ‘Move In’ on Ukraine; Warns of SanctionsMic"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec7eeebf896bb97f8af62e8faf354e28c3990cd91f6542ac0b2abc1819dbd0e3"}
{"Ticker":"GOOGL","Date":1642617488,"Headline":"Weybosset Research & Management Llc Buys Wynn Resorts, Alphabet Inc, Williams Inc, Sells TC ...","Source":"Yahoo","Summary":"Providence, RI, based Investment company Weybosset Research & Management Llc (Current Portfolio) buys Wynn Resorts, Alphabet Inc, Williams Inc, Coca-Cola Co, Kopin Corp, sells TC Energy Corp, Abbott Laboratories, Accenture PLC, Alphabet Inc, NRG Energy Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Weybosset Research & Management Llc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c3af342734a2269d3c97683c5e08637f18d705db0ae97ee876f1f3e3600f9316"}
{"Ticker":"GOOGL","Date":1642617100,"Headline":"Google Ropes In Former PayPal Executive For Payments Division: Report","Source":"Yahoo","Summary":"Alphabet Inc's (NASDAQ: GOOG) (NASDAQ: GOOGL) Google hired former PayPal Holdings Inc (NASDAQ: PYPL) executive Arnold Goldberg to run its payments division, Bloomberg reports. The hiring is a part of Google's broader strategy to team up with a broader range of financial services, including cryptocurrencies, the report quoted Bill Ready, Google's President of commerce. Ready, PayPal's former COO, joined Google in 2019 and recruited Goldberg, who ran PayPal's merchant business, to become the VP fo"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cfd064a6dfc5c7df47720810cc7a5c16a75a57e9b8f3e39d57e4a2bcc6eed9f5"}
{"Ticker":"GOOGL","Date":1642613820,"Headline":"It's the Earnings, Stupid - Part 2","Source":"Benzinga","Summary":"Last October—which feels like decades ago—I wrote a contrarian piece targeting those warning of a stock market crash of Depression-era proportions.  So long..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f4a6f7ea0d5806d333d15eb655823d638bc2aa093b27f9a80e672af1a06cc48a"}
{"Ticker":"GOOGL","Date":1642612205,"Headline":"Why Alphabet (GOOGL) Could Beat Earnings Estimates Again","Source":"Yahoo","Summary":"Alphabet (GOOGL) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3b2b8ab235ecc9f721d07fd393437b3f7780dbf169c223b558fb577b45cca4c7"}
{"Ticker":"GOOGL","Date":1642612205,"Headline":"Can Alphabet Inc. (GOOG) Keep the Earnings Surprise Streak Alive?","Source":"Yahoo","Summary":"Alphabet Inc. (GOOG) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=55934dc0e7775de47c53b5ff982d6a3c1d2170f041be46def435fdb9d0d849f1"}
{"Ticker":"GOOGL","Date":1642611600,"Headline":"Google Hires PayPal Vet to Reset Strategy After Its Banking Retreat","Source":"Yahoo","Summary":"(Bloomberg) -- Alphabet Inc.’s Google has hired former PayPal Holdings Inc. executive Arnold Goldberg to run its payments division and set a new course for the business after it scrapped a push into banking.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseBiden Expects Russia to ‘Move"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b2249a2a0d5b6a5661f05ce03e031188bc0227b5762bd31819270481de63a46a"}
{"Ticker":"GOOGL","Date":1642610697,"Headline":"Here's Why BofA Remains Bullish On Alphabet","Source":"Yahoo","Summary":"BofA analyst Justin Post raised the price target on Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) to $3,470 from $3,210 and reiterated a Buy rating on the shares. The price target implies an upside of 27%. The analyst expects deceleration in 2022 versus the 41% estimated search growth in 2021. However, he thinks Google is still early in applying artificial intelligence and machine learning technology across its ad stack. Related Content: Morgan Stanley Bumps Up Alphabet Price By 7.2% These new ini"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=57a8c716cb34bfa406f82809dedf040ec8db1265300099c8f1feff35280cbf12"}
{"Ticker":"GOOGL","Date":1642609984,"Headline":"Alphabet (GOOGL) Boosts Steaming Efforts With Annual Plans","Source":"Yahoo","Summary":"Alphabet's (GOOGL) Google introduces annual subscription plans for YouTube Premium and YouTube Music Premium, which are expected to strengthen its reach to customers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=65842bd12f269c6b4c12c5aa52c0be1302e5fee5ccb36027b10521db3871d940"}
{"Ticker":"GOOGL","Date":1642609564,"Headline":"A Deep Dive into the FAANG Earnings Charts","Source":"Yahoo","Summary":"Meta, Apple, Amazon, Netflix and Alphabet will report earnings shortly. Here's what to look for."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=592f353bd3aa348a1ad718c0e8c437055f7c52c69726fbdb7576cd481f9ffa27"}
{"Ticker":"GOOGL","Date":1642608149,"Headline":"Microsoft Buys Activision? We Take Profit And Increase The Exposure At The Same Time","Source":"SeekingAlpha","Summary":"Nobody saw this coming, but Microsoft is making a huge move with its acquisition of Activision. Read more about MSFT & ATVI stock and this deal here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c919dfb1859caa084ae8413af4b69697b1543dea3f65fd3f9f16029911c08f6"}
{"Ticker":"GOOGL","Date":1642607121,"Headline":"Exclusive-Google aims to improve spotty enforcement of children's ads policy","Source":"Finnhub","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search... | January 19, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ce27199790a9a0f94a3659a35fd526a7b9693d7a2eacf435c5fe6680f92b1090"}
{"Ticker":"GOOGL","Date":1642605060,"Headline":"2 New Titles For Netflix Games: What Investors Need To Know","Source":"Benzinga","Summary":"Netflix Inc (NASDAQ: NFLX) announced Tuesday the company is expanding its mobile gaming lineup with the addition of two new games. \nWhat Happened: Netflix launched..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5582b71461697a2bb2ee003937f642987547d58e563f0b30dbf8649f64389b33"}
{"Ticker":"GOOGL","Date":1642600260,"Headline":"BKKT Stock Alert: Why Is Bakkt in the Spotlight Today?","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5676a260a4fa02d283ebee79939a80760a070ccaecae7ee48ab8394f09f80c46"}
{"Ticker":"GOOGL","Date":1642596960,"Headline":"7 Stocks That Could Join Apple in the $3 Trillion-Dollar Club by 2030","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d150b3b703f56cae6db02e43a9eb0d4603fe514fdce336b21ea659f75bb51ca3"}
{"Ticker":"GOOGL","Date":1642594483,"Headline":"Exclusive-Google to improve enforcement of adult ads policy","Source":"Reuters","Summary":"Alphabet Inc's Google said this week it would immediately improve enforcement of an age-sensitive ad policy after Reuters found ads for sex toys, liquor and high-risk investments in its search engine that should have been blocked under its efforts to comply with UK regulations..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fc8b63d8f2a3a3f6593a5c67c71c13f15c4f7004f09d58edaa0886438e6d9e94"}
{"Ticker":"GOOGL","Date":1642593660,"Headline":"Google Partnership Makes Digital Turbine Stock a Must-Own","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1ba2765220bd610a4bac0f39b07c5ec108fc2aa34912476909c31e326c3db0aa"}
{"Ticker":"GOOGL","Date":1642589181,"Headline":"Microsoft: Activision, Azure, And Why It's Worth Every Penny","Source":"SeekingAlpha","Summary":"Microsoft is a best-of-breed software company whose competitive position looks as strong as ever. Read why the current valuation of MSFT stock seems reasonable."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=563249cd5a56b690a9acc035dea657e38d7be952c10f037a29153111a142d08a"}
{"Ticker":"GOOGL","Date":1642586460,"Headline":"US STOCKS-Wall St rises on earnings boost; Big Tech bounces back","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Wednesday after upbeat results from a host of companies partially offset a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback after a bruising selloff."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=53e439dc5abfb7833501baa5c86042f25e164db55d1e5189bad5d214a62cf424"}
{"Ticker":"GOOGL","Date":1642584060,"Headline":"Are These 3 Beaten-Down Dividend Stocks Ready to Turn It Around in 2022?","Source":"Nasdaq","Summary":"Last year was tough for some really popular dividend stocks. Established businesses struggled with everything from supply chain issues to labor shortages to hedge fund margin calls. Whatever plagued a company, the books on 2021 are now closed and it's time to look forward to new"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b73fdd99ac4d717a039bb479c9377c423578565ad5304b658e7245f9dd3e0c84"}
{"Ticker":"GOOGL","Date":1642583460,"Headline":"US STOCKS-Wall St set to open higher on earnings boost, Big Tech bounces back","Source":"Nasdaq","Summary":"Upbeat results from a host of companies nudged U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter reporting season, while Big Tech stocks also made a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=960db6dced7e6e3a9f40e57920b7ea9208fccea69702e24c66361d9fcb936877"}
{"Ticker":"GOOGL","Date":1642579649,"Headline":"Apple: Arms Race Laggard","Source":"SeekingAlpha","Summary":"Apple (AAPL) has started to under spend on R&D and CapEx. See why I think AAPL is no longer a leader in spending on capital expenditures."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2cc924071fe846df55f5141a8dbc7d4e1236ba1507ab2545d518eb3a96ae7df4"}
{"Ticker":"GOOGL","Date":1642579200,"Headline":"The Trade Desk: A Premium Valuation For The Clear Leader In Independent Advertising","Source":"SeekingAlpha","Summary":"Trade Desk has a solid balance sheet with nearly $800M in cash and short term investments. See why I will not be buying or selling TTD stock at current prices."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=dc708a6ab681bfe1ad41237f6a09e2cca73a37ab85270484dd02a3d8bb1a26a1"}
{"Ticker":"GOOGL","Date":1642579200,"Headline":"1 Compelling Real Estate Trend to Watch in 2022","Source":"Nasdaq","Summary":"Real estate is an exciting and fast-paced space to invest in, and this rings truer than ever as a new year kicks off. In this segment of Backstage Pass, recorded on Dec. 22, Fool contributor Deidre Woollard shares with fellow Fool contributor Rachel Warren the key trend she's wat"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2a71d788eef0bd624f37a7cb8762af485f48894df216ae5d3b263e78d5125257"}
{"Ticker":"GOOGL","Date":1642577520,"Headline":"US STOCKS-Futures gain as UnitedHealth, BofA rise on results","Source":"Nasdaq","Summary":"Upbeat results from UnitedHealth and Bank of America pushed U.S. stock index futures higher on Wednesday, partially righting a wobbly start to the fourth-quarter earnings reporting season, while Big Tech stocks also looked set to make a comeback."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2f4ddefc523927360e8aa74d4ef6bbe5b1ef2b73fed6ff2f9c06f5bd34261922"}
{"Ticker":"GOOGL","Date":1642575000,"Headline":"3 Reasons Why PubMatic Stock Is a Buy","Source":"Nasdaq","Summary":"Ad tech firm PubMatic (NASDAQ: PUBM) has seen its revenue rise consistently for the past four years. Even so, PubMatic shares are trading around $25 at the time of this writing, far below their 52-week high of $76.96. A key factor impacting the stock price is the sea change happe"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3548294a6d6453c92dc3f0427e762b90c560dad283d25013eefd461501e1fd4c"}
{"Ticker":"GOOGL","Date":1642572000,"Headline":"8 Best and Worst Cathie Wood Stock Calls of 2021 ","Source":"Nasdaq","Summary":"InvestorPlace - Stock Market News, Stock Advice & Trading Tips"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0969d77b0776dc3143b251b8b5451edbfa06cc0b1f7d63815d7e328998ae716e"}
{"Ticker":"GOOGL","Date":1642569660,"Headline":"4 Unstoppable Stocks That Can Run Circles Around Shiba Inu in 2022","Source":"Nasdaq","Summary":"Even though the stock market ended 2021 with one of its strongest performances in some time, it was cryptocurrencies that once again claimed supremacy. When the dust settled, the aggregate value of digital currencies nearly tripled to $2.2 trillion in 12 months."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d28062607b02af287461da3e5780e7d4cd84ca52a927892b72caa07ae7572e6"}
{"Ticker":"GOOGL","Date":1642568400,"Headline":"Big Tech and Foes Spar Over Bill to Curb Market Power of Dominant Internet Platforms","Source":"DowJones","Summary":"Technology companies and their critics are ramping up lobbying efforts in Congress this week as a key Senate panel takes up legislation that seeks to blunt the market power of dominant tech platforms. "," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f1e2c696d66111b5b6e8239f9f0661e8de86272cea78d082674ee1a1a9d7e3e7"}
{"Ticker":"GOOGL","Date":1642568400,"Headline":"Alphabet Unit Backs Shopify-Like Startup in Rare Indonesia Deal","Source":"Yahoo","Summary":"(Bloomberg) -- Indonesian software startup Lummo, formerly known as BukuKas, raised $80 million in a round led by Tiger Global and Sequoia Capital India to expand its business that helps small merchants get online.Most Read from BloombergMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseFourth Pfizer Dose Is Insufficient to Ward Off Omicron, Israeli Trial SuggestsCovid-19 Infected Lions Prompt Variant Warning in South AfricaStock Selloff Deepens as Treasury Yields Climb: Markets WrapN"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2367da3cb5ac57c14f706dcbb3c4cad152a434edd745073cc5f7c0d3a0eee239"}
{"Ticker":"GOOGL","Date":1642559884,"Headline":"United Capital Management of KS, Inc. Buys Alphabet Inc, Truist Financial Corp, JPMorgan Chase, ...","Source":"Yahoo","Summary":"Investment company United Capital Management of KS, Inc. (Current Portfolio) buys Alphabet Inc, Truist Financial Corp, JPMorgan Chase, NRG Energy Inc, SPDR Portfolio Short Term Corporate Bond ETF, sells ETFMG Prime Junior Silver Miners ETF, Verizon Communications Inc, Marvell Technology Inc, AMC Entertainment Holdings Inc, Where Food Comes From Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, United Capital Management of KS, Inc.."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=fd1afba2f58c7ee606d88646b3345a1cc1cd9598dba1d68d74d240591a447f41"}
{"Ticker":"GOOGL","Date":1642557600,"Headline":"Oracle opens data centre to provide cloud services across Africa","Source":"Nasdaq","Summary":"Oracle opened a data centre in South Africa on Wednesday to provide local cloud services across Africa for the first time, joining the likes of Microsoft and Amazon in setting up facilities in the southernmost country on the continent."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0d5a2a2b6de7081edc46dea322c46ac5dce4401560f8ef144220145861e77029"}
{"Ticker":"GOOGL","Date":1642551480,"Headline":"Why YouTube Is Cutting Back On Its Investments In Original Content","Source":"Benzinga","Summary":"Alphabet Inc (NASDAQ: GOOGL) (NASDAQ: GOOG) video streaming unit YouTube cut the bulk of its investment towards original programming.\nWhat Happened: Robert Kyncl, YouTube’s..."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b41e400ddf56e7c9531cb2fdd68cf3678e405b8c47494a33ef78cfadaae9c224"}
{"Ticker":"GOOGL","Date":1642721281,"Headline":"Senate Judiciary Panel Clears Tech-Focused Antitrust Bill","Source":"Yahoo","Summary":"(Bloomberg) -- The Senate Judiciary Committee on Thursday approved an antitrust bill aimed at Apple Inc., Meta Platforms Inc., Amazon.com Inc. and Alphabet Inc.’s Google, bringing the measure one step closer to consideration by the full Senate.Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessWhy Some Vaccinated People Resist Omicron and Others Don’tLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapThailand to Resume Quarantine-Free Tourism as Covid Ea"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=afafab90c60809e2ded63b92cd2ff1b2d350ef0677df7c8f636e3d83b08c0f8e"}
{"Ticker":"GOOGL","Date":1642720777,"Headline":"Google U.S. lobbying jumps 27% as lawmakers aim to rein in Big Tech","Source":"Reuters","Summary":"Alphabet Inc's Google reported 27% higher U.S. lobbying expenditures for 2021 compared to 2020, spending $9.6 million for the year, according to the Senate lobbying disclosure database."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1f82efb35901eea87289580c2fc7c92ee4fc75eefaa13bc062de25188353b44b"}
{"Ticker":"GOOGL","Date":1642718302,"Headline":"Tru Independence Asset Management 2, Llc Buys Vanguard Value ETF, Vanguard Small Cap Value ETF, ...","Source":"Yahoo","Summary":"Investment company Tru Independence Asset Management 2, Llc (Current Portfolio) buys Vanguard Value ETF, Vanguard Small Cap Value ETF, iShares MSCI EAFE ETF, Vanguard Mid-Cap ETF, iShares 1-3 Year Treasury Bond ETF, sells SPDR Bloomberg 1-3 Month T-Bill ETF, S&P 500 ETF TRUST ETF, Medtronic PLC, Visa Inc, Meta Platforms Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Tru Independence Asset Management 2, Llc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ec6fd077ad2aa849df6ff5633506d06c2db91303f88f184b530884cf931c729b"}
{"Ticker":"GOOGL","Date":1642718273,"Headline":"Vulcan explains why it's selling Google's South Lake Union campus","Source":"Yahoo","Summary":"After the sale, the real estate company will have five operating assets in the neighborhood, along with about a dozen more sites in various stages of planning for redevelopment."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ffdadf2c4f9ea527646516a07d6fc3a15332ec900ed45e183501741096df979a"}
{"Ticker":"GOOGL","Date":1642715836,"Headline":"UPDATE 1-Alphabet's unprofitable Verily unit in skin-care deal with L'Oreal","Source":"Yahoo","Summary":"Alphabet Inc's money-losing health tech arm Verily on Thursday announced a new tie-up in its search for sustainable revenue, saying it would study skin health and explore new products with cosmetics maker L'Oreal SA .  The company declined to disclose terms of what it called a \"strategic, multi-year partnership and research collaboration\" with L'Oreal.  Executives who have left Verily have criticized it for signing flashy, one-off research collaborations with pharmaceutical companies instead of focusing more attention on landing recurring subscribers to its software for clinical research and disease management."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7d8a6640d2013990c6a88e7f326817232990b102494b2376d69bbca8a42a554c"}
{"Ticker":"GOOGL","Date":1642712220,"Headline":"Senate Panel Approves Antitrust Bill Restricting Big Tech Platforms","Source":"Yahoo","Summary":"Apple, Amazon and Google say the bipartisan legislation barring tech platforms from favoring their own products could disrupt popular services for businesses and consumers."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3a2826c01e259514c0970dd9272e90adb3d3334e3ac869add0b8d3af77e85690"}
{"Ticker":"GOOGL","Date":1642711891,"Headline":"Epic Urges Court to Curb Apple’s ‘Dark Cloud’ of App Dominance","Source":"Yahoo","Summary":"(Bloomberg) -- Epic Games Inc. urged a federal appeals court to force Apple Inc. to allow more competition in the market for mobile applications, calling the iPhone maker’s rigid control of its App Store a “dark cloud.” Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tJeremy Grantham Doubles Down on Crash Call, Says Selloff Has StartedThailand t"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=2782658475527cb8af2cc4c2d4f73f41c60b92fabc78c92966d82826cac7a90a"}
{"Ticker":"GOOGL","Date":1642711360,"Headline":"Google appeals $2.7 billion EU antitrust fine","Source":"Yahoo","Summary":"Google parent Alphabet Inc. on Thursday said it filed a final appeal of a $2.7 billion European Union antitrust fine to the EU's Court of Justice, its highest court. The latest appeal to overturn a 2017 fine linked to its shopping-ads service contends the General Court pushed beyond EU legal precedents and revised the reasoning of the underlying EU antitrust decision. \"We feel there are areas that require legal clarification from the European Court of Justice,\" a Google spokeswoman said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=471e70d02e4b70884880118f9e5276cd627ae4640c85a1719a0b5ac339ab7b49"}
{"Ticker":"GOOGL","Date":1642710420,"Headline":"Cryptos Are Rising and Capital Is Flooding In. But a ‘Crypto Winter’ May Be Coming.","Source":"Yahoo","Summary":"Google could be making a push into blockchain technology, as crypto start-ups raise record sums. But the crypto market has lost a third of its value since peaking at $3 trillion last November."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=db64aa0d31945be980e916af76f29df427b4e140af064f1022698a3e29dc9a1b"}
{"Ticker":"GOOGL","Date":1642709011,"Headline":"Google launches fresh appeal to overturn $2.8 billion fine at top EU court","Source":"Yahoo","Summary":"EU Competition Commissioner Margrethe Vestager fined the world's most popular internet search engine in 2017 over the use of its own price comparison shopping service to gain an unfair advantage over smaller European rivals.  The case was the first of three decisions that have seen  Google rack up 8.25 billion euros in EU antitrust fines in the last decade.  In November, the EU's General Court largely dismissed Google's challenge against the fine, saying the European Commission correctly found the company's practices harmed competition."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=71fb732b0de8cc8be9e9384452e3f35db025787ee5d6c12bb6f4cf1951a7c1d4"}
{"Ticker":"GOOGL","Date":1642708800,"Headline":"Google launches fresh appeal to overturn $2.8 bln fine at top EU court","Source":"Yahoo","Summary":"Google is filing an appeal at the European Union's top court against an earlier decision to uphold a $2.8 billion antitrust fine, a spokesperson for the Alphabet unit said late on Thursday, the company's second bid to overturn the penalty.  EU Competition Commissioner Margrethe Vestager fined the world's most popular internet search engine in 2017 over the use of its own price comparison shopping service to gain an unfair advantage over smaller European rivals.  The case was the first of three decisions that have seen Google rack up 8.25 billion euros in EU antitrust fines in the last decade."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=05cffec3170aa7d3c1465bcd968b53fbaebb7b132622d407ff7a249728abf359"}
{"Ticker":"GOOGL","Date":1642708800,"Headline":"Google Asks EU’s Top Court to Overturn Record Antitrust Fine","Source":"Yahoo","Summary":"(Bloomberg) -- Google asked the European Union’s top court to strike down a 2.4 billion-euro ($2.7 billion) antitrust fine that bolstered regulators’ crackdown on big tech.Most Read from BloombergEarly Omicron Breakthroughs Show mRNA Vaccines’ WeaknessLate Rout in Tech Sends Nasdaq 100 Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tJeremy Grantham Doubles Down on Crash Call, Says Selloff Has StartedThailand to Resume Quarantine-Free Tourism as Covid EasesT"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4f9338b90690a8a234640fa5914dc44cb24dbdf996d2d5218513d5337c75d051"}
{"Ticker":"GOOGL","Date":1642707219,"Headline":"Stock market drop 'is an opportunity for some names,' strategist explains","Source":"Yahoo","Summary":"CFA and owner of Portia Capital Management Michelle Connell joins Yahoo Finance Live to discuss Big Tech, energy and financial sector fund data, commodity futures, and Fed policy makers expecting three interest rate hikes in 2022."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=423c6cd306daa86a862bb8120c1893a662ee53dd47284062efb1d82eede44a31"}
{"Ticker":"GOOGL","Date":1642705680,"Headline":"Senate panel approves antitrust bill targeting Apple, Google and Amazon","Source":"Yahoo","Summary":"The Senate Judiciary Committee on Thursday overwhelmingly passed antitrust legislation barring tech's biggest platforms from favoring their products and services over competitors, taking aim at Apple Inc., Google parent Alphabet Inc. and Amazon.com Inc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=d79a3111d7dfe6b1c350ea1b2041d4e4cc338e457c2d69ca2a0939589c59ec42"}
{"Ticker":"GOOGL","Date":1642703888,"Headline":"Northstar Advisory Group, LLC Buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit Bond ...","Source":"Yahoo","Summary":"Investment company Northstar Advisory Group, LLC (Current Portfolio) buys iShares Core S&P 500 ETF, iShares 1-3 Year Credit Bond ETF, Microsoft Corp, Alphabet Inc, Health Care Select Sector SPDR, sells iShares MSCI USA ESG Optimized ETF, SPDR Portfolio S&P 500 ETF, Vanguard Short-Term Government Bond ETF, SPDR Bloomberg 1-3 Month T-Bill ETF, SPDR Portfolio Short Term Treasury ETF during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Northstar Advisory"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7b4defdac188eb194421c00f77d1c014dcd3bd9ef6c546e84937eaacb6976d3e"}
{"Ticker":"GOOGL","Date":1642703885,"Headline":"Affinia Financial Group, Llc Buys Parsons Corp, Union Pacific Corp, MSCI USA ESG Select ETF, ...","Source":"Yahoo","Summary":"Investment company Affinia Financial Group, Llc (Current Portfolio) buys Parsons Corp, Union Pacific Corp, MSCI USA ESG Select ETF, iShares MSCI KLD 400 Social Index Fund, Alphabet Inc, sells iShares Core U.S."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=1a33dc19c0c099caba6c401b2f8e9fbb52349d6429f0badd33c4366a7e64d550"}
{"Ticker":"GOOGL","Date":1642700640,"Headline":"Stock market could drop another 10% soon: top strategist","Source":"Yahoo","Summary":"Market bulls should proceed with caution, warns a top strategist at Morgan Stanley."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9e98a899578c953cd207c9fed6c3d0f6d57abf2d7b47972e2e8afa114dac2979"}
{"Ticker":"GOOGL","Date":1642699729,"Headline":"Netflix quietly admits streaming competition is eating into growth","Source":"CNBC","Summary":"Netflix added a line in its quarterly shareholder letter acknowledging streaming competition is affecting its \"marginal growth.\""," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=647c4727b95f510bd5445c657366b1fec0afa3d7c8b5729451fcec4394460acb"}
{"Ticker":"GOOGL","Date":1642699220,"Headline":"Vaccine mandates ‘a real pressure point’ for companies, BCG global chair says","Source":"Yahoo","Summary":"Boston Consulting Group Global Chair Rich Lesser joins Yahoo Finance Live to discuss challenges corporate leaders are juggling, including employment, supply chains, COVID-19 vaccine mandates, and carbon emission reductions."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0c138a21e799256270f3c5b2cd259b1aff73a7fdb3ce8aca7f24a00d53114b14"}
{"Ticker":"GOOGL","Date":1642698643,"Headline":"Apple stock has made a huge move higher — is it time to sell?","Source":"Yahoo","Summary":"Is it time to take profits on Apple shares into the company's earnings? One top analyst weighs in."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=201b8908c26681c68db0de767da0f6bacb3c9754a09cda3d222a204c8e7900b8"}
{"Ticker":"GOOGL","Date":1642698000,"Headline":"Alphabet's Verily signs L'Oreal in multi-year skin deal as losses grow","Source":"Reuters","Summary":"Alphabet Inc's health tech arm Verily on Thursday announced its newest tie-up in its search for sustainable revenue, saying it would study skin health and explore new products with cosmetics maker L'Oreal SA."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b6a511b0bf54a5ab36e00b6e21e0b08fe8bfbb12ebadb28843cf08fca85b6fe9"}
{"Ticker":"GOOGL","Date":1642697836,"Headline":"Alphabet's unprofitable Verily unit in skin-care deal with L'Oreal","Source":"Finnhub","Summary":"Alphabet Inc's money-losinghealth tech arm Verily on Thursday announced a new tie-up in itssearch for sustainable revenue, saying it would study skinhealth and explore new products with cosmetics... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=30c78016b3c0891a07d6f8cddd1873ecd67d076e6a8b3eb1fb37dc487a1fabdc"}
{"Ticker":"GOOGL","Date":1642691700,"Headline":"Best Stocks To Buy Now? 3 Streaming Stocks In Focus Today","Source":"Nasdaq","Summary":"3 Top Streaming Stocks To Check Out Right NowWithout question, streaming stocks were among the most popular stocks to buy during the pandemic. Understandably so, as these companies provide products and services that suit the pandemic climate. However, some of these streaming comp"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=ac9ca07c5c58d69245da6472cfcf0d62123d30d25fcba899fdd18fe1e49950be"}
{"Ticker":"GOOGL","Date":1642691640,"Headline":"Google Appeals $2.7 Billion EU Antitrust Fine to Bloc's Highest Court","Source":"Finnhub","Summary":"By Sam Schechner Google is filing a last appeal of a $2.7 billion European Union antitrust fine, prolonging the legal battle over the first in a series of antitrust cases against the company.... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=46fa79ac6e9a269e119c029d408e93db880d2d5734860529b0753581870e2ac9"}
{"Ticker":"GOOGL","Date":1642691100,"Headline":"Self-driving sensor maker Luminar shares rally on Mercedes-Benz tie-up","Source":"Nasdaq","Summary":"Luxury carmaker Mercedes-Benz will partner with self-driving sensor maker Luminar Technologies Inc to enable fully automated driving on highways for its next-generation vehicles, Luminar's founder said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7ff00dc2e2a747271b05c1e39a5ff8228fa94afc94e0f40edab40eed3a69d62f"}
{"Ticker":"GOOGL","Date":1642691051,"Headline":"Microsoft's Activision Deal Is A Must - Buy On Weakness","Source":"SeekingAlpha","Summary":"we believe Microsoft has wrapped up a fantastic deal with Activision that should transform its gaming metaverse ambitions. Read more about MSFT stock here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f8f1fa47a8e31597c1ae920fc8840971e72345987393fa952f99fb7fd300ea65"}
{"Ticker":"GOOGL","Date":1642689668,"Headline":"It's Time To Go To Cash For The Next 7 Years - 1-Year Update","Source":"SeekingAlpha","Summary":"The stock market and bond market remain historically overvalued today, however, the almost all-encompassing bubble has started to break. Learn more here."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=f7c2ddd23e18619f5b895cfc30f95c30a25f601db8acf53fd3e1919c72fc2523"}
{"Ticker":"GOOGL","Date":1642685494,"Headline":"Is Now A Good Time To Consider Low-Volatility ETFs?","Source":"SeekingAlpha","Summary":"Low Volatility ETFs may seem like a good way to protect yourself against an oncoming bear market. Find out if now is a good time to consider buying them."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=be4dbc0c5a17348d2d3b9d2b7474880991858db3f923dc00411a2d1fa6e6128d"}
{"Ticker":"GOOGL","Date":1642684447,"Headline":"Bill targeting Big Tech approved by Senate panel","Source":"Finnhub","Summary":"The U.S. Senate JudiciaryCommittee on Thursday approved a bill that would bar tech giantslike Amazon.com Inc and Alphabet Inc's Googlefrom giving preference to their own businesses on... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=9bdc80d12cfefc5f8fdcd718066bf085fc5ba11ac7fd4826f1265e21e9173bdb"}
{"Ticker":"GOOGL","Date":1642682873,"Headline":"U.S. Senate panel votes to approve bill targeting Big Tech","Source":"Finnhub","Summary":"The U.S. Senate JudiciaryCommittee approved on Thursday a bill that would bar tech giantslike Amazon and Alphabet's Google from givingpreference to their own businesses on their websites. ... | January 20, 2022"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8f47ac77180ec731c5d049ee6740ff76dfafe3dd50b0cb34e02e486cd72c2a15"}
{"Ticker":"GOOGL","Date":1642679220,"Headline":"One Growth Stock to Buy in 2022 and Hold for the Next Decade","Source":"Yahoo","Summary":"This company dominates an industry with a growth tailwind that should continue over the next few years."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c0c767e2c39751753bcbff3c17b4ffe4858115ee057e1ca3bcb47d4a2f345bf6"}
{"Ticker":"GOOGL","Date":1642677840,"Headline":"Netflix could be Activision’s Plan B","Source":"Nasdaq","Summary":"NEW YORK (Reuters Breakingviews) -     If Microsoft has kicked off the game of who could buy Activision Blizzard, Netflix could be a surprise winner. The software giant’s $69 billion bid for the maker of “Call of Duty” is likely to"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=531db50bddebc105bc99f8b7adcdaa9dc6fb678c54c09a434557492c29e1b2d8"}
{"Ticker":"GOOGL","Date":1642676820,"Headline":"Disney (DIS) Creates International Content Hub, Boosts DTC Unit","Source":"Nasdaq","Summary":"The Walt Disney Company DIS is creating a new hub for international content creation to boost the expanding pipeline of local and regional content for its streaming services.The extension plan would support the worldwide expansion of the company’s direct-to-consumer (DTC)"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=66250647eaaffd1c474ea317481759a4d5055da4c3a0d609a789dc654613e14b"}
{"Ticker":"GOOGL","Date":1642676820,"Headline":"What's in the Cards for Texas Instruments' (TXN) Q4 Earnings?","Source":"Nasdaq","Summary":"Texas Instruments Incorporated TXN is scheduled to report fourth-quarter 2021 results on Jan 25."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=caec124b92029751c7554a1f568a36cc59fb51d1930ee7e84d91d92af9668f61"}
{"Ticker":"GOOGL","Date":1642673471,"Headline":"Microsoft launches Chromebook rival with specialised software for schools","Source":"Yahoo","Summary":"The low-cost devices will come with Windows 11 SE, set up to take on Google’s Chrome OS"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c37d0a3bfc5229fd7d1464e85a13730f1fe08ef628a70a40022f38c02f439eb8"}
{"Ticker":"GOOGL","Date":1642673160,"Headline":"US STOCKS-Growth bargains, upbeat earnings take Wall Street higher","Source":"Nasdaq","Summary":"U.S. stock indexes rose on Thursday on strong earnings reports, while bargain hunting boosted mega-cap growth companies after the Nasdaq index plunged into correction territory in the previous session."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=41723a364b6f65901d1188fa99ea089f3e6c418d338aa4e513ef01d51f3bc4af"}
{"Ticker":"GOOGL","Date":1642671030,"Headline":"Facebook, Google Face Tighter Ad-Tracking Curbs in Europe","Source":"Yahoo","Summary":"(Bloomberg) -- Tech platforms such as Alphabet Inc.’s Google and Meta Platforms Inc.’s Facebook face tighter restrictions on how they target ads to users, after European lawmakers voted to toughen upcoming legislation.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessWhy Some Vaccinated People Resist Omicron and Others Don’tBiden Expects Russia to ‘Move In’ on Ukraine; Warns of SanctionsStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapIs Covid Becomin"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=86bbcf380d6b494d3314bca99a03a53f8d63cf19ca47dc92c09bf4dbd332939a"}
{"Ticker":"GOOGL","Date":1642669740,"Headline":"US STOCKS-Wall Street set to open higher after upbeat earnings","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday as upbeat results from American Airlines and Travelers kept the positive momentum going for the fourth-quarter earnings season, a day after the tech-heavy Nasdaq index plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=8c1cbf1b5be1f96e95e8c74681e0a3e48312870513789e9f5a923ffdb311558f"}
{"Ticker":"GOOGL","Date":1642669200,"Headline":"Mercedes-Benz teams up with Luminar on self-driving tech","Source":"Nasdaq","Summary":"Luxury carmaker Mercedes-Benz will partner with self-driving sensor maker Luminar Technologies Inc to enable fully automated driving on highways for its next-generation vehicles, Luminar's founder said."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=60726d0c476fdecf06857a5689f38427aefcd76d1786a1fc91448e4148169709"}
{"Ticker":"GOOGL","Date":1642667700,"Headline":"Investing In Metaverse Real Estate","Source":"SeekingAlpha","Summary":"A new REIT capitalizing on virtual real estate recently filed for an IPO. Read this article to check out what the metaverse means for REIT investors."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6d73cd6ac1c6b5c89523396c96a9a71b8f0a75883b2602415fe8ab123ff9072f"}
{"Ticker":"GOOGL","Date":1642666080,"Headline":"GLOBAL MARKETS-Wall Street headed higher as tech investors lick their wounds","Source":"Nasdaq","Summary":"Wall Street was headed higher on Thursday, pulling European shares back into the black as investors in Big Tech licked their wounds after Nasdaq's slide into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=a55c88092289c8e8f74effd7c53a10b3d0383abc2014203a228128481fd606c2"}
{"Ticker":"GOOGL","Date":1642664940,"Headline":"U.S. stock futures rise on earnings after Nasdaq enters correction territory","Source":"Nasdaq","Summary":"U.S. stock futures rose on Thursday on a string of strong earnings led by American Airlines and insurer Travelers, a day after the tech-heavy Nasdaq plunged into correction territory."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=bdbded73dae2ec0cd25707914357b80a3e3e1c932e4f63e807c26c94f979f350"}
{"Ticker":"GOOGL","Date":1642659600,"Headline":"Don't Buy Cryptocurrency; Buy These 3 Stocks Instead","Source":"Nasdaq","Summary":"The value of cryptocurrencies has exploded over the past two years with big names like Bitcoin and Ethereum doing well, and altcoins like Solana and Dogecoin returning many multiples for investors. But the volatile nature of cryptocurrency and its uncertain future mean that it mi"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=b64a9ad51cff8471bd3a38e401277f1628f5949a36df4a046b0db04a7528b316"}
{"Ticker":"GOOGL","Date":1642658400,"Headline":"Bills targeting Big Tech to go before U.S. Senate panel","Source":"Nasdaq","Summary":"The U.S. Senate Judiciary Committee is set to decide Thursday whether the full Senate should vote on two bills aimed at reining in tech giants like Alphabet's Google and Meta's Facebook."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=049446f8bc5a58b7379a12b3430d0cfbc2c7d5ce35fa90c255f21ebc093dc402"}
{"Ticker":"GOOGL","Date":1642655183,"Headline":"Telenor partners with Amazon to modernise systems, offer services","Source":"Yahoo","Summary":"Norway's Telenor said on Thursday it had partnered with Amazon Web Services (AWS) to speed up the modernisation of its telecoms systems, boosting the use of cloud technology to offer 5G and low-latency data services to professional customers.  In collaboration with the U.S. tech giant, Telenor will develop product offerings for selected industries, including manufacturing, logistics and automotive, the Norwegian firm's chief executive told Reuters."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7fec333e96366905c6f4286bb93acd8912538c458b22daeaf1c08ca8b2266d13"}
{"Ticker":"GOOGL","Date":1642645469,"Headline":"Sonos, Yelp Tell White House to Back Big Tech Antitrust Bill","Source":"Yahoo","Summary":"(Bloomberg) -- Amazon.com Inc. and Google parent Alphabet Inc. need to be regulated so smaller businesses can compete, a panel that included the chief executive officers of Sonos Inc. and Yelp Inc. told White House advisers Wednesday.Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapMicrosoft Buys Scandal-Tainted Activision in Bet on MetaverseWhy Some Vaccinated People Resist Omicron and Others Don’tCov"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=108135fc669867a55d5e676b79dccb2b59dbffdb5b78c71e4ad8fb27baf47cd3"}
{"Ticker":"GOOGL","Date":1642644403,"Headline":"U.S. Antitrust Bill Expanded to Include TikTok, Tencent’s WeChat","Source":"Yahoo","Summary":"(Bloomberg) -- A technology-focused antitrust bill set to be considered by a U.S. Senate committee Thursday will be expanded to include China’s two largest social media companies -- a change that seeks to address criticism that the legislation would give an advantage to foreign digital firms. Most Read from BloombergEarly Omicron Breakthroughs Show MRNA Vaccines’ WeaknessStocks Drop as Selloff Puts Nasdaq Into Correction: Markets WrapWhy Some Vaccinated People Resist Omicron and Others Don’tBide"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=473ea589c4f879fcab7d8a8fabeaa8b1fb17c8ff536ac65903c0d31906012be9"}
{"Ticker":"GOOGL","Date":1642639954,"Headline":"Google Partners with Crypto Exchanges to Allow Digital Asset Cards","Source":"Yahoo","Summary":"Global search and technology giant Google is slowly dipping its toes into the world of crypto as evidenced by its latest move to accept crypto stored on digital cards through various partnerships."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=e4ad787a2366309315a9bc425005024c9d4954b491fd253ff59e547999116213"}
{"Ticker":"GOOGL","Date":1642639680,"Headline":"Texas sues Google over local radio ads for its smartphones","Source":"Yahoo","Summary":"Texas' attorney general on Wednesday sued Google, alleging the company asked local radio DJs to record personal endorsements for smartphones that they hadn't used or been provided."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4803e02e6195d0b35bfc5cef6f01e007de97aee045827caead9f5e11a6afb288"}
{"Ticker":"GOOGL","Date":1642765500,"Headline":"Google asks judge to dismiss most of Texas antitrust lawsuit","Source":"Nasdaq","Summary":"Alphabet Inc's Google asked a federal judge on Friday to dismiss the majority of an antitrust lawsuit filed by Texas and other states that accused the search giant of abusing its dominance of the online advertising market."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=5e92deba5b36427539a643a3207c6361a5f6e926713181194656a64f35ef25d3"}
{"Ticker":"GOOGL","Date":1642760400,"Headline":"US STOCKS-Nasdaq extends declines to fourth day on Netflix letdown","Source":"Nasdaq","Summary":"Wall Street's main indexes fell on Friday, with the Nasdaq set for its fourth straight day of declines after a weak forecast from Netflix sent its shares along with other streaming companies spiraling lower."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0bac3e033fb71e9430cc064c8a478922faa5e3deee22f3ed2025f090e2b77d0f"}
{"Ticker":"GOOGL","Date":1642759860,"Headline":"2 Reasons Activision Shareholders Shouldn't Be Quick to Sell Ahead of a Microsoft Deal","Source":"Nasdaq","Summary":"Microsoft's (NASDAQ: MSFT) proposal to buy top game publisher Activision Blizzard (NASDAQ: ATVI) is far from a done deal. On Tuesday, the software giant agreed to pay $68.7 billion, or $95 per share, in an all-cash deal to buy Activision."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7a93ca76be9ce769b232c4b898dcb57834986ffddec998d20a0f9d5a6729cd44"}
{"Ticker":"GOOGL","Date":1642755540,"Headline":"Where Will Snowflake Be in 1 Year?","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) has served its early investors well. Warren Buffett's Berkshire Hathaway invested in this stock before the IPO at a significantly discounted price. When Snowflake ultimately debuted for retail investors, it was priced at more than double the $120 per share"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=6dffdc165d9582d986761f7986ead652b390f6fc1191e78ad67b6d76e2c3058d"}
{"Ticker":"GOOGL","Date":1642753440,"Headline":"F5 Networks (FFIV) to Report Q1 Earnings: What's in Store?","Source":"Nasdaq","Summary":"F5 Networks FFIV is set to report first-quarter fiscal 2022 results on Jan 25."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=0226f2e67b315dd33a01e33b63d4f24aa38bff1e828d1ad4c52d4c29e5d5df48"}
{"Ticker":"GOOGL","Date":1642752360,"Headline":"Snowflake Stock: Bear vs. Bull","Source":"Nasdaq","Summary":"Snowflake (NYSE: SNOW) launched the largest software IPO ever in September 2020. The cloud-based data warehousing company went public at $120 per share, started trading at $245, and hit an all-time high of $405 a share last November.But over the past two months, Snowflake's stock"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=c125abffa32d67037717c3bc79bef2e14e44dca89823945e59098c1a23cea22c"}
{"Ticker":"GOOGL","Date":1642752240,"Headline":"Google Is Going All-In on In-Person Work, Which Could Be Great News for Office Investors","Source":"Nasdaq","Summary":"The pandemic has dealt a dreadful blow to office REITs, or real estate investment trusts, and the worst may still be yet to come. That's because we're nearing the two-year anniversary of not just the start of the pandemic but also remote work."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=50582dd9bf1073443b66c8a62315a2d21cfce8e0ab99ccdc9352171ed06a8d31"}
{"Ticker":"GOOGL","Date":1642751580,"Headline":"Top Stock Market News For Today January 21, 2022","Source":"Nasdaq","Summary":"Stock Market Futures Dip Following Disappointing Job Market DataU.S stock futures are trading downwards  this morning after another day of losses. In general, this is likely due to ongoing pressure from the pandemic and inflation weighing in on the economy and earnings. Take yest"," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=cc31a8c66ac3b451a338796d060445931d6d6e626f034aac2986cf84bd46b1e6"}
{"Ticker":"GOOGL","Date":1642741560,"Headline":"2 FAANG Stocks to Buy and 1 to Avoid in 2022","Source":"Nasdaq","Summary":"Wall Street delivered another winning year in 2021. The benchmark S&P 500 rocketed higher by 27%, which is more than double its average annual total return of 11% (including dividends) dating back to 1980."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=4ba9e484bfa42f1dfbf715f794714d924981edb965da51a1490c7edfd73a48f2"}
{"Ticker":"GOOGL","Date":1642740206,"Headline":"The Mercator International Opportunity Fund Q4 2021 Report","Source":"SeekingAlpha","Summary":"Click here to read Mercator International Opportunity Fund's Q4 2021 report."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=7c1965604bc07941452eaf1916653671989f811110d247bc42d7d0c942daa472"}
{"Ticker":"GOOGL","Date":1642732685,"Headline":"Insight Folios Inc Buys Lumen Technologies Inc, TC Energy Corp, PayPal Holdings Inc, Sells ...","Source":"Yahoo","Summary":"Investment company Insight Folios Inc (Current Portfolio) buys Lumen Technologies Inc, TC Energy Corp, PayPal Holdings Inc, MongoDB Inc, Wix.com, sells Formula Folios Tactical Income ETF, Discover Financial Services, FormulaFolios Tactical Growth ETF, Qualcomm Inc during the 3-months ended 2021Q4, according to the most recent filings of the investment company, Insight Folios Inc."," Url":null,"Url":"https:\/\/finnhub.io\/api\/news?id=3527cc0cf99c1f9b80f54ce14e666fd7cfbbab522c9d557007cf7de4aaf45988"}
